[Killed] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Converter/DateConverter.cs:16:17
         public object Convert(object value, Type targetType, object parameter, CultureInfo culture)
         {
             DateTime? date = value as DateTime?;
-            if (date == null)
+            if (date != null)
             {
                 return null; 
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.ConvertTest.DateConvertTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Converter/DateConverter.cs:17:13
         {
             DateTime? date = value as DateTime?;
             if (date == null)
-            {
-                return null; 
-            }
+            {}
             return date.Value.ToString("dd/MM/yyyy");
         }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.ConvertTest.DateConvertTest

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Converter/DateConverter.cs:25:13
 
         public object ConvertBack(object value, Type targetType, object parameter, CultureInfo culture)
         {
-            throw new NotImplementedException();
+            ;
         }
     }
