[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Converter/DurationConverter.cs:16:17
         public object Convert(object value, Type targetType, object parameter, CultureInfo culture)
         {
             TimeSpan duration = (TimeSpan) value;
-            if (duration.Hours * 60 + duration.Minutes < 60)
+            if (duration.Hours * 60 + duration.Minutes <= 60)
             {
                 return (duration.Hours * 60 + duration.Minutes).ToString() + "'";

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Converter/DurationConverter.cs:16:17
         public object Convert(object value, Type targetType, object parameter, CultureInfo culture)
         {
             TimeSpan duration = (TimeSpan) value;
-            if (duration.Hours * 60 + duration.Minutes < 60)
+            if (!(duration.Hours * 60 + duration.Minutes < 60))
             {
                 return (duration.Hours * 60 + duration.Minutes).ToString() + "'";

[NoCoverage] Arithmetic mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Converter/DurationConverter.cs:18:25
             TimeSpan duration = (TimeSpan) value;
             if (duration.Hours * 60 + duration.Minutes < 60)
             {
-                return (duration.Hours * 60 + duration.Minutes).ToString() + "'";
+                return (duration.Hours / 60 + duration.Minutes).ToString() + "'";
             }
             return duration.ToString(@"hh\:mm");

[NoCoverage] Arithmetic mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Converter/DurationConverter.cs:18:25
             TimeSpan duration = (TimeSpan) value;
             if (duration.Hours * 60 + duration.Minutes < 60)
             {
-                return (duration.Hours * 60 + duration.Minutes).ToString() + "'";
+                return (duration.Hours * 60 - duration.Minutes).ToString() + "'";
             }
             return duration.ToString(@"hh\:mm");
