[Killed] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Converter/TimeConverter.cs:20:40
             {
                 return null;
             }
-            return date.Value.ToString("HH:mm");
+            return date.Value.ToString("");
         }
 
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.ConvertTest.TimeConvertTest
