[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Account.cs:18:9
 
         public Account() { }
         public Account(string id, string name, string pass, int type, string email, string displayname)
-        {
-            _id = id;
-            _username = name;
-            _password = pass;
-            _email = email;
-            _type= type;
-            _displayname = displayname;
-        }
+        {}
         public string id { get { return _id; } set { _id = value; } }
         public string username { get { return _username; } set { _username = value; } }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Account.cs:26:32
             _type= type;
             _displayname = displayname;
         }
-        public string id { get { return _id; } set { _id = value; } }
+        public string id { get {} set { _id = value; } }
         public string username { get { return _username; } set { _username = value; } }
         public string password { get { return _password; } set { _password = value; } }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Account.cs:26:52
             _type= type;
             _displayname = displayname;
         }
-        public string id { get { return _id; } set { _id = value; } }
+        public string id { get { return _id; } set {} }
         public string username { get { return _username; } set { _username = value; } }
         public string password { get { return _password; } set { _password = value; } }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Account.cs:27:64
             _displayname = displayname;
         }
         public string id { get { return _id; } set { _id = value; } }
-        public string username { get { return _username; } set { _username = value; } }
+        public string username { get { return _username; } set {} }
         public string password { get { return _password; } set { _password = value; } }
         public string email { get { return _email; } set { _email = value; } }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Account.cs:27:38
             _displayname = displayname;
         }
         public string id { get { return _id; } set { _id = value; } }
-        public string username { get { return _username; } set { _username = value; } }
+        public string username { get {} set { _username = value; } }
         public string password { get { return _password; } set { _password = value; } }
         public string email { get { return _email; } set { _email = value; } }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Account.cs:28:38
         }
         public string id { get { return _id; } set { _id = value; } }
         public string username { get { return _username; } set { _username = value; } }
-        public string password { get { return _password; } set { _password = value; } }
+        public string password { get {} set { _password = value; } }
         public string email { get { return _email; } set { _email = value; } }
         public string displayname { get { return _displayname; } set { _displayname = value; } }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Account.cs:28:64
         }
         public string id { get { return _id; } set { _id = value; } }
         public string username { get { return _username; } set { _username = value; } }
-        public string password { get { return _password; } set { _password = value; } }
+        public string password { get { return _password; } set {} }
         public string email { get { return _email; } set { _email = value; } }
         public string displayname { get { return _displayname; } set { _displayname = value; } }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Account.cs:29:58
         public string id { get { return _id; } set { _id = value; } }
         public string username { get { return _username; } set { _username = value; } }
         public string password { get { return _password; } set { _password = value; } }
-        public string email { get { return _email; } set { _email = value; } }
+        public string email { get { return _email; } set {} }
         public string displayname { get { return _displayname; } set { _displayname = value; } }
         public int type { get { return _type; } set { _type = value; } }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Account.cs:29:35
         public string id { get { return _id; } set { _id = value; } }
         public string username { get { return _username; } set { _username = value; } }
         public string password { get { return _password; } set { _password = value; } }
-        public string email { get { return _email; } set { _email = value; } }
+        public string email { get {} set { _email = value; } }
         public string displayname { get { return _displayname; } set { _displayname = value; } }
         public int type { get { return _type; } set { _type = value; } }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Account.cs:30:41
         public string username { get { return _username; } set { _username = value; } }
         public string password { get { return _password; } set { _password = value; } }
         public string email { get { return _email; } set { _email = value; } }
-        public string displayname { get { return _displayname; } set { _displayname = value; } }
+        public string displayname { get {} set { _displayname = value; } }
         public int type { get { return _type; } set { _type = value; } }
     }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Account.cs:30:70
         public string username { get { return _username; } set { _username = value; } }
         public string password { get { return _password; } set { _password = value; } }
         public string email { get { return _email; } set { _email = value; } }
-        public string displayname { get { return _displayname; } set { _displayname = value; } }
+        public string displayname { get { return _displayname; } set {} }
         public int type { get { return _type; } set { _type = value; } }
     }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Account.cs:31:53
         public string password { get { return _password; } set { _password = value; } }
         public string email { get { return _email; } set { _email = value; } }
         public string displayname { get { return _displayname; } set { _displayname = value; } }
-        public int type { get { return _type; } set { _type = value; } }
+        public int type { get { return _type; } set {} }
     }
 }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Account.cs:31:31
         public string password { get { return _password; } set { _password = value; } }
         public string email { get { return _email; } set { _email = value; } }
         public string displayname { get { return _displayname; } set { _displayname = value; } }
-        public int type { get { return _type; } set { _type = value; } }
+        public int type { get {} set { _type = value; } }
     }
 }
