[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/FlightClass.cs:17:13
 
         private void RaisePropertyChanged([CallerMemberName] string propertyName = "")
         {
-            this.PropertyChanged?.Invoke(this, new PropertyChangedEventArgs(propertyName));
+            ;
         }
         private string classId;

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/FlightClass.cs:22:17
         private string classId;
         public string ClassId
         {
-            get { return classId; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/FlightClass.cs:26:17
             set
             {
                 classId = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/FlightClass.cs:32:17
         private string percent;
         public string Percent
         {
-            get { return percent; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/FlightClass.cs:36:17
             set
             {
                 percent = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/FlightClass.cs:42:17
         private string classColor;
         public string ClassColor
         {
-            get { return classColor; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/FlightClass.cs:46:17
             set
             {
                 classColor = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/FlightClass.cs:52:17
         private string className;
         public string ClassName
         {
-            get { return className; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/FlightClass.cs:56:17
             set
             {
                 className = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/FlightClass.cs:60:97
             }
         }
         public FlightClass() { }
-        public FlightClass(string classId, string className, string percent, string classColor) {
-            this.classId = classId;
-            this.percent = percent; 
-            this.className = className;
-            this.classColor = classColor;   
-        }
+        public FlightClass(string classId, string className, string percent, string classColor) {}
         public FlightClass(string className, string classColor)
         {

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/FlightClass.cs:67:9
             this.classColor = classColor;   
         }
         public FlightClass(string className, string classColor)
-        {
-            this.className = className;
-            this.classColor = classColor;
-        }
+        {}
     }
 }
