[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/QLHangVeClass.cs:16:69
         private string mahangve;
         private string soluong;
 
-        public string Machuyenbay { get { return machuyenbay; } set { machuyenbay = value; } }
+        public string Machuyenbay { get { return machuyenbay; } set {} }
         public string Mahangve { get { return mahangve; } set { mahangve = value; OnPropertyChanged("Mahangve"); } }
         public string Soluong { get { return soluong; } set { soluong = value; OnPropertyChanged("Soluong"); } }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/QLHangVeClass.cs:16:41
         private string mahangve;
         private string soluong;
 
-        public string Machuyenbay { get { return machuyenbay; } set { machuyenbay = value; } }
+        public string Machuyenbay { get {} set { machuyenbay = value; } }
         public string Mahangve { get { return mahangve; } set { mahangve = value; OnPropertyChanged("Mahangve"); } }
         public string Soluong { get { return soluong; } set { soluong = value; OnPropertyChanged("Soluong"); } }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/QLHangVeClass.cs:17:83
         private string soluong;
 
         public string Machuyenbay { get { return machuyenbay; } set { machuyenbay = value; } }
-        public string Mahangve { get { return mahangve; } set { mahangve = value; OnPropertyChanged("Mahangve"); } }
+        public string Mahangve { get { return mahangve; } set { mahangve = value; ; } }
         public string Soluong { get { return soluong; } set { soluong = value; OnPropertyChanged("Soluong"); } }
         public event PropertyChangedEventHandler PropertyChanged;

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/QLHangVeClass.cs:17:38
         private string soluong;
 
         public string Machuyenbay { get { return machuyenbay; } set { machuyenbay = value; } }
-        public string Mahangve { get { return mahangve; } set { mahangve = value; OnPropertyChanged("Mahangve"); } }
+        public string Mahangve { get {} set { mahangve = value; OnPropertyChanged("Mahangve"); } }
         public string Soluong { get { return soluong; } set { soluong = value; OnPropertyChanged("Soluong"); } }
         public event PropertyChangedEventHandler PropertyChanged;

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/QLHangVeClass.cs:18:37
 
         public string Machuyenbay { get { return machuyenbay; } set { machuyenbay = value; } }
         public string Mahangve { get { return mahangve; } set { mahangve = value; OnPropertyChanged("Mahangve"); } }
-        public string Soluong { get { return soluong; } set { soluong = value; OnPropertyChanged("Soluong"); } }
+        public string Soluong { get {} set { soluong = value; OnPropertyChanged("Soluong"); } }
         public event PropertyChangedEventHandler PropertyChanged;
         protected virtual void OnPropertyChanged(string newname)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/QLHangVeClass.cs:18:80
 
         public string Machuyenbay { get { return machuyenbay; } set { machuyenbay = value; } }
         public string Mahangve { get { return mahangve; } set { mahangve = value; OnPropertyChanged("Mahangve"); } }
-        public string Soluong { get { return soluong; } set { soluong = value; OnPropertyChanged("Soluong"); } }
+        public string Soluong { get { return soluong; } set { soluong = value; ; } }
         public event PropertyChangedEventHandler PropertyChanged;
         protected virtual void OnPropertyChanged(string newname)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/QLHangVeClass.cs:22:17
         public event PropertyChangedEventHandler PropertyChanged;
         protected virtual void OnPropertyChanged(string newname)
         {
-            if (PropertyChanged != null)
+            if (PropertyChanged == null)
             {
                 PropertyChanged(this, new PropertyChangedEventArgs(newname));

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/QLHangVeClass.cs:24:17
         {
             if (PropertyChanged != null)
             {
-                PropertyChanged(this, new PropertyChangedEventArgs(newname));
+                ;
             }
         }
