[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SBTrungGian.cs:22:17
         private string flightId;
         public string FlightId
         {
-            get { return flightId; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SBTrungGian.cs:26:17
             set
             {
                 flightId = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SBTrungGian.cs:32:17
         private string airportID;
         public string AirportID
         {
-            get { return airportID; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SBTrungGian.cs:36:17
             set
             {
                 airportID = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SBTrungGian.cs:42:17
         private string airportName;
         public string AirportName
         {
-            get { return airportName; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SBTrungGian.cs:46:17
             set
             {
                 airportName = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SBTrungGian.cs:52:17
         private TimeSpan timeStop;
         public TimeSpan TimeStop
         {
-            get { return timeStop; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SBTrungGian.cs:56:17
             set
             {
                 timeStop = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SBTrungGian.cs:62:17
         private string note;
         public string Note
         {
-            get { return note; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SBTrungGian.cs:66:17
             set
             {
                 note = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SBTrungGian.cs:71:9
         }
         public SBTrungGian() { }
         public SBTrungGian(string airportName, TimeSpan timeStop)
-        {
-            this.airportName = airportName;
-            this.timeStop = timeStop;
-        }
+        {}
     }
 }
