[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SymbolTicket.cs:22:17
         private string tuyen;
         public string Tuyen
         {
-            get { return tuyen; }
+            get {}
             set { tuyen = value; RaisePropertyChanged(); }
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SymbolTicket.cs:23:34
         public string Tuyen
         {
             get { return tuyen; }
-            set { tuyen = value; RaisePropertyChanged(); }
+            set { tuyen = value; ; }
         }
         private string soGhe;

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SymbolTicket.cs:28:17
         private string soGhe;
         public string SoGhe
         {
-            get { return soGhe; }
+            get {}
             set { soGhe = value; RaisePropertyChanged(); }
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SymbolTicket.cs:29:34
         public string SoGhe
         {
             get { return soGhe; }
-            set { soGhe = value; RaisePropertyChanged(); }
+            set { soGhe = value; ; }
         }
         private string hangVe;

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SymbolTicket.cs:34:17
         private string hangVe;
         public string HangVe
         {
-            get { return hangVe; }
+            get {}
             set { hangVe = value; RaisePropertyChanged(); }
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SymbolTicket.cs:35:35
         public string HangVe
         {
             get { return hangVe; }
-            set { hangVe = value; RaisePropertyChanged(); }
+            set { hangVe = value; ; }
         }
         private string tenHK;

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SymbolTicket.cs:40:17
         private string tenHK;
         public string TenHK
         {
-            get { return tenHK; }
+            get {}
             set { tenHK = value; RaisePropertyChanged(); }
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SymbolTicket.cs:41:34
         public string TenHK
         {
             get { return tenHK; }
-            set { tenHK = value; RaisePropertyChanged(); }
+            set { tenHK = value; ; }
         }
         private string ngayGio;

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SymbolTicket.cs:46:17
         private string ngayGio;
         public string NgayGio
         {
-            get { return ngayGio; }
+            get {}
             set { ngayGio = value; RaisePropertyChanged(); }
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SymbolTicket.cs:47:36
         public string NgayGio
         {
             get { return ngayGio; }
-            set { ngayGio = value; RaisePropertyChanged(); }
+            set { ngayGio = value; ; }
         }
         private string maVe;

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SymbolTicket.cs:50:34
             set { ngayGio = value; RaisePropertyChanged(); }
         }
         private string maVe;
-        public string MaVe { get { return maVe; } set { maVe = value; } }
+        public string MaVe { get {} set { maVe = value; } }
         public SymbolTicket(string maVe, string tuyen, string ngayGio, string soGhe, string hangVe, string tenHK)
         {

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SymbolTicket.cs:50:55
             set { ngayGio = value; RaisePropertyChanged(); }
         }
         private string maVe;
-        public string MaVe { get { return maVe; } set { maVe = value; } }
+        public string MaVe { get { return maVe; } set {} }
         public SymbolTicket(string maVe, string tuyen, string ngayGio, string soGhe, string hangVe, string tenHK)
         {

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SymbolTicket.cs:52:9
         private string maVe;
         public string MaVe { get { return maVe; } set { maVe = value; } }
         public SymbolTicket(string maVe, string tuyen, string ngayGio, string soGhe, string hangVe, string tenHK)
-        {
-            this.maVe = maVe;
-            this.tuyen = tuyen;
-            this.ngayGio = ngayGio;
-            this.soGhe = soGhe;
-            this.hangVe = hangVe;
-            this.tenHK = tenHK;
-        }
+        {}
 
         public SymbolTicket(string maVe, string soGhe, string hangVe, string tenHK)

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/SymbolTicket.cs:62:9
         }
 
         public SymbolTicket(string maVe, string soGhe, string hangVe, string tenHK)
-        {
-            this.maVe=maVe;
-            this.hangVe=hangVe;
-            this.soGhe=soGhe;
-            this.tenHK=tenHK;
-        }
+        {}
     }
 }
