[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Ticket.cs:22:17
         private string ticketID;
         public string TiketID
         {
-            get { return ticketID; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Ticket.cs:26:17
             set
             {
                 ticketID = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Ticket.cs:32:17
         private string flightClass;
         public string FlightClass
         {
-            get { return flightClass; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Ticket.cs:36:17
             set
             {
                 flightClass = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Ticket.cs:42:17
         private int seatNumber;
         public int SeatNumber
         {
-            get { return seatNumber; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Ticket.cs:46:17
             set
             {
                 seatNumber = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Ticket.cs:52:17
         private string status;
         public string Status
         {
-            get { return status; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Ticket.cs:56:17
             set
             {
                 status = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Ticket.cs:62:17
         private string color;
         public string Color
         {
-            get { return color; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Ticket.cs:66:17
             set
             {
                 color = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Ticket.cs:73:17
         private string hkID;
         public string HkID
         {
-            get { return hkID; }
+            get {}
             set { hkID = value; }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Ticket.cs:74:17
         public string HkID
         {
             get { return hkID; }
-            set { hkID = value; }
+            set {}
         }
         private string hkName;

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Ticket.cs:79:17
         private string hkName;
         public string HkName
         {
-            get { return hkName; }
+            get {}
             set { hkName = value; }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Ticket.cs:80:17
         public string HkName
         {
             get { return hkName; }
-            set { hkName = value; }
+            set {}
         }
 

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Ticket.cs:86:17
         private string cmnd;
         public string CMND
         {
-            get { return cmnd; }
+            get {}
             set { cmnd = value; }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Ticket.cs:87:17
         public string CMND
         {
             get { return cmnd; }
-            set { cmnd = value; }
+            set {}
         }
 

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Ticket.cs:93:17
         private string phoneNumber;
         public string PhoneNumber
         {
-            get { return phoneNumber; }
+            get {}
             set { phoneNumber = value; }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Ticket.cs:94:17
         public string PhoneNumber
         {
             get { return phoneNumber; }
-            set { phoneNumber = value; }
+            set {}
         }
 

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Ticket.cs:99:9
 
         public Ticket() { }
         public Ticket(string ticketID, string flightClass, int seatNumber, string status, string color)
-        {
-            this.ticketID = ticketID;
-            this.flightClass = flightClass;
-            this.seatNumber = seatNumber;
-            this.status = status;
-            this.color = color;
-        }
+        {}
 
         public Ticket(string ticketID, string flightClass, int seatNumber, string status, string hkID, string hkName, string cmnd, string phoneNumber)

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Ticket.cs:108:9
         }
 
         public Ticket(string ticketID, string flightClass, int seatNumber, string status, string hkID, string hkName, string cmnd, string phoneNumber)
-        {
-            this.ticketID = ticketID;
-            this.flightClass = flightClass;
-            this.seatNumber = seatNumber;
-            this.status = status;
-            this.hkID = hkID;
-            this.hkName = hkName;
-            this.cmnd = cmnd;
-            this.phoneNumber = phoneNumber;
-        }
+        {}
     }
 }
