[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:16:17
         private string flightID;
         public string FlightID
         {
-            get { return flightID; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:20:17
             set
             {
                 flightID = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:26:17
         private string airlineLogo;
         public string AirlineLogo
         {
-            get { return airlineLogo; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:30:17
             set
             {
                 airlineLogo = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:36:17
         private string airlineName;
         public string AirlineName
         {
-            get { return airlineName; }
+            get {}
             set
             {

[Killed] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:40:17
             set
             {
                 airlineName = value;
-                RaisePropertyChanged();
+                ;
             }
         }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.PropertyChangedTest.PropertyChangedEventHandlerIsRaised

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:46:17
         private string airportDepartureName;
         public string AirportDepartureName
         {
-            get { return airportDepartureName; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:50:17
             set
             {
                 airportDepartureName = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:57:17
         private string airportDestinationName;
         public string AirportDestinationName
         {
-            get { return airportDestinationName; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:61:17
             set
             {
                 airportDestinationName = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:68:17
         private string timeDeparture;
         public string TimeDeparture
         {
-            get { return timeDeparture; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:72:17
             set
             {
                 timeDeparture = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:79:17
         private string timeDestination;
         public string TimeDestination
         {
-            get { return timeDestination; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:83:17
             set
             {
                 timeDestination = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:90:17
         private DateTime dateTimeDestination;
         public DateTime DateTimeDestination
         {
-            get { return dateTimeDestination; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:94:17
             set
             {
                 dateTimeDestination = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:100:17
         private DateTime dateTimeDeparture;
         public DateTime DateTimeDeparture
         {
-            get { return dateTimeDeparture; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:104:17
             set
             {
                 dateTimeDeparture = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:110:17
         private TimeSpan time;
         public TimeSpan Time
         {
-            get { return time; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:114:17
             set
             {
                 time = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:121:17
 
         public int Stop
         {
-            get { return stop; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:125:17
             set
             {
                 stop = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:132:17
 
         public long Price
         {
-            get { return price; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:136:17
             set
             {
                 price = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:143:17
 
         public int AvailableSeats
         {
-            get { return availableSeats; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:147:17
             set
             {
                 availableSeats = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:154:17
 
         public int BookedSeats
         {
-            get { return bookedSeats; }
+            get {}
             set
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:158:17
             set
             {
                 bookedSeats = value;
-                RaisePropertyChanged();
+                ;
             }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:163:9
         }
         public Flight() { }
-        {
-            this.flightID = flightID;
-            this.airlineLogo = airlineLogo;
-            this.airlineName = airlineName;
-            this.airportDepartureName = airportDepartureName;
-            this.airportDestinationName = airportDestinationName;
-            this.timeDestination = timeDestination;
-            this.timeDeparture = timeDeparture;
-            this.time= time;
-            this.stop = stop;
-            this.price = price;
-            this.dateTimeDeparture = dateTimeDeparture; 
-            this.dateTimeDestination = dateTimeDestination; 
-        }
+        {}
         {

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/Flight.cs:178:9
             this.dateTimeDestination = dateTimeDestination; 
         }
-        {
-            this.flightID = flightID;
-            this.airlineLogo = airlineLogo;
-            this.airlineName = airlineName;
-            this.airportDepartureName = airportDepartureName;
-            this.airportDestinationName = airportDestinationName;
-            this.timeDestination = timeDestination;
-            this.timeDeparture = timeDeparture;
-            this.time = time;
-            this.stop = stop;
-            this.price = price;
-            this.dateTimeDeparture = dateTimeDeparture;
-            this.dateTimeDestination = dateTimeDestination;
-            this.availableSeats = availableSeats;
-            this.bookedSeats = bookedSeats;
-        }
+        {}
 
 
