[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:23:13
             SqlCommand cmd = new SqlCommand(commandText, conn);
 
             cmd.CommandType = commandType;
-            cmd.Parameters.AddRange(parameters);
+            ;
             conn.Open();
             SqlDataReader reader = cmd.ExecuteReader();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:24:13
 
             cmd.CommandType = commandType;
             cmd.Parameters.AddRange(parameters);
-            conn.Open();
+            ;
             SqlDataReader reader = cmd.ExecuteReader();
             return reader;

[Survived] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:31:71
 
 
         //public static SqlConnection sqlConnection = new SqlConnection(@"Data Source=(local);Initial Catalog=QuanLyBanVeMayBay;Integrated Security=True");
-        public static SqlConnection sqlConnection = new SqlConnection(@"Data Source=.\SQLEXPRESS;Initial Catalog=QuanLyBanVeMayBay;Integrated Security=True");
+        public static SqlConnection sqlConnection = new SqlConnection("");
 
         public static List<string> colorList = new List<string>() { "#C8D70C", "#CB1D1D", "#459DF2", "#459DF2", "#F44EEE", "#ECA65D", "#ECA65D", "#C0F081" };

[Survived] Collection initializer mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:33:48
         //public static SqlConnection sqlConnection = new SqlConnection(@"Data Source=(local);Initial Catalog=QuanLyBanVeMayBay;Integrated Security=True");
         public static SqlConnection sqlConnection = new SqlConnection(@"Data Source=.\SQLEXPRESS;Initial Catalog=QuanLyBanVeMayBay;Integrated Security=True");
 
-        public static List<string> colorList = new List<string>() { "#C8D70C", "#CB1D1D", "#459DF2", "#459DF2", "#F44EEE", "#ECA65D", "#ECA65D", "#C0F081" };
+        public static List<string> colorList = new List<string>() {};
     }
 }
