[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/AllFlight.xaml.cs:35:13
         public event RoutedEventHandler ShowDetail;
         public AllFlight()
         {
-            InitializeComponent();
+            ;
             DataProvider.sqlConnection.Open();
             SqlCommand sqlCommand = new SqlCommand(

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/AllFlight.xaml.cs:36:13
         public AllFlight()
         {
             InitializeComponent();
-            DataProvider.sqlConnection.Open();
+            ;
             SqlCommand sqlCommand = new SqlCommand(
              "select [c].*, Logo, TenHang, (select count(*) from [SANBAYTRUNGGIAN] [sbtg] where [sbtg].MaChuyenBay = [c].MaChuyenBay) SoSBTG, " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/AllFlight.xaml.cs:38:14
             InitializeComponent();
             DataProvider.sqlConnection.Open();
             SqlCommand sqlCommand = new SqlCommand(
-             "select [c].*, Logo, TenHang, (select count(*) from [SANBAYTRUNGGIAN] [sbtg] where [sbtg].MaChuyenBay = [c].MaChuyenBay) SoSBTG, " +
+             "" +
              "(select count(*) from [VE] [v1] where [v1].MaChuyenBay = [c].MaChuyenBay and [v1].TinhTrang = 'TRONG') SoVeTrong, " +
              "(select count(*) from [VE] [v2] where [v2].MaChuyenBay = [c].MaChuyenBay and [v2].TinhTrang != 'TRONG') SoVeDat " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/AllFlight.xaml.cs:40:14
             SqlCommand sqlCommand = new SqlCommand(
              "select [c].*, Logo, TenHang, (select count(*) from [SANBAYTRUNGGIAN] [sbtg] where [sbtg].MaChuyenBay = [c].MaChuyenBay) SoSBTG, " +
              "(select count(*) from [VE] [v1] where [v1].MaChuyenBay = [c].MaChuyenBay and [v1].TinhTrang = 'TRONG') SoVeTrong, " +
-             "(select count(*) from [VE] [v2] where [v2].MaChuyenBay = [c].MaChuyenBay and [v2].TinhTrang != 'TRONG') SoVeDat " +
+             "" +
              "from [CHUYENBAY] [c], [SANBAY] [s1], [SANBAY] [s2], [HANGMAYBAY] [hmb] " +
              "where [c].SanBayDi=[s1].MaSanBay " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/AllFlight.xaml.cs:42:14
              "(select count(*) from [VE] [v1] where [v1].MaChuyenBay = [c].MaChuyenBay and [v1].TinhTrang = 'TRONG') SoVeTrong, " +
              "(select count(*) from [VE] [v2] where [v2].MaChuyenBay = [c].MaChuyenBay and [v2].TinhTrang != 'TRONG') SoVeDat " +
              "from [CHUYENBAY] [c], [SANBAY] [s1], [SANBAY] [s2], [HANGMAYBAY] [hmb] " +
-             "where [c].SanBayDi=[s1].MaSanBay " +
+             "" +
              "and [c].SanBayDen=[s2].MaSanBay " +
              "and [c].MaHangMayBay=[hmb].MaHang ",

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/AllFlight.xaml.cs:48:17
             DataProvider.sqlConnection);
             SqlDataReader reader = sqlCommand.ExecuteReader();
             List<Flight> flight_list = new List<Flight>();
-            if (reader.HasRows)
+            if (!(reader.HasRows))
             {
                 while (reader.Read())

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/AllFlight.xaml.cs:50:24
             List<Flight> flight_list = new List<Flight>();
             if (reader.HasRows)
             {
-                while (reader.Read())
+                while (!(reader.Read()))
                 {
                     string flightID = reader["MaChuyenBay"].ToString();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/AllFlight.xaml.cs:54:49
                 {
                     string flightID = reader["MaChuyenBay"].ToString();
                     string airlineLogo = reader["Logo"].ToString();
-                    string airlineName = reader["TenHang"].ToString();
+                    string airlineName = reader[""].ToString();
                     string airportDepartureName = reader["SanBayDi"].ToString();
                     string airportDestinationName = reader["SanBayDen"].ToString();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/AllFlight.xaml.cs:57:82
                     string airlineName = reader["TenHang"].ToString();
                     string airportDepartureName = reader["SanBayDi"].ToString();
                     string airportDestinationName = reader["SanBayDen"].ToString();
-                    string ngayGioXuatPhat = reader["NgayKhoiHanh"].ToString() + " " + reader["ThoiGianXuatPhat"].ToString();
+                    string ngayGioXuatPhat = reader["NgayKhoiHanh"].ToString() + "" + reader["ThoiGianXuatPhat"].ToString();
                     CultureInfo provider = CultureInfo.InvariantCulture;
                     string format = "d/M/yyyy HH:mm";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/AllFlight.xaml.cs:66:75
                     DateTime dateTimeDestination = dateTimeDeparture.Add(time);
 
                     string timeDeparture = dateTimeDeparture.ToString("HH:mm");
-                    string timeDestination = dateTimeDestination.ToString("HH:mm");
+                    string timeDestination = dateTimeDestination.ToString("");
 
                     int stop = int.Parse(reader["SoSBTG"].ToString());

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/AllFlight.xaml.cs:68:49
                     string timeDeparture = dateTimeDeparture.ToString("HH:mm");
                     string timeDestination = dateTimeDestination.ToString("HH:mm");
 
-                    int stop = int.Parse(reader["SoSBTG"].ToString());
+                    int stop = int.Parse(reader[""].ToString());
                     long price = long.Parse(reader["Gia"].ToString()); int availableSeats = int.Parse(reader["SoVeTrong"].ToString());
                     int bookedSeats = int.Parse(reader["SoVeDat"].ToString());

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/AllFlight.xaml.cs:70:56
 
                     int stop = int.Parse(reader["SoSBTG"].ToString());
                     long price = long.Parse(reader["Gia"].ToString()); int availableSeats = int.Parse(reader["SoVeTrong"].ToString());
-                    int bookedSeats = int.Parse(reader["SoVeDat"].ToString());
+                    int bookedSeats = int.Parse(reader[""].ToString());
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/AllFlight.xaml.cs:75:13
 
                 }
             }
-            DataProvider.sqlConnection.Close();
+            ;
 
             lvFlight.ItemsSource = flight_list;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/AllFlight.xaml.cs:83:13
         private void FlightList_SelectionChanged(object sender, SelectionChangedEventArgs e)
         {
             var selectedFlight = (Flight)lvFlight.SelectedItem;
-            lvFlight.ScrollIntoView(lvFlight.SelectedIndex);
+            ;
             if (selectedFlight != null)
             {

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/AllFlight.xaml.cs:84:17
         {
             var selectedFlight = (Flight)lvFlight.SelectedItem;
             lvFlight.ScrollIntoView(lvFlight.SelectedIndex);
-            if (selectedFlight != null)
+            if (selectedFlight == null)
             {
                 //dữ liệu cần truyền sang cho flightListDetail

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/AllFlight.xaml.cs:92:17
                 dateTimeDeparture = selectedFlight.DateTimeDeparture;
                 dateTimeDestination = selectedFlight.DateTimeDestination;
                 airlineLogo = selectedFlight.AirlineLogo;
-                ShowDetail?.Invoke(this, new RoutedEventArgs());
+                ;
                 lvFlight.SelectedIndex = -1;
             }

[NoCoverage] UnaryMinusExpression to UnaryPlusExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/AllFlight.xaml.cs:93:42
                 dateTimeDestination = selectedFlight.DateTimeDestination;
                 airlineLogo = selectedFlight.AirlineLogo;
                 ShowDetail?.Invoke(this, new RoutedEventArgs());
-                lvFlight.SelectedIndex = -1;
+                lvFlight.SelectedIndex = +1;
             }
         }
