[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:38:13
         public void ShowDetail(string mave, string user_id)
         {
             MaVe = mave;
-            DataProvider.sqlConnection.Open();
+            ;
             SqlCommand sqlCommand = new SqlCommand(
                 "select [cb].MaChuyenBay, [cb].SanBayDi, [cb].SanBayDen, [cb].NgayKhoiHanh, [cb].ThoiGianXuatPhat, [cb].ThoiGIanDuKien, " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:41:25
             DataProvider.sqlConnection.Open();
             SqlCommand sqlCommand = new SqlCommand(
                 "select [cb].MaChuyenBay, [cb].SanBayDi, [cb].SanBayDen, [cb].NgayKhoiHanh, [cb].ThoiGianXuatPhat, [cb].ThoiGIanDuKien, " +
-                        "[v].MaVe, [v].SoGhe, [v].TenHK, [v].MaHK, [v].CMND, [v].SDT, [v].GiaVe, " +
+                        "" +
                         "[hv].TenHangVe, " +
                         "[hd].MaHD, [hd].NgayLap, [hd].ThanhTien, [hd].TinhTrang, [hd].MaTK, " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:42:25
             SqlCommand sqlCommand = new SqlCommand(
                 "select [cb].MaChuyenBay, [cb].SanBayDi, [cb].SanBayDen, [cb].NgayKhoiHanh, [cb].ThoiGianXuatPhat, [cb].ThoiGIanDuKien, " +
                         "[v].MaVe, [v].SoGhe, [v].TenHK, [v].MaHK, [v].CMND, [v].SDT, [v].GiaVe, " +
-                        "[hv].TenHangVe, " +
+                        "" +
                         "[hd].MaHD, [hd].NgayLap, [hd].ThanhTien, [hd].TinhTrang, [hd].MaTK, " +
                         "[s1].TenSanBay sbDi, [s2].TenSanBay sbDen " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:44:25
                         "[v].MaVe, [v].SoGhe, [v].TenHK, [v].MaHK, [v].CMND, [v].SDT, [v].GiaVe, " +
                         "[hv].TenHangVe, " +
                         "[hd].MaHD, [hd].NgayLap, [hd].ThanhTien, [hd].TinhTrang, [hd].MaTK, " +
-                        "[s1].TenSanBay sbDi, [s2].TenSanBay sbDen " +
+                        "" +
                 "from [CHUYENBAY] [cb], [VE] [v], [HANGVE] [hv], [HOADON] [hd], [CTHD] [ct], [SANBAY] [s1], [SANBAY] [s2] " +
                 "where  [hd].MaHD = [ct].MaHD and " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:46:17
                         "[hd].MaHD, [hd].NgayLap, [hd].ThanhTien, [hd].TinhTrang, [hd].MaTK, " +
                         "[s1].TenSanBay sbDi, [s2].TenSanBay sbDen " +
                 "from [CHUYENBAY] [cb], [VE] [v], [HANGVE] [hv], [HOADON] [hd], [CTHD] [ct], [SANBAY] [s1], [SANBAY] [s2] " +
-                "where  [hd].MaHD = [ct].MaHD and " +
+                "" +
                         "[v].MaVe = [ct].MaVe and " +
                         "[v].MaChuyenBay = [cb].MaChuyenBay and " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:47:25
                         "[s1].TenSanBay sbDi, [s2].TenSanBay sbDen " +
                 "from [CHUYENBAY] [cb], [VE] [v], [HANGVE] [hv], [HOADON] [hd], [CTHD] [ct], [SANBAY] [s1], [SANBAY] [s2] " +
                 "where  [hd].MaHD = [ct].MaHD and " +
-                        "[v].MaVe = [ct].MaVe and " +
+                        "" +
                         "[v].MaChuyenBay = [cb].MaChuyenBay and " +
                         "[hv].MaHangVe = [v].MaHangVe and " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:49:25
                 "where  [hd].MaHD = [ct].MaHD and " +
                         "[v].MaVe = [ct].MaVe and " +
                         "[v].MaChuyenBay = [cb].MaChuyenBay and " +
-                        "[hv].MaHangVe = [v].MaHangVe and " +
+                        "" +
                         "[s1].MaSanBay = [cb].SanBayDi and " +
                         "[s2].MaSanBay = [cb].SanBayDen and " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:51:25
                         "[v].MaChuyenBay = [cb].MaChuyenBay and " +
                         "[hv].MaHangVe = [v].MaHangVe and " +
                         "[s1].MaSanBay = [cb].SanBayDi and " +
-                        "[s2].MaSanBay = [cb].SanBayDen and " +
+                        "" +
                         "[v].MaVe = @mave ", DataProvider.sqlConnection);
             sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = mave;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:53:39
                         "[s1].MaSanBay = [cb].SanBayDi and " +
                         "[s2].MaSanBay = [cb].SanBayDen and " +
                         "[v].MaVe = @mave ", DataProvider.sqlConnection);
-            sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = mave;
+            sqlCommand.Parameters.Add("", SqlDbType.NVarChar).Value = mave;
             SqlDataReader reader = sqlCommand.ExecuteReader();
             if (reader.HasRows)

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:55:17
                         "[v].MaVe = @mave ", DataProvider.sqlConnection);
             sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = mave;
             SqlDataReader reader = sqlCommand.ExecuteReader();
-            if (reader.HasRows)
+            if (!(reader.HasRows))
             {
                 if (reader.Read())

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:57:21
             SqlDataReader reader = sqlCommand.ExecuteReader();
             if (reader.HasRows)
             {
-                if (reader.Read())
+                if (!(reader.Read()))
                 {
                     maCBTxt.Text = reader["MaChuyenBay"].ToString();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:59:43
             {
                 if (reader.Read())
                 {
-                    maCBTxt.Text = reader["MaChuyenBay"].ToString();
+                    maCBTxt.Text = reader[""].ToString();
                     tuTxt.Text = reader["sbDi"].ToString();
                     denTxt.Text = reader["sbDen"].ToString();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:61:42
                 {
                     maCBTxt.Text = reader["MaChuyenBay"].ToString();
                     tuTxt.Text = reader["sbDi"].ToString();
-                    denTxt.Text = reader["sbDen"].ToString();
+                    denTxt.Text = reader[""].ToString();
                     gioBayTxt.Text = reader["NgayKhoiHanh"].ToString() + " " + reader["ThoiGianXuatPhat"].ToString();
                     tgBayTxt.Text = reader["ThoiGianDuKien"].ToString() + " phút";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:62:74
                     maCBTxt.Text = reader["MaChuyenBay"].ToString();
                     tuTxt.Text = reader["sbDi"].ToString();
                     denTxt.Text = reader["sbDen"].ToString();
-                    gioBayTxt.Text = reader["NgayKhoiHanh"].ToString() + " " + reader["ThoiGianXuatPhat"].ToString();
+                    gioBayTxt.Text = reader["NgayKhoiHanh"].ToString() + "" + reader["ThoiGianXuatPhat"].ToString();
                     tgBayTxt.Text = reader["ThoiGianDuKien"].ToString() + " phút";
 

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:67:44
 
                     maVeTxt.Text = mave;
                     giaVeTxt.Text = reader["GiaVe"].ToString();
-                    soGheTxt.Text = reader["SoGhe"].ToString();
+                    soGheTxt.Text = reader[""].ToString();
                     tenHangVeTxt.Text = reader["TenHangVe"].ToString();
 

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:71:43
                     tenHangVeTxt.Text = reader["TenHangVe"].ToString();
 
                     tenHKTxt.Text = reader["TenHK"].ToString();
-                    maHKTxt.Text = reader["MaHK"].ToString();
+                    maHKTxt.Text = reader[""].ToString();
                     cmndTxt.Text = reader["CMND"].ToString();
                     sdtTxt.Text = reader["SDT"].ToString();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:73:42
                     tenHKTxt.Text = reader["TenHK"].ToString();
                     maHKTxt.Text = reader["MaHK"].ToString();
                     cmndTxt.Text = reader["CMND"].ToString();
-                    sdtTxt.Text = reader["SDT"].ToString();
+                    sdtTxt.Text = reader[""].ToString();
 
                     maHDTxt.Text = reader["MaHD"].ToString();

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:84:17
             }
             DataProvider.sqlConnection.Close();
 
-            if (tinhTrangTxt.Text == "UNPAID")
+            if (tinhTrangTxt.Text != "UNPAID")
             {
                 if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)

[NoCoverage] Logical mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:86:21
 
             if (tinhTrangTxt.Text == "UNPAID")
             {
-                if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)
+                if (MainWindow.curAccount.type == 1 && MainWindow.curAccount.type == 2)
                 {
                     btnPay.Content = "Đã thanh toán";

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:86:21
 
             if (tinhTrangTxt.Text == "UNPAID")
             {
-                if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)
+                if (!(MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2))
                 {
                     btnPay.Content = "Đã thanh toán";

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:95:13
         }
         private void Update_ReturnMyBookings(object sender, RoutedEventArgs e)
         {
-            ReturnBookings?.Invoke(this, new RoutedEventArgs());
+            ;
         }
         private void Pay_ReturnMyBookings(object sender, RoutedEventArgs e)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:99:13
         }
         private void Pay_ReturnMyBookings(object sender, RoutedEventArgs e)
         {
-            Pay_ReturnBookings?.Invoke(this, new RoutedEventArgs());
+            ;
         }
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:105:13
         private void btnPay_Click(object sender, RoutedEventArgs e)
         {
             BookingsPay bookingsPay = new BookingsPay();
-            bookingsPay.ShowBill(maHDTxt.Text, ngayLapTxt.Text, maCBTxt.Text, gioBayTxt.Text, tienTxt.Text);
+            ;
             bookingsPay.ReturnBookings += Update_ReturnMyBookings;
             bookingsPay.Return += Pay_ReturnMyBookings;

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:106:13
         {
             BookingsPay bookingsPay = new BookingsPay();
             bookingsPay.ShowBill(maHDTxt.Text, ngayLapTxt.Text, maCBTxt.Text, gioBayTxt.Text, tienTxt.Text);
-            bookingsPay.ReturnBookings += Update_ReturnMyBookings;
+            bookingsPay.ReturnBookings -= Update_ReturnMyBookings;
             bookingsPay.Return += Pay_ReturnMyBookings;
             bookingsPay.ShowDialog();

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:107:13
             BookingsPay bookingsPay = new BookingsPay();
             bookingsPay.ShowBill(maHDTxt.Text, ngayLapTxt.Text, maCBTxt.Text, gioBayTxt.Text, tienTxt.Text);
             bookingsPay.ReturnBookings += Update_ReturnMyBookings;
-            bookingsPay.Return += Pay_ReturnMyBookings;
+            bookingsPay.Return -= Pay_ReturnMyBookings;
             bookingsPay.ShowDialog();
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:108:13
             bookingsPay.ShowBill(maHDTxt.Text, ngayLapTxt.Text, maCBTxt.Text, gioBayTxt.Text, tienTxt.Text);
             bookingsPay.ReturnBookings += Update_ReturnMyBookings;
             bookingsPay.Return += Pay_ReturnMyBookings;
-            bookingsPay.ShowDialog();
+            ;
         }
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:114:13
         private void btnUpdate_Click(object sender, RoutedEventArgs e)
         {
             BookingsUpdate bookingsUpdate = new BookingsUpdate();
-            bookingsUpdate.ShowInforHK(MaVe);
+            ;
             bookingsUpdate.ReturnBookings += Update_ReturnMyBookings;
             bookingsUpdate.ShowDialog();

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:115:13
         {
             BookingsUpdate bookingsUpdate = new BookingsUpdate();
             bookingsUpdate.ShowInforHK(MaVe);
-            bookingsUpdate.ReturnBookings += Update_ReturnMyBookings;
+            bookingsUpdate.ReturnBookings -= Update_ReturnMyBookings;
             bookingsUpdate.ShowDialog();
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/BookingsDetails.xaml.cs:116:13
             BookingsUpdate bookingsUpdate = new BookingsUpdate();
             bookingsUpdate.ShowInforHK(MaVe);
             bookingsUpdate.ReturnBookings += Update_ReturnMyBookings;
-            bookingsUpdate.ShowDialog();
+            ;
         }
     }
