[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:34:13
         public MyBookings()
         {
             InitializeComponent();
-            addSearchOptions();
+            ;
         }
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:40:13
         public void MyTicket(string userID)
         {
             user_id = userID;
-            DataProvider.sqlConnection.Open();
+            ;
             SqlCommand sqlCommand = new SqlCommand(
                 "select distinct [cb].MaChuyenBay, [ct].MaHD, [v].MaVe, [v].TenHK, [v].SoGhe, [hv].TenHangVe, [cb].SanBayDi, [cb].SanBayDen,[cb].NgayKhoiHanh, [cb].ThoiGianXuatPhat " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:42:17
             user_id = userID;
             DataProvider.sqlConnection.Open();
             SqlCommand sqlCommand = new SqlCommand(
-                "select distinct [cb].MaChuyenBay, [ct].MaHD, [v].MaVe, [v].TenHK, [v].SoGhe, [hv].TenHangVe, [cb].SanBayDi, [cb].SanBayDen,[cb].NgayKhoiHanh, [cb].ThoiGianXuatPhat " +
+                "" +
                 "from [HOADON] [hd], [VE] [v], [CTHD] [ct], [CHUYENBAY] [cb], [HANGVE] [hv]" +
                 "where  [hd].MaHD = [ct].MaHD and " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:48:25
                         "[v].MaVe = [ct].MaVe and " +
                         "[v].MaChuyenBay = [cb].MaChuyenBay and " +
                         "[hv].MaHangVe = [v].MaHangVe and " +
-                        "[hd].MaTK = @userID and [v].TenHK is not NULL " +
+                        "" +
                 "order by [v].MaVe DESC", DataProvider.sqlConnection);
             sqlCommand.Parameters.Add("@userID", SqlDbType.NVarChar).Value = userID;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:49:17
                         "[v].MaChuyenBay = [cb].MaChuyenBay and " +
                         "[hv].MaHangVe = [v].MaHangVe and " +
                         "[hd].MaTK = @userID and [v].TenHK is not NULL " +
-                "order by [v].MaVe DESC", DataProvider.sqlConnection);
+                "", DataProvider.sqlConnection);
             sqlCommand.Parameters.Add("@userID", SqlDbType.NVarChar).Value = userID;
             SqlDataReader reader = sqlCommand.ExecuteReader();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:50:39
                         "[hv].MaHangVe = [v].MaHangVe and " +
                         "[hd].MaTK = @userID and [v].TenHK is not NULL " +
                 "order by [v].MaVe DESC", DataProvider.sqlConnection);
-            sqlCommand.Parameters.Add("@userID", SqlDbType.NVarChar).Value = userID;
+            sqlCommand.Parameters.Add("", SqlDbType.NVarChar).Value = userID;
             SqlDataReader reader = sqlCommand.ExecuteReader();
 

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:55:17
 
             List<SymbolTicket> list = new List<SymbolTicket>();
 
-            if (reader.HasRows)
+            if (!(reader.HasRows))
             {
                 while (reader.Read())

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:61:78
                 {
                     string mave = reader["MaVe"].ToString();
                     string tuyen = reader["SanBayDi"].ToString() + " - " + reader["SanBayDen"].ToString();
-                    string ngaygio = reader["ThoiGianXuatPhat"].ToString() + " " + reader["NgayKhoiHanh"].ToString();
+                    string ngaygio = reader["ThoiGianXuatPhat"].ToString() + "" + reader["NgayKhoiHanh"].ToString();
                     string soghe = reader["SoGhe"].ToString();
                     string hangve = reader["TenHangVe"].ToString();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:61:45
                 {
                     string mave = reader["MaVe"].ToString();
                     string tuyen = reader["SanBayDi"].ToString() + " - " + reader["SanBayDen"].ToString();
-                    string ngaygio = reader["ThoiGianXuatPhat"].ToString() + " " + reader["NgayKhoiHanh"].ToString();
+                    string ngaygio = reader[""].ToString() + " " + reader["NgayKhoiHanh"].ToString();
                     string soghe = reader["SoGhe"].ToString();
                     string hangve = reader["TenHangVe"].ToString();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:65:21
                     string soghe = reader["SoGhe"].ToString();
                     string hangve = reader["TenHangVe"].ToString();
                     string tenhk = reader["TenHK"].ToString();
-                    list.Add(new SymbolTicket(mave, tuyen, ngaygio, soghe, hangve, tenhk));
+                    ;
                 }
             }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:71:17
             DataProvider.sqlConnection.Close();
 
             lvTicket.ItemsSource = list;
-            if (list.Count == 0)
+            if (list.Count != 0)
             {
                 StatusBookings.Text = "Không có lịch sử đặt vé";

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:81:37
         public void NoLogin()
         {
             StatusBookings.Text = "Vui lòng đăng nhập để xem thông tin vé!";
-            tuSearchTxt.IsEnabled = false;
+            tuSearchTxt.IsEnabled = true;
             denSearchTxt.IsEnabled = false;
             ngaySearchBox.IsEnabled = false;

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:82:38
         {
             StatusBookings.Text = "Vui lòng đăng nhập để xem thông tin vé!";
             tuSearchTxt.IsEnabled = false;
-            denSearchTxt.IsEnabled = false;
+            denSearchTxt.IsEnabled = true;
             ngaySearchBox.IsEnabled = false;
             hangveSearchBox.IsEnabled = false;

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:83:39
             StatusBookings.Text = "Vui lòng đăng nhập để xem thông tin vé!";
             tuSearchTxt.IsEnabled = false;
             denSearchTxt.IsEnabled = false;
-            ngaySearchBox.IsEnabled = false;
+            ngaySearchBox.IsEnabled = true;
             hangveSearchBox.IsEnabled = false;
             btnSearch.IsEnabled = false;

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:84:41
             tuSearchTxt.IsEnabled = false;
             denSearchTxt.IsEnabled = false;
             ngaySearchBox.IsEnabled = false;
-            hangveSearchBox.IsEnabled = false;
+            hangveSearchBox.IsEnabled = true;
             btnSearch.IsEnabled = false;
         }

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:85:35
             denSearchTxt.IsEnabled = false;
             ngaySearchBox.IsEnabled = false;
             hangveSearchBox.IsEnabled = false;
-            btnSearch.IsEnabled = false;
+            btnSearch.IsEnabled = true;
         }
 

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:92:17
         {
             bookingsDetail = new BookingsDetail();
             SymbolTicket ticket = (SymbolTicket)lvTicket.SelectedItem;
-            if (ticket != null)
+            if (ticket == null)
             {
                 bookingsDetail.ReturnBookings += ReturnBookings;

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:94:17
             SymbolTicket ticket = (SymbolTicket)lvTicket.SelectedItem;
             if (ticket != null)
             {
-                bookingsDetail.ReturnBookings += ReturnBookings;
+                bookingsDetail.ReturnBookings -= ReturnBookings;
                 bookingsDetail.Pay_ReturnBookings += Pay_Return;
                 bookingsDetail.ShowDetail(ticket.MaVe, user_id);

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:95:17
             if (ticket != null)
             {
                 bookingsDetail.ReturnBookings += ReturnBookings;
-                bookingsDetail.Pay_ReturnBookings += Pay_Return;
+                bookingsDetail.Pay_ReturnBookings -= Pay_Return;
                 bookingsDetail.ShowDetail(ticket.MaVe, user_id);
                 fTicket.Content = bookingsDetail;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:96:17
             {
                 bookingsDetail.ReturnBookings += ReturnBookings;
                 bookingsDetail.Pay_ReturnBookings += Pay_Return;
-                bookingsDetail.ShowDetail(ticket.MaVe, user_id);
+                ;
                 fTicket.Content = bookingsDetail;
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:103:13
 
         private void Pay_Return(object sender, RoutedEventArgs e)
         {
-            Return?.Invoke(this, new RoutedEventArgs());
+            ;
         }
         private void ReturnBookings(object sender, RoutedEventArgs e)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:120:13
 
         private void btnSearch_Click(object sender, RoutedEventArgs e)
         {
-            DataProvider.sqlConnection.Open();
+            ;
             string sql = "select distinct [cb].MaChuyenBay, [ct].MaHD, [v].MaVe, [v].TenHK, [v].SoGhe, [hv].TenHangVe, " +
                                  "[cb].SanBayDi, [cb].SanBayDen,[cb].NgayKhoiHanh, [cb].ThoiGianXuatPhat " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:127:34
                                 "[SANBAY] [sbdi], [SANBAY] [sbden] " +
                          "where  [hd].MaHD = [ct].MaHD and " +
                                  "[v].MaVe = [ct].MaVe and " +
-                                 "[v].MaChuyenBay = [cb].MaChuyenBay and " +
+                                 "" +
                                  "[hv].MaHangVe = [v].MaHangVe and " +
                                  "[hd].MaTK = @userID";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:129:34
                                  "[v].MaVe = [ct].MaVe and " +
                                  "[v].MaChuyenBay = [cb].MaChuyenBay and " +
                                  "[hv].MaHangVe = [v].MaHangVe and " +
-                                 "[hd].MaTK = @userID";
+                                 "";
             if (tuSearchTxt.SelectedIndex != -1)
             {

[NoCoverage] UnaryMinusExpression to UnaryPlusExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:130:46
                                  "[v].MaChuyenBay = [cb].MaChuyenBay and " +
                                  "[hv].MaHangVe = [v].MaHangVe and " +
                                  "[hd].MaTK = @userID";
-            if (tuSearchTxt.SelectedIndex != -1)
+            if (tuSearchTxt.SelectedIndex != +1)
             {
                 sql += " and [cb].SanBayDi = [sbdi].MaSanBay and [sbdi].Tinh = N'" + tuSearchTxt.SelectedItem + "'";

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:130:17
                                  "[v].MaChuyenBay = [cb].MaChuyenBay and " +
                                  "[hv].MaHangVe = [v].MaHangVe and " +
                                  "[hd].MaTK = @userID";
-            if (tuSearchTxt.SelectedIndex != -1)
+            if (tuSearchTxt.SelectedIndex == -1)
             {
                 sql += " and [cb].SanBayDi = [sbdi].MaSanBay and [sbdi].Tinh = N'" + tuSearchTxt.SelectedItem + "'";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:132:24
                                  "[hd].MaTK = @userID";
             if (tuSearchTxt.SelectedIndex != -1)
             {
-                sql += " and [cb].SanBayDi = [sbdi].MaSanBay and [sbdi].Tinh = N'" + tuSearchTxt.SelectedItem + "'";
+                sql += "" + tuSearchTxt.SelectedItem + "'";
             }
             if (denSearchTxt.Text != "")

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:134:17
             {
                 sql += " and [cb].SanBayDi = [sbdi].MaSanBay and [sbdi].Tinh = N'" + tuSearchTxt.SelectedItem + "'";
             }
-            if (denSearchTxt.Text != "")
+            if (denSearchTxt.Text == "")
             {
                 sql += " and [cb].SanBayDen = [sbden].MaSanBay and [sbden].Tinh = N'" + denSearchTxt.SelectedItem + "'";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:134:38
             {
                 sql += " and [cb].SanBayDi = [sbdi].MaSanBay and [sbdi].Tinh = N'" + tuSearchTxt.SelectedItem + "'";
             }
-            if (denSearchTxt.Text != "")
+            if (denSearchTxt.Text != "Stryker was here!")
             {
                 sql += " and [cb].SanBayDen = [sbden].MaSanBay and [sbden].Tinh = N'" + denSearchTxt.SelectedItem + "'";

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:138:17
             {
                 sql += " and [cb].SanBayDen = [sbden].MaSanBay and [sbden].Tinh = N'" + denSearchTxt.SelectedItem + "'";
             }
-            if (ngaySearchBox.Text != "")
+            if (ngaySearchBox.Text == "")
             {
                 sql += " and [cb].NgayKhoiHanh = '" + ngaySearchBox.Text + "'";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:138:39
             {
                 sql += " and [cb].SanBayDen = [sbden].MaSanBay and [sbden].Tinh = N'" + denSearchTxt.SelectedItem + "'";
             }
-            if (ngaySearchBox.Text != "")
+            if (ngaySearchBox.Text != "Stryker was here!")
             {
                 sql += " and [cb].NgayKhoiHanh = '" + ngaySearchBox.Text + "'";

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:142:17
             {
                 sql += " and [cb].NgayKhoiHanh = '" + ngaySearchBox.Text + "'";
             }
-            if (hangveSearchBox.Text != "")
+            if (hangveSearchBox.Text == "")
             {
                 sql += " and [hv].TenHangVe = N'" + hangveSearchBox.SelectedItem + "'";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:146:20
             {
                 sql += " and [hv].TenHangVe = N'" + hangveSearchBox.SelectedItem + "'";
             }
-            sql += " order by [v].MaVe DESC";
+            sql += "";
             SqlCommand sqlCommand = new SqlCommand(sql, DataProvider.sqlConnection);
             sqlCommand.Parameters.Add("@userID", SqlDbType.NVarChar).Value = user_id;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:157:42
             {
                 while (reader.Read())
                 {
-                    string mave = reader["MaVe"].ToString();
+                    string mave = reader[""].ToString();
                     string tuyen = reader["SanBayDi"].ToString() + " - " + reader["SanBayDen"].ToString();
                     string ngaygio = reader["ThoiGianXuatPhat"].ToString() + " " + reader["NgayKhoiHanh"].ToString();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:158:83
                 while (reader.Read())
                 {
                     string mave = reader["MaVe"].ToString();
-                    string tuyen = reader["SanBayDi"].ToString() + " - " + reader["SanBayDen"].ToString();
+                    string tuyen = reader["SanBayDi"].ToString() + " - " + reader[""].ToString();
                     string ngaygio = reader["ThoiGianXuatPhat"].ToString() + " " + reader["NgayKhoiHanh"].ToString();
                     string soghe = reader["SoGhe"].ToString();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:159:91
                 {
                     string mave = reader["MaVe"].ToString();
                     string tuyen = reader["SanBayDi"].ToString() + " - " + reader["SanBayDen"].ToString();
-                    string ngaygio = reader["ThoiGianXuatPhat"].ToString() + " " + reader["NgayKhoiHanh"].ToString();
+                    string ngaygio = reader["ThoiGianXuatPhat"].ToString() + " " + reader[""].ToString();
                     string soghe = reader["SoGhe"].ToString();
                     string hangve = reader["TenHangVe"].ToString();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:162:43
                     string ngaygio = reader["ThoiGianXuatPhat"].ToString() + " " + reader["NgayKhoiHanh"].ToString();
                     string soghe = reader["SoGhe"].ToString();
                     string hangve = reader["TenHangVe"].ToString();
-                    string tenhk = reader["TenHK"].ToString();
+                    string tenhk = reader[""].ToString();
                     listSearch.Add(new SymbolTicket(mave, tuyen, ngaygio, soghe, hangve, tenhk));
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:163:21
                     string soghe = reader["SoGhe"].ToString();
                     string hangve = reader["TenHangVe"].ToString();
                     string tenhk = reader["TenHK"].ToString();
-                    listSearch.Add(new SymbolTicket(mave, tuyen, ngaygio, soghe, hangve, tenhk));
+                    ;
                 }
             }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:168:17
             }
             DataProvider.sqlConnection.Close();
             lvTicket.ItemsSource = listSearch;
-            if (listSearch.Count == 0)
+            if (listSearch.Count != 0)
             {
                 StatusBookings.Text = "Không có lịch sử đặt vé";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:172:40
             {
                 StatusBookings.Text = "Không có lịch sử đặt vé";
             }
-            else StatusBookings.Text = "Vui lòng nhấn vào vé để xem thông tin vé!";
+            else StatusBookings.Text = "";
 
             fTicket.Content = null;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:181:17
         {
             DataProvider.sqlConnection.Open();
             SqlCommand sqlCommand = new SqlCommand(
-                "select distinct [s].Tinh from [SANBAY] [s], [CHUYENBAY] [c] " +
+                "" +
                 "where [s].MaSanBay = [c].SanBayDi", DataProvider.sqlConnection);
             SqlDataReader reader = sqlCommand.ExecuteReader();

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:185:17
                 "where [s].MaSanBay = [c].SanBayDi", DataProvider.sqlConnection);
             SqlDataReader reader = sqlCommand.ExecuteReader();
             List<string> listTuSearch = new List<string>();
-            if (reader.HasRows)
+            if (!(reader.HasRows))
             {
                 while (reader.Read())

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:189:21
             {
                 while (reader.Read())
                 {
-                    listTuSearch.Add(reader["Tinh"].ToString());
+                    ;
                 }
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:195:13
             DataProvider.sqlConnection.Close();
             tuSearchTxt.ItemsSource = listTuSearch;
 
-            DataProvider.sqlConnection.Open();
+            ;
             SqlCommand sqlCommand1 = new SqlCommand(
                 "select distinct [s].Tinh from [SANBAY] [s], [CHUYENBAY] [c] " +

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:201:17
                 "where [s].MaSanBay = [c].SanBayDen", DataProvider.sqlConnection);
             SqlDataReader reader1 = sqlCommand1.ExecuteReader();
             List<string> listDenSearch = new List<string>();
-            if (reader1.HasRows)
+            if (!(reader1.HasRows))
             {
                 while (reader1.Read())

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:203:24
             List<string> listDenSearch = new List<string>();
             if (reader1.HasRows)
             {
-                while (reader1.Read())
+                while (!(reader1.Read()))
                 {
                     listDenSearch.Add(reader1["Tinh"].ToString());

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:205:21
             {
                 while (reader1.Read())
                 {
-                    listDenSearch.Add(reader1["Tinh"].ToString());
+                    ;
                 }
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:209:13
                 }
             }
             denSearchTxt.ItemsSource = listDenSearch;
-            DataProvider.sqlConnection.Close();
+            ;
 
             DataProvider.sqlConnection.Open();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:213:17
 
             DataProvider.sqlConnection.Open();
             SqlCommand sqlCommand2 = new SqlCommand(
-                "select [h].TenHangVe from [HANGVE] [h]", DataProvider.sqlConnection);
+                "", DataProvider.sqlConnection);
             SqlDataReader reader2 = sqlCommand2.ExecuteReader();
             List<string> listHVSearch = new List<string>();

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:216:17
                 "select [h].TenHangVe from [HANGVE] [h]", DataProvider.sqlConnection);
             SqlDataReader reader2 = sqlCommand2.ExecuteReader();
             List<string> listHVSearch = new List<string>();
-            if (reader2.HasRows)
+            if (!(reader2.HasRows))
             {
                 while (reader2.Read())

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:218:24
             List<string> listHVSearch = new List<string>();
             if (reader2.HasRows)
             {
-                while (reader2.Read())
+                while (!(reader2.Read()))
                 {
                     listHVSearch.Add(reader2["TenHangVe"].ToString());

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:220:21
             {
                 while (reader2.Read())
                 {
-                    listHVSearch.Add(reader2["TenHangVe"].ToString());
+                    ;
                 }
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/MyBookings.xaml.cs:224:13
                 }
             }
             hangveSearchBox.ItemsSource = listHVSearch;
-            DataProvider.sqlConnection.Close();
+            ;
         }
     }
