[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:35:17
 
         private void BtnSignup_click(object sender, RoutedEventArgs e)
         {
-            if (Email.Text == "" || Displayname.Text == "" || Username.Text == ""  || PasswordBox1.Password == "" || PasswordBox2.Password == "")
+            if (Email.Text != "" || Displayname.Text == "" || Username.Text == ""  || PasswordBox1.Password == "" || PasswordBox2.Password == "")
             {
                 txblError.Text = "Vui lòng nhập đầy đủ thông tin!";

[NoCoverage] Logical mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:35:17
 
         private void BtnSignup_click(object sender, RoutedEventArgs e)
         {
-            if (Email.Text == "" || Displayname.Text == "" || Username.Text == ""  || PasswordBox1.Password == "" || PasswordBox2.Password == "")
+            if (Email.Text == "" || Displayname.Text == "" || Username.Text == ""  || PasswordBox1.Password == "" && PasswordBox2.Password == "")
             {
                 txblError.Text = "Vui lòng nhập đầy đủ thông tin!";

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:38:17
             if (Email.Text == "" || Displayname.Text == "" || Username.Text == ""  || PasswordBox1.Password == "" || PasswordBox2.Password == "")
             {
                 txblError.Text = "Vui lòng nhập đầy đủ thông tin!";
-                Email.Focus();
+                ;
             }
             else if (PasswordBox1.Password != PasswordBox2.Password)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:40:22
                 txblError.Text = "Vui lòng nhập đầy đủ thông tin!";
                 Email.Focus();
             }
-            else if (PasswordBox1.Password != PasswordBox2.Password)
+            else if (PasswordBox1.Password == PasswordBox2.Password)
             {
                 txblError.Text = "Mật khẩu không trùng nhau!";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:42:34
             }
             else if (PasswordBox1.Password != PasswordBox2.Password)
             {
-                txblError.Text = "Mật khẩu không trùng nhau!";
+                txblError.Text = "";
                 PasswordBox1.Focus();
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:43:17
             else if (PasswordBox1.Password != PasswordBox2.Password)
             {
                 txblError.Text = "Mật khẩu không trùng nhau!";
-                PasswordBox1.Focus();
+                ;
             }
             else if (!Regex.IsMatch(Email.Text, @"^[a-zA-Z][\w\.-]*[a-zA-Z0-9]@[a-zA-Z0-9][\w\.-]*[a-zA-Z0-9]\.[a-zA-Z][a-zA-Z\.]*[a-zA-Z]$"))

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:45:22
                 txblError.Text = "Mật khẩu không trùng nhau!";
                 PasswordBox1.Focus();
             }
-            else if (!Regex.IsMatch(Email.Text, @"^[a-zA-Z][\w\.-]*[a-zA-Z0-9]@[a-zA-Z0-9][\w\.-]*[a-zA-Z0-9]\.[a-zA-Z][a-zA-Z\.]*[a-zA-Z]$"))
+            else if (Regex.IsMatch(Email.Text, @"^[a-zA-Z][\w\.-]*[a-zA-Z0-9]@[a-zA-Z0-9][\w\.-]*[a-zA-Z0-9]\.[a-zA-Z][a-zA-Z\.]*[a-zA-Z]$"))
             {
                 txblError.Text = "Email không hợp lệ!";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:45:49
                 txblError.Text = "Mật khẩu không trùng nhau!";
                 PasswordBox1.Focus();
             }
-            else if (!Regex.IsMatch(Email.Text, @"^[a-zA-Z][\w\.-]*[a-zA-Z0-9]@[a-zA-Z0-9][\w\.-]*[a-zA-Z0-9]\.[a-zA-Z][a-zA-Z\.]*[a-zA-Z]$"))
+            else if (!Regex.IsMatch(Email.Text, ""))
             {
                 txblError.Text = "Email không hợp lệ!";

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:48:17
             else if (!Regex.IsMatch(Email.Text, @"^[a-zA-Z][\w\.-]*[a-zA-Z0-9]@[a-zA-Z0-9][\w\.-]*[a-zA-Z0-9]\.[a-zA-Z][a-zA-Z\.]*[a-zA-Z]$"))
             {
                 txblError.Text = "Email không hợp lệ!";
-                Email.Focus();
+                ;
             }
             else

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:55:25
                 SqlConnection sqlCon = DataProvider.sqlConnection;
                 try
                 {
-                    if (sqlCon.State == ConnectionState.Closed)
+                    if (sqlCon.State != ConnectionState.Closed)
                     {
                         sqlCon.Open();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:57:25
                 {
                     if (sqlCon.State == ConnectionState.Closed)
                     {
-                        sqlCon.Open();
+                        ;
                         String query = "SELECT COUNT(1) FROM [TAIKHOAN] WHERE TenDangNhap=@Username";
                         SqlCommand sqlCmd = new SqlCommand(query, sqlCon);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:61:25
                         String query = "SELECT COUNT(1) FROM [TAIKHOAN] WHERE TenDangNhap=@Username";
                         SqlCommand sqlCmd = new SqlCommand(query, sqlCon);
                         sqlCmd.CommandType = CommandType.Text;
-                        sqlCmd.Parameters.AddWithValue("@Username", Username.Text);
+                        ;
                         int count = Convert.ToInt32(sqlCmd.ExecuteScalar());
                         if (count > 0)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:63:29
                         sqlCmd.CommandType = CommandType.Text;
                         sqlCmd.Parameters.AddWithValue("@Username", Username.Text);
                         int count = Convert.ToInt32(sqlCmd.ExecuteScalar());
-                        if (count > 0)
+                        if (count < 0)
                         {
                             txblError.Text = "Tên đăng nhập này đã có người sử dụng!";

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:63:29
                         sqlCmd.CommandType = CommandType.Text;
                         sqlCmd.Parameters.AddWithValue("@Username", Username.Text);
                         int count = Convert.ToInt32(sqlCmd.ExecuteScalar());
-                        if (count > 0)
+                        if (!(count > 0))
                         {
                             txblError.Text = "Tên đăng nhập này đã có người sử dụng!";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:65:46
                         int count = Convert.ToInt32(sqlCmd.ExecuteScalar());
                         if (count > 0)
                         {
-                            txblError.Text = "Tên đăng nhập này đã có người sử dụng!";
+                            txblError.Text = "";
                             return;
                         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:66:29
                         if (count > 0)
                         {
                             txblError.Text = "Tên đăng nhập này đã có người sử dụng!";
-                            return;
+                            ;
                         }
                     }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:71:27
                     }
                 }
                 catch { }
-                finally { sqlCon.Close(); }
+                finally { ; }
                 Random rd = new Random();
                 int ID = rd.Next(100000, 999999);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:75:17
                 Random rd = new Random();
                 int ID = rd.Next(100000, 999999);
                 SqlConnection con = DataProvider.sqlConnection;
-                con.Open();
+                ;
                 cmd.CommandType = CommandType.Text;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:78:17
                 con.Open();
                 cmd.CommandType = CommandType.Text;
-                cmd.ExecuteNonQuery();
+                ;
                 con.Close();
                 MessageBox.Show("Đăng ký tài khoản thành công!", "Success");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:79:17
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();
-                con.Close();
+                ;
                 MessageBox.Show("Đăng ký tài khoản thành công!", "Success");
                 redirectLogin?.Invoke(this, new RoutedEventArgs());

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:80:17
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();
                 con.Close();
-                MessageBox.Show("Đăng ký tài khoản thành công!", "Success");
+                ;
                 redirectLogin?.Invoke(this, new RoutedEventArgs());
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:80:33
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();
                 con.Close();
-                MessageBox.Show("Đăng ký tài khoản thành công!", "Success");
+                MessageBox.Show("", "Success");
                 redirectLogin?.Invoke(this, new RoutedEventArgs());
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:81:17
                 cmd.ExecuteNonQuery();
                 con.Close();
                 MessageBox.Show("Đăng ký tài khoản thành công!", "Success");
-                redirectLogin?.Invoke(this, new RoutedEventArgs());
+                ;
             }
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Register.xaml.cs:87:13
 
         private void BtnBack_Click(object sender, RoutedEventArgs e)
         {
-            redirectLogin?.Invoke(this, new RoutedEventArgs());
+            ;
         }
     }
