[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Setting.xaml.cs:32:17
         public Setting()
         {
             InitializeComponent();
-            if (MainWindow.curAccount != null)
+            if (MainWindow.curAccount == null)
             {
                 string query = "SELECT * FROM [TAIKHOAN] Where MaTK = @uid";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Setting.xaml.cs:34:32
             InitializeComponent();
             if (MainWindow.curAccount != null)
             {
-                string query = "SELECT * FROM [TAIKHOAN] Where MaTK = @uid";
+                string query = "";
                 SqlParameter param1 = new SqlParameter("@uid", MainWindow.curAccount.id);
                 DataTable dt;

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Setting.xaml.cs:40:25
                 using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text, param1))
                 {
                     dt = new DataTable();
-                    if (reader.HasRows)
+                    if (!(reader.HasRows))
                     {
                         dt.Load(reader);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Setting.xaml.cs:42:25
                     dt = new DataTable();
                     if (reader.HasRows)
                     {
-                        dt.Load(reader);
+                        ;
                         foreach (DataRow dr in dt.Rows)
                         {

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Setting.xaml.cs:64:32
         private void editDname_Click(object sender, RoutedEventArgs e)
         {
             panelDName.Visibility = Visibility.Visible;
-            DName.IsReadOnly = false;
+            DName.IsReadOnly = true;
             DName.Focus();
             oldDName = DName.Text;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Setting.xaml.cs:65:13
         {
             panelDName.Visibility = Visibility.Visible;
             DName.IsReadOnly = false;
-            DName.Focus();
+            ;
             oldDName = DName.Text;
         }

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Setting.xaml.cs:72:32
         private void editEmail_Click(object sender, RoutedEventArgs e)
         {
             panelEmail.Visibility = Visibility.Visible;
-            Email.IsReadOnly = false;
+            Email.IsReadOnly = true;
             Email.Focus();
             oldEmail = Email.Text;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Setting.xaml.cs:73:13
         {
             panelEmail.Visibility = Visibility.Visible;
             Email.IsReadOnly = false;
-            Email.Focus();
+            ;
             oldEmail = Email.Text;
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Setting.xaml.cs:81:13
         {
             ChangePassword changePasswordwd = new ChangePassword();
             changePasswordwd.PasswordBox.Visibility = Visibility.Visible;
-            changePasswordwd.ShowDialog();
+            ;
         }
 

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Setting.xaml.cs:90:149
             {
                 SqlConnection con = DataProvider.sqlConnection;
                 con.Open();
-                SqlCommand cmd = new SqlCommand("Update [TaiKhoan] set TenHienThi=N'" + DName.Text + "' where MaTK=N'" + MainWindow.curAccount.id + "'", con);
+                SqlCommand cmd = new SqlCommand("Update [TaiKhoan] set TenHienThi=N'" + DName.Text + "' where MaTK=N'" + MainWindow.curAccount.id + "", con);
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Setting.xaml.cs:90:102
             {
                 SqlConnection con = DataProvider.sqlConnection;
                 con.Open();
-                SqlCommand cmd = new SqlCommand("Update [TaiKhoan] set TenHienThi=N'" + DName.Text + "' where MaTK=N'" + MainWindow.curAccount.id + "'", con);
+                SqlCommand cmd = new SqlCommand("Update [TaiKhoan] set TenHienThi=N'" + DName.Text + "" + MainWindow.curAccount.id + "'", con);
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Setting.xaml.cs:95:36
                 cmd.ExecuteNonQuery();
                 con.Close();
                 panelDName.Visibility = Visibility.Collapsed;
-                DName.IsReadOnly = true;
+                DName.IsReadOnly = false;
                 MainWindow.curAccount.displayname = DName.Text;
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Setting.xaml.cs:98:36
                 DName.IsReadOnly = true;
                 MainWindow.curAccount.displayname = DName.Text;
             }
-            catch (Exception ex) { Console.WriteLine(ex); }
+            catch (Exception ex) { ; }
         }
 

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Setting.xaml.cs:103:17
 
         private void OkEmailBtn_Click(object sender, RoutedEventArgs e)
         {
-            if (!Regex.IsMatch(Email.Text, @"^[a-zA-Z][\w\.-]*[a-zA-Z0-9]@[a-zA-Z0-9][\w\.-]*[a-zA-Z0-9]\.[a-zA-Z][a-zA-Z\.]*[a-zA-Z]$"))
+            if (Regex.IsMatch(Email.Text, @"^[a-zA-Z][\w\.-]*[a-zA-Z0-9]@[a-zA-Z0-9][\w\.-]*[a-zA-Z0-9]\.[a-zA-Z][a-zA-Z\.]*[a-zA-Z]$"))
             {
                 txblError.Text = "Email không hợp lệ!";

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Setting.xaml.cs:107:17
             {
                 txblError.Text = "Email không hợp lệ!";
                 Email.Focus();
-                return;
+                ;
             }
             try

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Setting.xaml.cs:113:97
             {
                 SqlConnection con = DataProvider.sqlConnection;
                 con.Open();
-                SqlCommand cmd = new SqlCommand("Update [TaiKhoan] set Email=N'" + Email.Text + "' where MaTK=N'" + MainWindow.curAccount.id + "'", con);
+                SqlCommand cmd = new SqlCommand("Update [TaiKhoan] set Email=N'" + Email.Text + "" + MainWindow.curAccount.id + "'", con);
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Setting.xaml.cs:118:36
                 cmd.ExecuteNonQuery();
                 con.Close();
                 panelEmail.Visibility = Visibility.Collapsed;
-                Email.IsReadOnly = true;
+                Email.IsReadOnly = false;
             }
             catch (Exception ex) { Console.WriteLine(ex); }
