[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/UserManagement.xaml.cs:58:13
         public UserManagement()
         {
             InitializeComponent();
-            loadData();
+            ;
         }
         void loadData()

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/UserManagement.xaml.cs:62:13
         }
         void loadData()
         {
-            UserTable.Items.Clear();
+            ;
             string query = "SELECT * FROM TAIKHOAN";
             DataTable dt;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/UserManagement.xaml.cs:80:25
                         account.type = dr.Field<int>(3);
                         account.email = dr[4].ToString();
                         account.displayname = dr[5].ToString();
-                        UserTable.Items.Add(account);
+                        ;
                     }
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/UserManagement.xaml.cs:89:13
         private void add_Click(object sender, RoutedEventArgs e)
         {
             UserForm userForm = new UserForm(0);
-            userForm.ShowDialog();
+            ;
             if(userForm.isSaved)
                 loadData();

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/UserManagement.xaml.cs:90:16
         {
             UserForm userForm = new UserForm(0);
             userForm.ShowDialog();
-            if(userForm.isSaved)
+            if(!(userForm.isSaved))
                 loadData();
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/UserManagement.xaml.cs:91:17
             UserForm userForm = new UserForm(0);
             userForm.ShowDialog();
             if(userForm.isSaved)
-                loadData();
+                ;
         }
 

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/UserManagement.xaml.cs:97:17
         private void delete_Click(object sender, RoutedEventArgs e)
         {
             Account selectedAccount = UserTable.SelectedItem as Account;
-            if (selectedAccount != null)
+            if (selectedAccount == null)
             {
                 if (MessageBox.Show("Bạn có chắc muốn xóa tài khoản này không?", "Xác nhận xóa tài khoản", MessageBoxButton.YesNo, MessageBoxImage.Question) == MessageBoxResult.Yes)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/UserManagement.xaml.cs:99:21
             Account selectedAccount = UserTable.SelectedItem as Account;
             if (selectedAccount != null)
             {
-                if (MessageBox.Show("Bạn có chắc muốn xóa tài khoản này không?", "Xác nhận xóa tài khoản", MessageBoxButton.YesNo, MessageBoxImage.Question) == MessageBoxResult.Yes)
+                if (MessageBox.Show("Bạn có chắc muốn xóa tài khoản này không?", "Xác nhận xóa tài khoản", MessageBoxButton.YesNo, MessageBoxImage.Question) != MessageBoxResult.Yes)
                 {
                     try

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/UserManagement.xaml.cs:99:82
             Account selectedAccount = UserTable.SelectedItem as Account;
             if (selectedAccount != null)
             {
-                if (MessageBox.Show("Bạn có chắc muốn xóa tài khoản này không?", "Xác nhận xóa tài khoản", MessageBoxButton.YesNo, MessageBoxImage.Question) == MessageBoxResult.Yes)
+                if (MessageBox.Show("Bạn có chắc muốn xóa tài khoản này không?", "", MessageBoxButton.YesNo, MessageBoxImage.Question) == MessageBoxResult.Yes)
                 {
                     try

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/UserManagement.xaml.cs:104:25
                     try
                     {
                         SqlConnection sqlCon = DataProvider.sqlConnection;
-                        sqlCon.Open();
+                        ;
                         SqlCommand cmd = new SqlCommand("Delete from [TAIKHOAN]  where MaTK='" + selectedAccount.id + "'", sqlCon);
                         cmd.CommandType = CommandType.Text;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/UserManagement.xaml.cs:108:25
                         SqlCommand cmd = new SqlCommand("Delete from [TAIKHOAN]  where MaTK='" + selectedAccount.id + "'", sqlCon);
                         cmd.CommandType = CommandType.Text;
                         cmd.ExecuteNonQuery();
-                        sqlCon.Close();
+                        ;
                         UserTable.Items.Remove(selectedAccount);
                     }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/UserManagement.xaml.cs:109:25
                         cmd.CommandType = CommandType.Text;
                         cmd.ExecuteNonQuery();
                         sqlCon.Close();
-                        UserTable.Items.Remove(selectedAccount);
+                        ;
                     }
                     catch (Exception ex) { Console.WriteLine(ex); }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/UserManagement.xaml.cs:116:17
             }
             else
             {
-                MessageBox.Show("Vui lòng chọn dòng bạn muốn xóa!", "Error");
+                ;
             }
         }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/UserManagement.xaml.cs:116:69
             }
             else
             {
-                MessageBox.Show("Vui lòng chọn dòng bạn muốn xóa!", "Error");
+                MessageBox.Show("Vui lòng chọn dòng bạn muốn xóa!", "");
             }
         }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/UserManagement.xaml.cs:123:16
         private void update_Click(object sender, RoutedEventArgs e)
         {
             Account selectedAccount = UserTable.SelectedItem as Account;
-            if(selectedAccount != null) {
+            if(selectedAccount == null) {
                 UserForm userForm = new UserForm(1, selectedAccount);
                 userForm.ShowDialog();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/UserManagement.xaml.cs:125:17
             Account selectedAccount = UserTable.SelectedItem as Account;
             if(selectedAccount != null) {
                 UserForm userForm = new UserForm(1, selectedAccount);
-                userForm.ShowDialog();
+                ;
                 if (userForm.isSaved)
                     loadData();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/UserManagement.xaml.cs:130:17
                     loadData();
             }
             else {
-                MessageBox.Show("Vui lòng chọn dòng bạn muốn sửa!", "Error");
+                ;
             }
         }
