[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:52:13
         public FlightsList()
         {
             InitializeComponent();
-            addDataToLsvAirport();
+            ;
 
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:61:13
             "select * from [HANGMAYBAY]", DataProvider.sqlConnection);
             SqlDataAdapter adapter = new SqlDataAdapter(sqlCommand);
             DataSet ds = new DataSet();
-            adapter.Fill(ds);
+            ;
             List<string> listAirline = new List<string>();
             foreach (DataRow dr in ds.Tables[0].Rows)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:65:17
             List<string> listAirline = new List<string>();
             foreach (DataRow dr in ds.Tables[0].Rows)
             {
-                listAirline.Add(dr["TenHang"].ToString());
+                ;
             }
             lvAirline.ItemsSource = listAirline;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:65:36
             List<string> listAirline = new List<string>();
             foreach (DataRow dr in ds.Tables[0].Rows)
             {
-                listAirline.Add(dr["TenHang"].ToString());
+                listAirline.Add(dr[""].ToString());
             }
             lvAirline.ItemsSource = listAirline;

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:73:21
         //filter by airport name
         private bool airlineNameFilter(object item)
         {
-            return ((item as Flight).AirlineName.CompareTo(selectedAirlineName) == 0);
+            return ((item as Flight).AirlineName.CompareTo(selectedAirlineName) != 0);
         }
         //set up flightList Screen

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:78:43
         //set up flightList Screen
         public void FlightSearched(string departure, string destination, string date, int quantity, string flightClass)
         {
-            infoSearch.Text = departure + " -> " + destination + " | " + date + " | " + flightClass + " | " + quantity + " người";
+            infoSearch.Text = departure + "" + destination + " | " + date + " | " + flightClass + " | " + quantity + " người";
            
             DataProvider.sqlConnection.Open();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:78:103
         //set up flightList Screen
         public void FlightSearched(string departure, string destination, string date, int quantity, string flightClass)
         {
-            infoSearch.Text = departure + " -> " + destination + " | " + date + " | " + flightClass + " | " + quantity + " người";
+            infoSearch.Text = departure + " -> " + destination + " | " + date + " | " + flightClass + "" + quantity + " người";
            
             DataProvider.sqlConnection.Open();

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:82:17
            
             DataProvider.sqlConnection.Open();
             SqlCommand sqlCommand = new SqlCommand();
-            if (flightClass != "")
+            if (flightClass == "")
             {
                 sqlCommand = new SqlCommand(

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:88:18
                  "where NgayKhoiHanh=@date " +
                  "and [c].SanBayDi=[s1].MaSanBay " +
-                 "and [c].SanBayDen=[s2].MaSanBay " +
+                 "" +
                  "and [c].MaHangMayBay=[hmb].MaHang " +
                  "and [s1].Tinh=@departure " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:90:18
                  "and [c].SanBayDi=[s1].MaSanBay " +
                  "and [c].SanBayDen=[s2].MaSanBay " +
                  "and [c].MaHangMayBay=[hmb].MaHang " +
-                 "and [s1].Tinh=@departure " +
+                 "" +
                  "and [s2].Tinh=@destination " +
                  "and MaChuyenBay in (select MaChuyenBay from [VE] [v], [HANGVE] [hv] " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:108:18
                  "and [c].SanBayDen=[s2].MaSanBay " +
                  "and [c].MaHangMayBay=[hmb].MaHang " +
                  "and [s1].Tinh=@departure " +
-                 "and [s2].Tinh=@destination " +
+                 "" +
                  "and MaChuyenBay in (select MaChuyenBay from [VE] [v] " +
                                        " where TinhTrang = N'TRONG' " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:111:40
                  "and [s2].Tinh=@destination " +
                  "and MaChuyenBay in (select MaChuyenBay from [VE] [v] " +
                                        " where TinhTrang = N'TRONG' " +
-                                       "group by MaChuyenBay " +
+                                       "" +
                                        "having count(MaVe)>=@quantity)",
                 DataProvider.sqlConnection);

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:112:40
                  "and MaChuyenBay in (select MaChuyenBay from [VE] [v] " +
                                        " where TinhTrang = N'TRONG' " +
                                        "group by MaChuyenBay " +
-                                       "having count(MaVe)>=@quantity)",
+                                       "",
                 DataProvider.sqlConnection);
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:115:39
                                        "having count(MaVe)>=@quantity)",
                 DataProvider.sqlConnection);
             }
-            sqlCommand.Parameters.Add("@date", SqlDbType.NVarChar).Value = date;
+            sqlCommand.Parameters.Add("", SqlDbType.NVarChar).Value = date;
             sqlCommand.Parameters.Add("@departure", SqlDbType.NVarChar).Value = departure;
             sqlCommand.Parameters.Add("@destination", SqlDbType.NVarChar).Value = destination;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:118:39
             sqlCommand.Parameters.Add("@date", SqlDbType.NVarChar).Value = date;
             sqlCommand.Parameters.Add("@departure", SqlDbType.NVarChar).Value = departure;
             sqlCommand.Parameters.Add("@destination", SqlDbType.NVarChar).Value = destination;
-            sqlCommand.Parameters.Add("@flightClass", SqlDbType.NVarChar).Value = flightClass;
+            sqlCommand.Parameters.Add("", SqlDbType.NVarChar).Value = flightClass;
             sqlCommand.Parameters.Add("@quantity", SqlDbType.Int).Value = quantity; 
             SqlDataReader reader = sqlCommand.ExecuteReader();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:119:39
             sqlCommand.Parameters.Add("@departure", SqlDbType.NVarChar).Value = departure;
             sqlCommand.Parameters.Add("@destination", SqlDbType.NVarChar).Value = destination;
             sqlCommand.Parameters.Add("@flightClass", SqlDbType.NVarChar).Value = flightClass;
-            sqlCommand.Parameters.Add("@quantity", SqlDbType.Int).Value = quantity; 
+            sqlCommand.Parameters.Add("", SqlDbType.Int).Value = quantity; 
             SqlDataReader reader = sqlCommand.ExecuteReader();
             List<Flight> flight_list = new List<Flight>();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:126:46
             {
                 while (reader.Read())
                 {
-                    string flightID = reader["MaChuyenBay"].ToString();
+                    string flightID = reader[""].ToString();
                     string airlineLogo = reader["Logo"].ToString();
                     string airlineName = reader["TenHang"].ToString();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:130:60
                     string airlineLogo = reader["Logo"].ToString();
                     string airlineName = reader["TenHang"].ToString();
                     string airportDepartureName = reader["SanBayDi"].ToString();
-                    string airportDestinationName = reader["SanBayDen"].ToString();
+                    string airportDestinationName = reader[""].ToString();
                     string ngayGioXuatPhat = reader["NgayKhoiHanh"].ToString() + " " + reader["ThoiGianXuatPhat"].ToString();
                     CultureInfo provider = CultureInfo.InvariantCulture;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:134:78
                     string ngayGioXuatPhat = reader["NgayKhoiHanh"].ToString() + " " + reader["ThoiGianXuatPhat"].ToString();
                     CultureInfo provider = CultureInfo.InvariantCulture;
                     string format = "dd/MM/yyyy HH:mm";
-                    TimeSpan time = TimeSpan.FromMinutes(double.Parse(reader["ThoiGianDuKien"].ToString()));
+                    TimeSpan time = TimeSpan.FromMinutes(double.Parse(reader[""].ToString()));
 
                     DateTime dateTimeDeparture = DateTime.ParseExact(ngayGioXuatPhat, format, provider);

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:139:71
                     DateTime dateTimeDeparture = DateTime.ParseExact(ngayGioXuatPhat, format, provider);
                     DateTime dateTimeDestination = dateTimeDeparture.Add(time);
 
-                    string timeDeparture = dateTimeDeparture.ToString("HH:mm");
+                    string timeDeparture = dateTimeDeparture.ToString("");
                     string timeDestination = dateTimeDestination.ToString("HH:mm");
 

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:143:52
                     string timeDestination = dateTimeDestination.ToString("HH:mm");
 
                     int stop = int.Parse(reader["SoSBTG"].ToString());
-                    long price = long.Parse(reader["Gia"].ToString());
+                    long price = long.Parse(reader[""].ToString());
                     

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:151:17
             DataProvider.sqlConnection.Close();
 
             lvFlight.ItemsSource = flight_list;
-            if (flight_list.Count == 0)
+            if (flight_list.Count != 0)
             {
                 isHavingData.Text = "Không tìm thấy chuyến bay thích hợp";

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:165:17
         private void FlightList_SelectionChanged(object sender, SelectionChangedEventArgs e)
         {
             var selectedFlight = (Flight)lvFlight.SelectedItem;
-            if (selectedFlight != null)
+            if (selectedFlight == null)
             {
                 //dữ liệu cần truyền sang cho flightListDetail

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:185:13
 
         private void btnSearch_Click(object sender, RoutedEventArgs e)
         {
-            Search?.Invoke(this, new RoutedEventArgs());
+            ;
         }
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:191:13
         private void sortPriceAsc_Click(object sender, RoutedEventArgs e)
         {
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
-            view.SortDescriptions.Clear();
+            ;
             view.SortDescriptions.Add(new SortDescription("Price", ListSortDirection.Ascending));
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:192:13
         {
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.SortDescriptions.Clear();
-            view.SortDescriptions.Add(new SortDescription("Price", ListSortDirection.Ascending));
+            ;
         }
         private void sortPriceDes_Click(object sender, RoutedEventArgs e)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:198:13
         {
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.SortDescriptions.Clear();
-            view.SortDescriptions.Add(new SortDescription("Price", ListSortDirection.Descending));
+            ;
         }
         private void sortTimeAsc_Click(object sender, RoutedEventArgs e)

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:198:59
         {
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.SortDescriptions.Clear();
-            view.SortDescriptions.Add(new SortDescription("Price", ListSortDirection.Descending));
+            view.SortDescriptions.Add(new SortDescription("", ListSortDirection.Descending));
         }
         private void sortTimeAsc_Click(object sender, RoutedEventArgs e)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:204:13
         {
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.SortDescriptions.Clear();
-            view.SortDescriptions.Add(new SortDescription("Time", ListSortDirection.Ascending));
+            ;
         }
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:211:13
         {
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.SortDescriptions.Clear();
-            view.SortDescriptions.Add(new SortDescription("TimeDestination", ListSortDirection.Ascending));
+            ;
         }
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:218:13
         {
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.SortDescriptions.Clear();
-            view.SortDescriptions.Add(new SortDescription("TimeDestination", ListSortDirection.Descending));
+            ;
         }
         private void sortTimeDepartureAsc_Click(object sender, RoutedEventArgs e)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:224:13
         {
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.SortDescriptions.Clear();
-            view.SortDescriptions.Add(new SortDescription("TimeDeparture", ListSortDirection.Ascending));
+            ;
         }
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:231:13
         {
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.SortDescriptions.Clear();
-            view.SortDescriptions.Add(new SortDescription("TimeDeparture", ListSortDirection.Descending));
+            ;
         }
 

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:237:21
         ///function filter
         private bool noStopFilter(object item)
         {
-            return ((item as Flight).Stop == 0);
+            return ((item as Flight).Stop != 0);
         }
         private bool oneStopFilter(object item)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:241:21
         }
         private bool oneStopFilter(object item)
         {
-            return ((item as Flight).Stop == 1);
+            return ((item as Flight).Stop != 1);
         }
         private bool moreTwoStopFilter(object item)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:245:21
         }
         private bool moreTwoStopFilter(object item)
         {
-            return ((item as Flight).Stop >= 2);
+            return ((item as Flight).Stop < 2);
         }
         private bool nightToMorning_Destination_Filter(object item)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:245:21
         }
         private bool moreTwoStopFilter(object item)
         {
-            return ((item as Flight).Stop >= 2);
+            return ((item as Flight).Stop > 2);
         }
         private bool nightToMorning_Destination_Filter(object item)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:249:17
         }
         private bool nightToMorning_Destination_Filter(object item)
         {
-            if (((item as Flight).TimeDestination.CompareTo("00:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("05:59")) <= 0)
+            if (((item as Flight).TimeDestination.CompareTo("00:00")) < 0 && ((item as Flight).TimeDestination.CompareTo("05:59")) <= 0)
             {
                 return true;

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:249:17
         }
         private bool nightToMorning_Destination_Filter(object item)
         {
-            if (((item as Flight).TimeDestination.CompareTo("00:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("05:59")) <= 0)
+            if (!(((item as Flight).TimeDestination.CompareTo("00:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("05:59")) <= 0))
             {
                 return true;

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:257:17
         }
         private bool morningToNoon_Destination_Filter(object item)
         {
-            if (((item as Flight).TimeDestination.CompareTo("06:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("11:59")) <= 0)
+            if (((item as Flight).TimeDestination.CompareTo("06:00")) < 0 && ((item as Flight).TimeDestination.CompareTo("11:59")) <= 0)
             {
                 return true;

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:257:17
         }
         private bool morningToNoon_Destination_Filter(object item)
         {
-            if (((item as Flight).TimeDestination.CompareTo("06:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("11:59")) <= 0)
+            if (!(((item as Flight).TimeDestination.CompareTo("06:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("11:59")) <= 0))
             {
                 return true;

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:265:17
         }
         private bool noonToEvening_Destination_Filter(object item)
         {
-            if (((item as Flight).TimeDestination.CompareTo("12:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("17:59")) <= 0)
+            if (((item as Flight).TimeDestination.CompareTo("12:00")) > 0 && ((item as Flight).TimeDestination.CompareTo("17:59")) <= 0)
             {
                 return true;

[NoCoverage] Logical mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:265:17
         }
         private bool noonToEvening_Destination_Filter(object item)
         {
-            if (((item as Flight).TimeDestination.CompareTo("12:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("17:59")) <= 0)
+            if (((item as Flight).TimeDestination.CompareTo("12:00")) >= 0 || ((item as Flight).TimeDestination.CompareTo("17:59")) <= 0)
             {
                 return true;

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:273:17
         }
         private bool eveningToNight_Destination_Filter(object item)
         {
-            if (((item as Flight).TimeDestination.CompareTo("18:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("23:59")) <= 0)
+            if (((item as Flight).TimeDestination.CompareTo("18:00")) < 0 && ((item as Flight).TimeDestination.CompareTo("23:59")) <= 0)
             {
                 return true;

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:273:17
         }
         private bool eveningToNight_Destination_Filter(object item)
         {
-            if (((item as Flight).TimeDestination.CompareTo("18:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("23:59")) <= 0)
+            if (!(((item as Flight).TimeDestination.CompareTo("18:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("23:59")) <= 0))
             {
                 return true;

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:282:17
 
         private bool nightToMorning_Departure_Filter(object item)
         {
-            if (((item as Flight).TimeDeparture.CompareTo("00:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("05:59")) <= 0)
+            if (((item as Flight).TimeDeparture.CompareTo("00:00")) < 0 && ((item as Flight).TimeDeparture.CompareTo("05:59")) <= 0)
             {
                 return true;

[NoCoverage] Logical mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:282:17
 
         private bool nightToMorning_Departure_Filter(object item)
         {
-            if (((item as Flight).TimeDeparture.CompareTo("00:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("05:59")) <= 0)
+            if (((item as Flight).TimeDeparture.CompareTo("00:00")) >= 0 || ((item as Flight).TimeDeparture.CompareTo("05:59")) <= 0)
             {
                 return true;

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:290:17
         }
         private bool morningToNoon_Departure_Filter(object item)
         {
-            if (((item as Flight).TimeDeparture.CompareTo("06:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("11:59")) <= 0)
+            if (((item as Flight).TimeDeparture.CompareTo("06:00")) > 0 && ((item as Flight).TimeDeparture.CompareTo("11:59")) <= 0)
             {
                 return true;

[NoCoverage] Logical mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:290:17
         }
         private bool morningToNoon_Departure_Filter(object item)
         {
-            if (((item as Flight).TimeDeparture.CompareTo("06:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("11:59")) <= 0)
+            if (((item as Flight).TimeDeparture.CompareTo("06:00")) >= 0 || ((item as Flight).TimeDeparture.CompareTo("11:59")) <= 0)
             {
                 return true;

[NoCoverage] Logical mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:298:17
         }
         private bool noonToEvening_Departure_Filter(object item)
         {
-            if (((item as Flight).TimeDeparture.CompareTo("12:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("17:59")) <= 0)
+            if (((item as Flight).TimeDeparture.CompareTo("12:00")) >= 0 || ((item as Flight).TimeDeparture.CompareTo("17:59")) <= 0)
             {
                 return true;

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:298:17
         }
         private bool noonToEvening_Departure_Filter(object item)
         {
-            if (((item as Flight).TimeDeparture.CompareTo("12:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("17:59")) <= 0)
+            if (((item as Flight).TimeDeparture.CompareTo("12:00")) < 0 && ((item as Flight).TimeDeparture.CompareTo("17:59")) <= 0)
             {
                 return true;

[NoCoverage] Logical mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:306:17
         }
         private bool eveningToNight_Departure_Filter(object item)
         {
-            if (((item as Flight).TimeDeparture.CompareTo("18:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("23:59")) <= 0)
+            if (((item as Flight).TimeDeparture.CompareTo("18:00")) >= 0 || ((item as Flight).TimeDeparture.CompareTo("23:59")) <= 0)
             {
                 return true;

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:306:77
         }
         private bool eveningToNight_Departure_Filter(object item)
         {
-            if (((item as Flight).TimeDeparture.CompareTo("18:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("23:59")) <= 0)
+            if (((item as Flight).TimeDeparture.CompareTo("18:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("23:59")) > 0)
             {
                 return true;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:317:13
         //filter stop
         private void noStopFilter_Click(object sender, RoutedEventArgs e)
         {
-            CollectionViewSource.GetDefaultView(lvFlight.ItemsSource).Refresh();
+            ;
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.Filter = noStopFilter;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:320:13
             CollectionViewSource.GetDefaultView(lvFlight.ItemsSource).Refresh();
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.Filter = noStopFilter;
-            setIsHavingData(view);
+            ;
         }
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:328:13
             CollectionViewSource.GetDefaultView(lvFlight.ItemsSource).Refresh();
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.Filter = null;
-            setIsHavingData(view);
+            ;
         }
         private void oneStopFilter_Click(object sender, RoutedEventArgs e)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:335:13
             CollectionViewSource.GetDefaultView(lvFlight.ItemsSource).Refresh();
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.Filter = oneStopFilter;
-            setIsHavingData(view);
+            ;
         }
         private void moreTwoStopFilter_Click(object sender, RoutedEventArgs e)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:342:13
             CollectionViewSource.GetDefaultView(lvFlight.ItemsSource).Refresh();
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.Filter = moreTwoStopFilter;
-            setIsHavingData(view);
+            ;
         }
         //filter destination

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:350:13
             CollectionViewSource.GetDefaultView(lvFlight.ItemsSource).Refresh();
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.Filter = nightToMorning_Destination_Filter;
-            setIsHavingData(view);
+            ;
         }
         private void morningToNoon_Destination_Click(object sender, RoutedEventArgs e)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:357:13
             CollectionViewSource.GetDefaultView(lvFlight.ItemsSource).Refresh();
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.Filter = morningToNoon_Destination_Filter;
-            setIsHavingData(view);
+            ;
         }
         private void noonToEvening_Destination_Click(object sender, RoutedEventArgs e)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:364:13
             CollectionViewSource.GetDefaultView(lvFlight.ItemsSource).Refresh();
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.Filter = noonToEvening_Destination_Filter;
-            setIsHavingData(view);
+            ;
         }
         private void eveningToNight_Destination_Click(object sender, RoutedEventArgs e)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:371:13
             CollectionViewSource.GetDefaultView(lvFlight.ItemsSource).Refresh();
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.Filter = eveningToNight_Destination_Filter;
-            setIsHavingData(view);
+            ;
         }
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:380:13
             CollectionViewSource.GetDefaultView(lvFlight.ItemsSource).Refresh();
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.Filter = nightToMorning_Departure_Filter;
-            setIsHavingData(view);
+            ;
         }
         private void morningToNoon_Departure_Click(object sender, RoutedEventArgs e)
