[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:387:13
             CollectionViewSource.GetDefaultView(lvFlight.ItemsSource).Refresh();
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.Filter = morningToNoon_Departure_Filter;
-            setIsHavingData(view);
+            ;
         }
         private void noonToEvening_Departure_Click(object sender, RoutedEventArgs e)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:394:13
             CollectionViewSource.GetDefaultView(lvFlight.ItemsSource).Refresh();
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.Filter = noonToEvening_Departure_Filter;
-            setIsHavingData(view);
+            ;
         }
         private void eveningToNight_Departure_Click(object sender, RoutedEventArgs e)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:401:13
             CollectionViewSource.GetDefaultView(lvFlight.ItemsSource).Refresh();
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.Filter = eveningToNight_Departure_Filter;
-            setIsHavingData(view);
+            ;
         }
 

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:408:17
         private void lvAirline_SelectionChanged(object sender, SelectionChangedEventArgs e)
         {
             selectedAirlineName = lvAirline.SelectedItem as string;
-            if (selectedAirlineName != null)
+            if (selectedAirlineName == null)
             {
                 CollectionViewSource.GetDefaultView(lvFlight.ItemsSource).Refresh();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:413:17
                 CollectionViewSource.GetDefaultView(lvFlight.ItemsSource).Refresh();
                 CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
                 view.Filter = airlineNameFilter;
-                setIsHavingData(view);
+                ;
             }
             lvAirline.SelectedIndex = -1;

[NoCoverage] UnaryMinusExpression to UnaryPlusExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:415:39
                 view.Filter = airlineNameFilter;
                 setIsHavingData(view);
             }
-            lvAirline.SelectedIndex = -1;
+            lvAirline.SelectedIndex = +1;
         }
         private void setIsHavingData(CollectionView view)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:419:17
         }
         private void setIsHavingData(CollectionView view)
         {
-            if (view.Count <= 0)
+            if (view.Count > 0)
             {
                 isHavingData.Text = "Không tìm thấy chuyến bay thích hợp";

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:419:17
         }
         private void setIsHavingData(CollectionView view)
         {
-            if (view.Count <= 0)
+            if (!(view.Count <= 0))
             {
                 isHavingData.Text = "Không tìm thấy chuyến bay thích hợp";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:421:37
         {
             if (view.Count <= 0)
             {
-                isHavingData.Text = "Không tìm thấy chuyến bay thích hợp";
+                isHavingData.Text = "";
             }
             else
