[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:31:13
         {
             InitializeComponent();
             flight_classes = new List<FlightClass>();
-            flight_classes.Add(new FlightClass("Đã đặt", "#FF95988E"));
+            ;
             List<string> strings = new List<string>();
             addDataToClassColor();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:31:48
         {
             InitializeComponent();
             flight_classes = new List<FlightClass>();
-            flight_classes.Add(new FlightClass("Đã đặt", "#FF95988E"));
+            flight_classes.Add(new FlightClass("", "#FF95988E"));
             List<string> strings = new List<string>();
             addDataToClassColor();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:33:13
             flight_classes = new List<FlightClass>();
             flight_classes.Add(new FlightClass("Đã đặt", "#FF95988E"));
             List<string> strings = new List<string>();
-            addDataToClassColor();
+            ;
 
             sp_timeDeparture.DataContext = new DateTime();

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:54:28
             adapter.Fill(ds);
             
             ClassesColor.ItemsSource = flight_classes;
-            for(int i = 0; i < ds.Tables[0].Rows.Count; i++)
+            for(int i = 0; i <= ds.Tables[0].Rows.Count; i++)
             {
                 DataRow dr = ds.Tables[0].Rows[i];

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:54:28
             adapter.Fill(ds);
             
             ClassesColor.ItemsSource = flight_classes;
-            for(int i = 0; i < ds.Tables[0].Rows.Count; i++)
+            for(int i = 0; i > ds.Tables[0].Rows.Count; i++)
             {
                 DataRow dr = ds.Tables[0].Rows[i];

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:57:17
             for(int i = 0; i < ds.Tables[0].Rows.Count; i++)
             {
                 DataRow dr = ds.Tables[0].Rows[i];
-                flight_classes.Add(new FlightClass(dr[0].ToString(), dr[1].ToString(), dr[2].ToString(), DataProvider.colorList[i]));
+                ;
             }
             ClassesColor.ItemsSource = flight_classes;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:82:14
 
             DataProvider.sqlConnection.Open();
             SqlCommand sqlCommand = new SqlCommand(
-             "select [c].*, [s1].Tinh TinhSBDi, [s2].Tinh TinhSBDen, [s1].TenSanBay TenSBDi, [s2].TenSanBay TenSBDen, TenHang from [CHUYENBAY] [c], [SANBAY] [s1], [SANBAY] [s2], [HANGMAYBAY] [hmb] " +
+             "" +
              "where [c].MaChuyenBay=@flightID " +
              "and [c].SanBayDi = [s1].MaSanBay " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:84:14
             SqlCommand sqlCommand = new SqlCommand(
              "select [c].*, [s1].Tinh TinhSBDi, [s2].Tinh TinhSBDen, [s1].TenSanBay TenSBDi, [s2].TenSanBay TenSBDen, TenHang from [CHUYENBAY] [c], [SANBAY] [s1], [SANBAY] [s2], [HANGMAYBAY] [hmb] " +
              "where [c].MaChuyenBay=@flightID " +
-             "and [c].SanBayDi = [s1].MaSanBay " +
+             "" +
              "and [c].SanBayDen = [s2].MaSanBay " +
              "and [c].MaHangMayBay = [hmb].MaHang",

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:91:17
             sqlCommand.Parameters.Add("@flightID", SqlDbType.NVarChar).Value = flightID;
             SqlDataReader reader = sqlCommand.ExecuteReader();
             string[] flight = new string[8];
-            if (reader.HasRows)
+            if (!(reader.HasRows))
             {
                 if (reader.Read())

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:95:49
             {
                 if (reader.Read())
                 {
-                    string airlineName = reader["TenHang"].ToString();
+                    string airlineName = reader[""].ToString();
                     string airportDepartureID = reader["SanBayDi"].ToString();
                     string airportDestinationID = reader["SanBayDen"].ToString();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:99:60
                     string airportDepartureID = reader["SanBayDi"].ToString();
                     string airportDestinationID = reader["SanBayDen"].ToString();
                     string airportDepartureName = reader["TenSBDi"].ToString();
-                    string airportDestinationName = reader["TenSBDen"].ToString();
+                    string airportDestinationName = reader[""].ToString();
                     string airportDepartureCity = reader["TinhSBDi"].ToString();
                     string airportDestinationCity = reader["TinhSBDen"].ToString();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:101:60
                     string airportDepartureName = reader["TenSBDi"].ToString();
                     string airportDestinationName = reader["TenSBDen"].ToString();
                     string airportDepartureCity = reader["TinhSBDi"].ToString();
-                    string airportDestinationCity = reader["TinhSBDen"].ToString();
+                    string airportDestinationCity = reader[""].ToString();
                     string aircraftType = reader["LoaiMayBay"].ToString();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:107:52
                 }
             }
             DataProvider.sqlConnection.Close();
-            tb_airportDeparture.Text = flight[5] + "(" + flight[3] + ")";
+            tb_airportDeparture.Text = flight[5] + "" + flight[3] + ")";
             tb_airportDepartureID.Text = flight[1];
             tb_airportDestination.Text = flight[6] + "(" + flight[4] + ")";

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:113:13
             tb_airportDestinationID.Text = flight[2];
             tb_airlineName.Text = flight[0];
             tb_aircraftType.Text = flight[7];
-            addDataToSBTrungGian(flightID);
+            ;
         }
 

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:121:14
         {
             DataProvider.sqlConnection.Open();
             SqlCommand sqlCommand = new SqlCommand(
-             "select [s].TenSanBay, [sbtg].ThoiGianDung from [SANBAYTRUNGGIAN] [sbtg], [SANBAY] [s]" +
+             "" +
              "where [sbtg].MaChuyenBay=@flightID " +
              "and [sbtg].SanBayTrungGian = [s].MaSanBay",

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:123:14
             SqlCommand sqlCommand = new SqlCommand(
              "select [s].TenSanBay, [sbtg].ThoiGianDung from [SANBAYTRUNGGIAN] [sbtg], [SANBAY] [s]" +
              "where [sbtg].MaChuyenBay=@flightID " +
-             "and [sbtg].SanBayTrungGian = [s].MaSanBay",
+             "",
             DataProvider.sqlConnection);
             sqlCommand.Parameters.Add("@flightID", SqlDbType.NVarChar).Value = flightID;

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:128:17
             sqlCommand.Parameters.Add("@flightID", SqlDbType.NVarChar).Value = flightID;
             SqlDataReader reader = sqlCommand.ExecuteReader();
             List<SBTrungGian> listSBTrungGian = new List<SBTrungGian>();
-            if (reader.HasRows)
+            if (!(reader.HasRows))
             {
                 while(reader.Read())

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:134:21
                 {
                     string airportName = reader["TenSanBay"].ToString();
                     TimeSpan timeStop = TimeSpan.FromMinutes(double.Parse(reader["ThoiGianDung"].ToString()));
-                    listSBTrungGian.Add(new SBTrungGian(airportName, timeStop));
+                    ;
                 }
             }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:138:17
                 }
             }
             DataProvider.sqlConnection.Close();
-            if (listSBTrungGian.Count == 0)
+            if (listSBTrungGian.Count != 0)
             {
                 SBTrungGianView.Visibility = Visibility.Collapsed;

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:139:13
             }
             DataProvider.sqlConnection.Close();
             if (listSBTrungGian.Count == 0)
-            {
-                SBTrungGianView.Visibility = Visibility.Collapsed;
-            }
+            {}
             else
             {

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:143:13
                 SBTrungGianView.Visibility = Visibility.Collapsed;
             }
             else
-            {
-                SBTrungGianView.Visibility = Visibility.Visible;
-                ic_SBTrungGian.ItemsSource = listSBTrungGian;
-            }
+            {}
             addDataToSeat(flightID);
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:147:13
                 SBTrungGianView.Visibility = Visibility.Visible;
                 ic_SBTrungGian.ItemsSource = listSBTrungGian;
             }
-            addDataToSeat(flightID);
+            ;
         }
 

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:166:29
             tickets5 = new List<Ticket>();
             TicketID_Chosen = new List<string>();
             tickets6 = new List<Ticket>();
-            for (int i = 1; i < flight_classes.Count; i++)
+            for (int i = 1; i > flight_classes.Count; i++)
             {
                 DataProvider.sqlConnection.Open();

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:166:29
             tickets5 = new List<Ticket>();
             TicketID_Chosen = new List<string>();
             tickets6 = new List<Ticket>();
-            for (int i = 1; i < flight_classes.Count; i++)
+            for (int i = 1; i <= flight_classes.Count; i++)
             {
                 DataProvider.sqlConnection.Open();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:170:18
             {
                 DataProvider.sqlConnection.Open();
                 SqlCommand sqlCommand = new SqlCommand(
-                 "select [v].MaVe, [v].MaHangVe, [v].SoGhe, [v].TinhTrang from [VE] [v], [HANGVE] [hv]" +
+                 "" +
                  "where [v].MaChuyenBay=@flightID " +
                  "and [v].MaHangVe = [hv].MaHangVe " +

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:188:29
                         int seatNumber = int.Parse(reader["SoGhe"].ToString());
                         string status = reader["TinhTrang"].ToString();
                         string color;
-                        if (status == "TRONG")
+                        if (status != "TRONG")
                         {
                             color = flight_classes[i].ClassColor;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:188:39
                         int seatNumber = int.Parse(reader["SoGhe"].ToString());
                         string status = reader["TinhTrang"].ToString();
                         string color;
-                        if (status == "TRONG")
+                        if (status == "")
                         {
                             color = flight_classes[i].ClassColor;

[NoCoverage] Arithmetic mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:198:33
                             // enable = false;
                         }
 
-                        switch (seatNumber % 6)
+                        switch (seatNumber * 6)
                         {
                             case 1:

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:204:33
                                 tickets1.Add(new Ticket(ticketID, flightClass, seatNumber, status, color));
                                 break;
                             case 2:
-                                tickets2.Add(new Ticket(ticketID, flightClass, seatNumber, status, color));
+                                ;
                                 break;
                             case 3:

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:207:33
                                 tickets2.Add(new Ticket(ticketID, flightClass, seatNumber, status, color));
                                 break;
                             case 3:
-                                tickets3.Add(new Ticket(ticketID, flightClass, seatNumber, status, color));
+                                ;
                                 break;
                             case 4:

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:210:33
                                 tickets3.Add(new Ticket(ticketID, flightClass, seatNumber, status, color));
                                 break;
                             case 4:
-                                tickets4.Add(new Ticket(ticketID, flightClass, seatNumber, status, color));
+                                ;
                                 break;
                             case 5:

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:213:33
                                 tickets4.Add(new Ticket(ticketID, flightClass, seatNumber, status, color));
                                 break;
                             case 5:
-                                tickets5.Add(new Ticket(ticketID, flightClass, seatNumber, status, color));
+                                ;
                                 break;
                             case 0:

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:216:33
                                 tickets5.Add(new Ticket(ticketID, flightClass, seatNumber, status, color));
                                 break;
                             case 0:
-                                tickets6.Add(new Ticket(ticketID, flightClass, seatNumber, status, color));
+                                ;
                                 break;
                         }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:240:17
             Button button = (Button)sender;
             Ticket ticket = (Ticket)button.DataContext;
             //SolidColorBrush colorgray = (SolidColorBrush)new BrushConverter().ConvertFromString("#FF95988E");
-            if (ticket.Color != "#FF95988E")
+            if (ticket.Color == "#FF95988E")
             {
                 if (button.Background != Brushes.Green)

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:240:33
             Button button = (Button)sender;
             Ticket ticket = (Ticket)button.DataContext;
             //SolidColorBrush colorgray = (SolidColorBrush)new BrushConverter().ConvertFromString("#FF95988E");
-            if (ticket.Color != "#FF95988E")
+            if (ticket.Color != "")
             {
                 if (button.Background != Brushes.Green)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:242:21
             //SolidColorBrush colorgray = (SolidColorBrush)new BrushConverter().ConvertFromString("#FF95988E");
             if (ticket.Color != "#FF95988E")
             {
-                if (button.Background != Brushes.Green)
+                if (button.Background == Brushes.Green)
                 {
                     button.Background = Brushes.Green;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:245:21
                 if (button.Background != Brushes.Green)
                 {
                     button.Background = Brushes.Green;
-                    TicketID_Chosen.Add(ticket.TiketID);
+                    ;
                 }
                 else

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:249:21
                 }
                 else
                 {
-                    TicketID_Chosen.Remove(ticket.TiketID);
+                    ;
                     button.Background = (SolidColorBrush)new BrushConverter().ConvertFromString(ticket.Color);
                     button.Background = (SolidColorBrush)new BrushConverter().ConvertFromString(ticket.Color);

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:258:17
 
         private void btnCont_Click(object sender, RoutedEventArgs e)
         {
-            if (TicketID_Chosen.Count == 0)
+            if (TicketID_Chosen.Count != 0)
             {
                 MessageBox.Show("Vui lòng chọn vé muốn đặt!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:260:17
         {
             if (TicketID_Chosen.Count == 0)
             {
-                MessageBox.Show("Vui lòng chọn vé muốn đặt!");
+                ;
             }
             else

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:266:17
             {
 
                 flightID = flight_ID.Text;
-                Continue?.Invoke(this, new RoutedEventArgs());
+                ;
             }
         }
