[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:34:17
         private string flightClass;
         public string Departure
         {
-            get { return departure; }
+            get {}
             set { departure = value; }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:35:17
         public string Departure
         {
             get { return departure; }
-            set { departure = value; }
+            set {}
         }
         public string Destination

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:39:17
         }
         public string Destination
         {
-            get { return destination; } 
+            get {} 
             set { destination = value; }        
         } 

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:40:17
         public string Destination
         {
             get { return destination; } 
-            set { destination = value; }        
+            set {}        
         } 
         public string Date

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:44:17
         } 
         public string Date
         {
-            get { return _date; }
+            get {}
             set { _date = value; }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:45:17
         public string Date
         {
             get { return _date; }
-            set { _date = value; }
+            set {}
         }
         public int Quantity

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:49:17
         }
         public int Quantity
         {
-            set { quantity = value; }
+            set {}
             get { return quantity; }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:50:17
         public int Quantity
         {
             set { quantity = value; }
-            get { return quantity; }
+            get {}
         }
         public string FlightClass

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:54:17
         }
         public string FlightClass
         {
-            set { flightClass = value; }
+            set {}
             get { return flightClass; }
         }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:55:17
         public string FlightClass
         {
             set { flightClass = value; }
-            get { return flightClass; }
+            get {}
         }
         

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:63:13
         {
             InitializeComponent();
             date.Text = DateTime.Now.ToString("dd/MM/yyyy");
-            addDataToClass();
+            ;
             addDataToCCBDeparture();
             addDataToCCBDestination();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:64:13
             InitializeComponent();
             date.Text = DateTime.Now.ToString("dd/MM/yyyy");
             addDataToClass();
-            addDataToCCBDeparture();
+            ;
             addDataToCCBDestination();
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:65:13
             date.Text = DateTime.Now.ToString("dd/MM/yyyy");
             addDataToClass();
             addDataToCCBDeparture();
-            addDataToCCBDestination();
+            ;
         }
         public void btnSearch_Click(object sender, RoutedEventArgs e)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:69:73
         }
         public void btnSearch_Click(object sender, RoutedEventArgs e)
         {
-            if (cbbDeparture.Text == "" || cbbDestination.Text == "" || cbbQuantity.Text == "" || date.Text == "")
+            if (cbbDeparture.Text == "" || cbbDestination.Text == "" || cbbQuantity.Text != "" || date.Text == "")
             {
                 MessageBox.Show("Mời bạn chọn đầy đủ thông tin");

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:69:44
         }
         public void btnSearch_Click(object sender, RoutedEventArgs e)
         {
-            if (cbbDeparture.Text == "" || cbbDestination.Text == "" || cbbQuantity.Text == "" || date.Text == "")
+            if (cbbDeparture.Text == "" || cbbDestination.Text != "" || cbbQuantity.Text == "" || date.Text == "")
             {
                 MessageBox.Show("Mời bạn chọn đầy đủ thông tin");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:71:17
         {
             if (cbbDeparture.Text == "" || cbbDestination.Text == "" || cbbQuantity.Text == "" || date.Text == "")
             {
-                MessageBox.Show("Mời bạn chọn đầy đủ thông tin");
+                ;
             }
             else

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:75:21
             }
             else
             {
-                if (cbbDestination.Text == cbbDeparture.Text)
+                if (cbbDestination.Text != cbbDeparture.Text)
                 {
                     MessageBox.Show("Không được chọn nơi đến trùng nơi xuất phát");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:77:21
             {
                 if (cbbDestination.Text == cbbDeparture.Text)
                 {
-                    MessageBox.Show("Không được chọn nơi đến trùng nơi xuất phát");
+                    ;
                 }
                 else

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:77:37
             {
                 if (cbbDestination.Text == cbbDeparture.Text)
                 {
-                    MessageBox.Show("Không được chọn nơi đến trùng nơi xuất phát");
+                    MessageBox.Show("");
                 }
                 else

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:86:21
                     quantity = int.Parse(cbbQuantity.Text);
                     _date = date.Text;
                     flightClass = cbbClass.Text;
-                    Search?.Invoke(this, new RoutedEventArgs());
+                    ;
                 }
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:100:17
             List<string> listDestination = new List<string>();
             foreach (DataRow dr in ds.Tables[0].Rows)
             {
-                listDestination.Add(dr[0].ToString());
+                ;
             }
             cbbDestination.ItemsSource = listDestination;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:114:17
             List<string> listDeparture = new List<string>();
             foreach (DataRow dr in ds.Tables[0].Rows)
             {
-                listDeparture.Add(dr[0].ToString());
+                ;
             }
             cbbDeparture.ItemsSource = listDeparture;
