[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/AdminRight.xaml.cs:29:13
         public AdminRight()
         {
             InitializeComponent();
-            frame.NavigationService.Navigate(MonthBCDT);
+            ;
         }
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/AdminRight.xaml.cs:34:13
 
         private void MonthRevenue_Click(object sender, RoutedEventArgs e)
         {
-            frame.NavigationService.Navigate(MonthBCDT);
+            ;
         }
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/AdminRight.xaml.cs:39:13
 
         private void YearRevenue_Click(object sender, RoutedEventArgs e)
         {
-            frame.NavigationService.Navigate(YearBCDT);
+            ;
         }
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/AdminRight.xaml.cs:44:13
 
         private void QLCB_Click(object sender, RoutedEventArgs e)
         {
-            frame.NavigationService.Navigate(qLCB);
+            ;
         }
 
