[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:32:13
         public Chuyenbay()
         {
             InitializeComponent();
-            loadDatatoTable();
+            ;
         }
         public Chuyenbay(QLCB_SB q)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:38:13
         {
             InitializeComponent();
             this.q = q;
-            loadDatatoTable();
+            ;
         }
         public void loadDatatoTable()

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:61:34
                 cb.maCB = dr["MaChuyenBay"].ToString();
                 cb.SBdi = dr["SanBayDi"].ToString();
                 cb.SBden = dr["SanBayDen"].ToString();
-                cb.datetime = dr["NgayKhoiHanh"].ToString() + "-" + dr["ThoiGianXuatPhat"].ToString();
+                cb.datetime = dr[""].ToString() + "-" + dr["ThoiGianXuatPhat"].ToString();
                 cb.tgBay = dr["ThoiGianDuKien"].ToString();
                 cb.Gia = dr["Gia"].ToString();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:62:31
                 cb.SBdi = dr["SanBayDi"].ToString();
                 cb.SBden = dr["SanBayDen"].ToString();
                 cb.datetime = dr["NgayKhoiHanh"].ToString() + "-" + dr["ThoiGianXuatPhat"].ToString();
-                cb.tgBay = dr["ThoiGianDuKien"].ToString();
+                cb.tgBay = dr[""].ToString();
                 cb.Gia = dr["Gia"].ToString();
                 CBTable.Items.Add(cb);

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:63:29
                 cb.SBden = dr["SanBayDen"].ToString();
                 cb.datetime = dr["NgayKhoiHanh"].ToString() + "-" + dr["ThoiGianXuatPhat"].ToString();
                 cb.tgBay = dr["ThoiGianDuKien"].ToString();
-                cb.Gia = dr["Gia"].ToString();
+                cb.Gia = dr[""].ToString();
                 CBTable.Items.Add(cb);
                 stt++;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:64:17
                 cb.datetime = dr["NgayKhoiHanh"].ToString() + "-" + dr["ThoiGianXuatPhat"].ToString();
                 cb.tgBay = dr["ThoiGianDuKien"].ToString();
                 cb.Gia = dr["Gia"].ToString();
-                CBTable.Items.Add(cb);
+                ;
                 stt++;
             }

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:65:17
                 cb.tgBay = dr["ThoiGianDuKien"].ToString();
                 cb.Gia = dr["Gia"].ToString();
                 CBTable.Items.Add(cb);
-                stt++;
+                stt--;
             }
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:65:17
                 cb.tgBay = dr["ThoiGianDuKien"].ToString();
                 cb.Gia = dr["Gia"].ToString();
                 CBTable.Items.Add(cb);
-                stt++;
+                ;
             }
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:90:13
         private void Them_Click(object sender, RoutedEventArgs e)
         {
             addChuyenbay = new AddChuyenbay(CBTable, 0);
-            addChuyenbay.Show();
+            ;
         }
 

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:96:17
         private void Xoa_Click(object sender, RoutedEventArgs e)
         {
             chuyenbayclass info = CBTable.SelectedItem as chuyenbayclass;
-            if (info != null)
+            if (info == null)
             {
                 Boolean flag = false;

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:98:32
             chuyenbayclass info = CBTable.SelectedItem as chuyenbayclass;
             if (info != null)
             {
-                Boolean flag = false;
+                Boolean flag = true;
                 string query = "SELECT * From VE where MaChuyenBay = @ma";
                 SqlParameter param1 = new SqlParameter("@ma", info.maCB);

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:99:32
             if (info != null)
             {
                 Boolean flag = false;
-                string query = "SELECT * From VE where MaChuyenBay = @ma";
+                string query = "";
                 SqlParameter param1 = new SqlParameter("@ma", info.maCB);
                 DataTable table;

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:105:25
                 using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text, param1))
                 {
                     table = new DataTable();
-                    if (reader.HasRows)
+                    if (!(reader.HasRows))
                     {
                         table.Load(reader);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:107:25
                     table = new DataTable();
                     if (reader.HasRows)
                     {
-                        table.Load(reader);
+                        ;
 
                     }

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:112:75
                     }
                     foreach (DataRow dr in table.Rows)
                     {
-                        if (dr["TinhTrang"].ToString() != "TRONG") flag = true;
+                        if (dr["TinhTrang"].ToString() != "TRONG") flag = false;
                     }
                 }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:112:29
                     }
                     foreach (DataRow dr in table.Rows)
                     {
-                        if (dr["TinhTrang"].ToString() != "TRONG") flag = true;
+                        if (dr["TinhTrang"].ToString() == "TRONG") flag = true;
                     }
                 }

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:115:29
                         if (dr["TinhTrang"].ToString() != "TRONG") flag = true;
                     }
                 }
-                if (flag == true)
+                if (flag == false)
                 {
                     MessageBox.Show("Chuyến bay đã được đưa vào sử dụng, không thể xóa.", "Thông báo");

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:115:21
                         if (dr["TinhTrang"].ToString() != "TRONG") flag = true;
                     }
                 }
-                if (flag == true)
+                if (flag != true)
                 {
                     MessageBox.Show("Chuyến bay đã được đưa vào sử dụng, không thể xóa.", "Thông báo");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:117:21
                 }
                 if (flag == true)
                 {
-                    MessageBox.Show("Chuyến bay đã được đưa vào sử dụng, không thể xóa.", "Thông báo");
+                    ;
                     return;
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:117:37
                 }
                 if (flag == true)
                 {
-                    MessageBox.Show("Chuyến bay đã được đưa vào sử dụng, không thể xóa.", "Thông báo");
+                    MessageBox.Show("", "Thông báo");
                     return;
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:118:21
                 if (flag == true)
                 {
                     MessageBox.Show("Chuyến bay đã được đưa vào sử dụng, không thể xóa.", "Thông báo");
-                    return;
+                    ;
                 }
                 SqlConnection con = DataProvider.sqlConnection;

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:121:21
                     return;
                 }
                 SqlConnection con = DataProvider.sqlConnection;
-                if (con.State == ConnectionState.Closed)
+                if (con.State != ConnectionState.Closed)
                 {
                     con.Open();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:123:21
                 SqlConnection con = DataProvider.sqlConnection;
                 if (con.State == ConnectionState.Closed)
                 {
-                    con.Open();
+                    ;
                 }
                 SqlCommand cmd2 = new SqlCommand("Delete from  SANBAYTRUNGGIAN where MaChuyenBay=N'" + info.maCB + "'", con);

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:125:50
                 {
                     con.Open();
                 }
-                SqlCommand cmd2 = new SqlCommand("Delete from  SANBAYTRUNGGIAN where MaChuyenBay=N'" + info.maCB + "'", con);
+                SqlCommand cmd2 = new SqlCommand("" + info.maCB + "'", con);
                 cmd2.CommandType = CommandType.Text;
                 cmd2.ExecuteReader();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:125:116
                 {
                     con.Open();
                 }
-                SqlCommand cmd2 = new SqlCommand("Delete from  SANBAYTRUNGGIAN where MaChuyenBay=N'" + info.maCB + "'", con);
+                SqlCommand cmd2 = new SqlCommand("Delete from  SANBAYTRUNGGIAN where MaChuyenBay=N'" + info.maCB + "", con);
                 cmd2.CommandType = CommandType.Text;
                 cmd2.ExecuteReader();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:127:17
                 }
                 SqlCommand cmd2 = new SqlCommand("Delete from  SANBAYTRUNGGIAN where MaChuyenBay=N'" + info.maCB + "'", con);
                 cmd2.CommandType = CommandType.Text;
-                cmd2.ExecuteReader();
+                ;
                 con.Close();
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:128:17
                 SqlCommand cmd2 = new SqlCommand("Delete from  SANBAYTRUNGGIAN where MaChuyenBay=N'" + info.maCB + "'", con);
                 cmd2.CommandType = CommandType.Text;
                 cmd2.ExecuteReader();
-                con.Close();
+                ;
 
                 if (con.State == ConnectionState.Closed)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:130:21
                 cmd2.ExecuteReader();
                 con.Close();
 
-                if (con.State == ConnectionState.Closed)
+                if (con.State != ConnectionState.Closed)
                 {
                     con.Open();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:134:50
                 {
                     con.Open();
                 }
-                SqlCommand cmd3 = new SqlCommand("Delete from VE where  MaChuyenBay=N'" + info.maCB + "'", con);
+                SqlCommand cmd3 = new SqlCommand("" + info.maCB + "'", con);
                 cmd3.CommandType = CommandType.Text;
                 cmd3.ExecuteReader();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:136:17
                 }
                 SqlCommand cmd3 = new SqlCommand("Delete from VE where  MaChuyenBay=N'" + info.maCB + "'", con);
                 cmd3.CommandType = CommandType.Text;
-                cmd3.ExecuteReader();
+                ;
                 con.Close();
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:137:17
                 SqlCommand cmd3 = new SqlCommand("Delete from VE where  MaChuyenBay=N'" + info.maCB + "'", con);
                 cmd3.CommandType = CommandType.Text;
                 cmd3.ExecuteReader();
-                con.Close();
+                ;
 
                 if (con.State == ConnectionState.Closed)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:145:17
                 }
                 SqlCommand cmd1 = new SqlCommand("Delete from QuanLyHangVeChuyenBay where  MaChuyenBay=N'" + info.maCB + "'", con);
                 cmd1.CommandType = CommandType.Text;
-                cmd1.ExecuteReader();
+                ;
                 con.Close();
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:146:17
                 SqlCommand cmd1 = new SqlCommand("Delete from QuanLyHangVeChuyenBay where  MaChuyenBay=N'" + info.maCB + "'", con);
                 cmd1.CommandType = CommandType.Text;
                 cmd1.ExecuteReader();
-                con.Close();
+                ;
 
                 if (con.State == ConnectionState.Closed)

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:152:108
                 {
                     con.Open();
                 }
-                SqlCommand cmd = new SqlCommand("Delete from CHUYENBAY where MaChuyenBay=N'" + info.maCB + "'", con);
+                SqlCommand cmd = new SqlCommand("Delete from CHUYENBAY where MaChuyenBay=N'" + info.maCB + "", con);
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteReader();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:154:17
                 }
                 SqlCommand cmd = new SqlCommand("Delete from CHUYENBAY where MaChuyenBay=N'" + info.maCB + "'", con);
                 cmd.CommandType = CommandType.Text;
-                cmd.ExecuteReader();
+                ;
                 con.Close();
                 CBTable.Items.Clear();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:155:17
                 SqlCommand cmd = new SqlCommand("Delete from CHUYENBAY where MaChuyenBay=N'" + info.maCB + "'", con);
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteReader();
-                con.Close();
+                ;
                 CBTable.Items.Clear();
                 loadDatatoTable();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:156:17
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteReader();
                 con.Close();
-                CBTable.Items.Clear();
+                ;
                 loadDatatoTable();
                 MessageBox.Show("Xóa chuyến bay thành công ", "Thông báo");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:157:17
                 cmd.ExecuteReader();
                 con.Close();
                 CBTable.Items.Clear();
-                loadDatatoTable();
+                ;
                 MessageBox.Show("Xóa chuyến bay thành công ", "Thông báo");
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:158:17
                 con.Close();
                 CBTable.Items.Clear();
                 loadDatatoTable();
-                MessageBox.Show("Xóa chuyến bay thành công ", "Thông báo");
+                ;
             }
             else

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:162:17
             }
             else
             {
-                MessageBox.Show("Vui lòng chọn dòng bạn muốn xóa");
+                ;
             }
 

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:171:17
         private void Sua_Click(object sender, RoutedEventArgs e)
         {
             chuyenbaytofix = CBTable.SelectedItem as chuyenbayclass;
-            if (chuyenbaytofix != null)
+            if (chuyenbaytofix == null)
             {
                 string ngayKH = "";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:174:32
             if (chuyenbaytofix != null)
             {
                 string ngayKH = "";
-                string gioKH = "";
+                string gioKH = "Stryker was here!";
                 string query = "SELECT * FROM CHUYENBAY where MaCHuyenBay = @ma";
                 SqlParameter param1 = new SqlParameter("@ma", chuyenbaytofix.maCB);

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:188:33
                 foreach (DataRow dr in dt.Rows)
                 {
 
-                    ngayKH = dr["NgayKhoiHanh"].ToString();
+                    ngayKH = dr[""].ToString();
                     gioKH = dr["ThoiGianXuatPhat"].ToString();
 

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:200:21
                 int ngay = int.Parse(thoigian[0]);
                 string[] thoigianKH = gioKH.Split(':');
                 DateTime specificTime = new DateTime(nam, thang, ngay, int.Parse(thoigianKH[0]), int.Parse(thoigianKH[1]), second);
-                if (specificTime <= currentTime)
+                if (specificTime < currentTime)
                 {
                     MessageBox.Show("Chuyến bay này đã khởi hành, không thể sửa ", "Thông báo");

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:200:21
                 int ngay = int.Parse(thoigian[0]);
                 string[] thoigianKH = gioKH.Split(':');
                 DateTime specificTime = new DateTime(nam, thang, ngay, int.Parse(thoigianKH[0]), int.Parse(thoigianKH[1]), second);
-                if (specificTime <= currentTime)
+                if (specificTime > currentTime)
                 {
                     MessageBox.Show("Chuyến bay này đã khởi hành, không thể sửa ", "Thông báo");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:202:21
                 DateTime specificTime = new DateTime(nam, thang, ngay, int.Parse(thoigianKH[0]), int.Parse(thoigianKH[1]), second);
                 if (specificTime <= currentTime)
                 {
-                    MessageBox.Show("Chuyến bay này đã khởi hành, không thể sửa ", "Thông báo");
+                    ;
                     return;
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:203:21
                 if (specificTime <= currentTime)
                 {
                     MessageBox.Show("Chuyến bay này đã khởi hành, không thể sửa ", "Thông báo");
-                    return;
+                    ;
                 }
                 Boolean flag = false;

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:205:32
                     MessageBox.Show("Chuyến bay này đã khởi hành, không thể sửa ", "Thông báo");
                     return;
                 }
-                Boolean flag = false;
+                Boolean flag = true;
                 query = "SELECT * From VE where MaChuyenBay = @ma";
                 param1 = new SqlParameter("@ma", chuyenbaytofix.maCB);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:224:21
                 }
                 if (flag == true)
                 {
-                    MessageBox.Show("Chuyến bay đã được đưa vào sử dụng, không thể sửa.", "Thông báo");
+                    ;
                     return;
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:225:21
                 if (flag == true)
                 {
                     MessageBox.Show("Chuyến bay đã được đưa vào sử dụng, không thể sửa.", "Thông báo");
-                    return;
+                    ;
                 }
                 AddChuyenbay cb = new AddChuyenbay(CBTable, 1);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:228:17
                     return;
                 }
                 AddChuyenbay cb = new AddChuyenbay(CBTable, 1);
-                cb.Show();
+                ;
             }
             else

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:232:17
             }
             else
             {
-                MessageBox.Show("Vui lòng chọn dòng bạn muốn sửa");
+                ;
             }
         }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:245:51
             {
                 q.machuyenbayTxb.Text = info.maCB;
                 string s = "SELECT * From SANBAY WHERE MaSanBay = @ma";
-                SqlParameter p = new SqlParameter("@ma", info.SBdi);
+                SqlParameter p = new SqlParameter("", info.SBdi);
                 using (SqlDataReader reader = DataProvider.ExecuteReader(s, CommandType.Text, p))
                 {

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:250:77
                 {
                     if (reader.Read())
                     {
-                        q.fromTxb.Text = reader.GetString(reader.GetOrdinal("TenSanBay"));
+                        q.fromTxb.Text = reader.GetString(reader.GetOrdinal(""));
                     }
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:265:32
                 }
                 //  q.toTxb.Text =  info.SBdi;
                 q.datetimeTxb.Text = info.datetime;
-                string query = "SELECT * FROM CHUYENBAY where MaChuyenBay = @ma";
+                string query = "";
                 SqlParameter param1 = new SqlParameter("@ma", info.maCB);
                 using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text, param1))

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:277:40
                 }
                 foreach (DataRow dr in dt.Rows)
                 {
-                    q.GiaTxb.Text = dr["Gia"].ToString();
+                    q.GiaTxb.Text = dr[""].ToString();
                 }
             }
