[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:30:52
     public class FareClass
     {
         string _id, _name, _percentage;
-        public string id { get { return _id; } set { _id = value; } }
+        public string id { get { return _id; } set {} }
         public string name { get { return _name; } set { _name = value; } }
         public string percentage { get { return _percentage; } set { _percentage = value; } }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:30:32
     public class FareClass
     {
         string _id, _name, _percentage;
-        public string id { get { return _id; } set { _id = value; } }
+        public string id { get {} set { _id = value; } }
         public string name { get { return _name; } set { _name = value; } }
         public string percentage { get { return _percentage; } set { _percentage = value; } }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:31:34
     {
         string _id, _name, _percentage;
         public string id { get { return _id; } set { _id = value; } }
-        public string name { get { return _name; } set { _name = value; } }
+        public string name { get {} set { _name = value; } }
         public string percentage { get { return _percentage; } set { _percentage = value; } }
     }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:31:56
     {
         string _id, _name, _percentage;
         public string id { get { return _id; } set { _id = value; } }
-        public string name { get { return _name; } set { _name = value; } }
+        public string name { get { return _name; } set {} }
         public string percentage { get { return _percentage; } set { _percentage = value; } }
     }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:32:68
         string _id, _name, _percentage;
         public string id { get { return _id; } set { _id = value; } }
         public string name { get { return _name; } set { _name = value; } }
-        public string percentage { get { return _percentage; } set { _percentage = value; } }
+        public string percentage { get { return _percentage; } set {} }
     }
     public partial class FareClassManagement : UserControl

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:32:40
         string _id, _name, _percentage;
         public string id { get { return _id; } set { _id = value; } }
         public string name { get { return _name; } set { _name = value; } }
-        public string percentage { get { return _percentage; } set { _percentage = value; } }
+        public string percentage { get {} set { _percentage = value; } }
     }
     public partial class FareClassManagement : UserControl

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:51:13
 
         }
         private void loadData() {
-            FareClassTable.Items.Clear();
+            ;
             string query = "SELECT * FROM HANGVE";
             DataTable dt;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:52:28
         }
         private void loadData() {
             FareClassTable.Items.Clear();
-            string query = "SELECT * FROM HANGVE";
+            string query = "";
             DataTable dt;
             using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text))

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:66:25
                         fareClass.id = dr[0].ToString();
                         fareClass.name = dr[1].ToString();
                         fareClass.percentage = dr[2].ToString();
-                        FareClassTable.Items.Add(fareClass);
+                        ;
                     }
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:75:13
         private void add_Click(object sender, RoutedEventArgs e)
         {
             FareClassForm fareClassForm = new FareClassForm();
-            fareClassForm.ShowDialog();
+            ;
             if (fareClassForm.isSaved)
                 loadData();

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:76:17
         {
             FareClassForm fareClassForm = new FareClassForm();
             fareClassForm.ShowDialog();
-            if (fareClassForm.isSaved)
+            if (!(fareClassForm.isSaved))
                 loadData();
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:77:17
             FareClassForm fareClassForm = new FareClassForm();
             fareClassForm.ShowDialog();
             if (fareClassForm.isSaved)
-                loadData();
+                ;
         }
 

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:83:17
         private void delete_Click(object sender, RoutedEventArgs e)
         {
             FareClass selectedFareClass = FareClassTable.SelectedItem as FareClass;
-            if (selectedFareClass != null)
+            if (selectedFareClass == null)
             {
                 if (MessageBox.Show("Bạn có chắc muốn xóa hạng vé này không?", "Xóa hạng vé", MessageBoxButton.YesNo, MessageBoxImage.Question) == MessageBoxResult.Yes)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:85:21
             FareClass selectedFareClass = FareClassTable.SelectedItem as FareClass;
             if (selectedFareClass != null)
             {
-                if (MessageBox.Show("Bạn có chắc muốn xóa hạng vé này không?", "Xóa hạng vé", MessageBoxButton.YesNo, MessageBoxImage.Question) == MessageBoxResult.Yes)
+                if (MessageBox.Show("Bạn có chắc muốn xóa hạng vé này không?", "Xóa hạng vé", MessageBoxButton.YesNo, MessageBoxImage.Question) != MessageBoxResult.Yes)
                 {
                     try

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:85:37
             FareClass selectedFareClass = FareClassTable.SelectedItem as FareClass;
             if (selectedFareClass != null)
             {
-                if (MessageBox.Show("Bạn có chắc muốn xóa hạng vé này không?", "Xóa hạng vé", MessageBoxButton.YesNo, MessageBoxImage.Question) == MessageBoxResult.Yes)
+                if (MessageBox.Show("", "Xóa hạng vé", MessageBoxButton.YesNo, MessageBoxImage.Question) == MessageBoxResult.Yes)
                 {
                     try

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:94:25
                         cmd.CommandType = CommandType.Text;
                         cmd.ExecuteReader();
                         con.Close();
-                        FareClassTable.Items.Remove(selectedFareClass);
+                        ;
                     }
                     catch (Exception ex)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:98:25
                     }
                     catch (Exception ex)
                     {
-                        Console.WriteLine(ex);
+                        ;
                         MessageBox.Show("Hạng vé này đang được sử dụng trong các chuyến báy nên không thể xóa!", "Error", MessageBoxButton.OK, MessageBoxImage.Error);
                     }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:99:25
                     catch (Exception ex)
                     {
                         Console.WriteLine(ex);
-                        MessageBox.Show("Hạng vé này đang được sử dụng trong các chuyến báy nên không thể xóa!", "Error", MessageBoxButton.OK, MessageBoxImage.Error);
+                        ;
                     }
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:99:114
                     catch (Exception ex)
                     {
                         Console.WriteLine(ex);
-                        MessageBox.Show("Hạng vé này đang được sử dụng trong các chuyến báy nên không thể xóa!", "Error", MessageBoxButton.OK, MessageBoxImage.Error);
+                        MessageBox.Show("Hạng vé này đang được sử dụng trong các chuyến báy nên không thể xóa!", "", MessageBoxButton.OK, MessageBoxImage.Error);
                     }
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:105:33
             }
             else
             {
-                MessageBox.Show("Vui lòng chọn dòng bạn muốn xóa!", "Error");
+                MessageBox.Show("", "Error");
             }
         }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:112:17
         private void FareClassTable_SelectionChanged(object sender, SelectionChangedEventArgs e)
         {
             FareClass info = FareClassTable.SelectedItem as FareClass;
-            if (info != null)
+            if (info == null)
             {
                 q.mahangveTxb.Text = info.id;

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/FareClassManagement.xaml.cs:113:13
         {
             FareClass info = FareClassTable.SelectedItem as FareClass;
             if (info != null)
-            {
-                q.mahangveTxb.Text = info.id;
-                q.tenhangveTxb.Text = info.name;
-                q.tileTxb.Text = info.percentage;
-            }
+            {}
         }
     }
