[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Hangmaybay.xaml.cs:59:17
                 hb.STT = stt.ToString();
                 hb.mahang = dr["MaHang"].ToString();
                 hb.tenhang = dr["TenHang"].ToString();
-                HangMBTable.Items.Add(hb);
+                ;
                 stt++;
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Hangmaybay.xaml.cs:60:17
                 hb.mahang = dr["MaHang"].ToString();
                 hb.tenhang = dr["TenHang"].ToString();
                 HangMBTable.Items.Add(hb);
-                stt++;
+                ;
             }
         }

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Hangmaybay.xaml.cs:60:17
                 hb.mahang = dr["MaHang"].ToString();
                 hb.tenhang = dr["TenHang"].ToString();
                 HangMBTable.Items.Add(hb);
-                stt++;
+                stt--;
             }
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Hangmaybay.xaml.cs:74:13
         private void Them_Click(object sender, RoutedEventArgs e)
         {
             hangMB = new AddHangMB(HangMBTable, 0);
-            hangMB.Show();
+            ;
         }
 

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Hangmaybay.xaml.cs:80:17
         private void Xoa_Click(object sender, RoutedEventArgs e)
         {
             HangMBclass info = HangMBTable.SelectedItem as HangMBclass;
-            if (info != null)
+            if (info == null)
             {
                 try

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Hangmaybay.xaml.cs:93:21
                     cmd.CommandType = CommandType.Text;
                     cmd.ExecuteReader();
                     con.Close();
-                    HangMBTable.Items.Clear();
+                    ;
                     loadDatatoTable();
                     MessageBox.Show("Xóa hãng bay thành công ", "Thông báo");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Hangmaybay.xaml.cs:94:21
                     cmd.ExecuteReader();
                     con.Close();
                     HangMBTable.Items.Clear();
-                    loadDatatoTable();
+                    ;
                     MessageBox.Show("Xóa hãng bay thành công ", "Thông báo");
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Hangmaybay.xaml.cs:95:21
                     con.Close();
                     HangMBTable.Items.Clear();
                     loadDatatoTable();
-                    MessageBox.Show("Xóa hãng bay thành công ", "Thông báo");
+                    ;
                 }
                 catch

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Hangmaybay.xaml.cs:99:21
                 }
                 catch
                 {
-                    MessageBox.Show("Hãng máy bay này đã được đưa vào sử dụng, không thể xóa");
+                    ;
                 }
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Hangmaybay.xaml.cs:99:37
                 }
                 catch
                 {
-                    MessageBox.Show("Hãng máy bay này đã được đưa vào sử dụng, không thể xóa");
+                    MessageBox.Show("");
                 }
             }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Hangmaybay.xaml.cs:112:17
         private void Sua_Click(object sender, RoutedEventArgs e)
         {
             hangbaytofix = HangMBTable.SelectedItem as HangMBclass;
-            if (hangbaytofix != null)
+            if (hangbaytofix == null)
             {
                 hangMB = new AddHangMB(HangMBTable, 1);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Hangmaybay.xaml.cs:115:17
             if (hangbaytofix != null)
             {
                 hangMB = new AddHangMB(HangMBTable, 1);
-                hangMB.Show();
+                ;
             }
             else

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Hangmaybay.xaml.cs:126:17
         private void HangMBTable_SelectionChanged(object sender, SelectionChangedEventArgs e)
         {
             HangMBclass info = (HangMBclass)HangMBTable.SelectedItem;
-            if (info != null)
+            if (info == null)
             {
                 q.mahangTxb.Text = info.mahang;

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Hangmaybay.xaml.cs:127:13
         {
             HangMBclass info = (HangMBclass)HangMBTable.SelectedItem;
             if (info != null)
-            {
-                q.mahangTxb.Text = info.mahang;
-                q.tenhangTxb.Text = info.tenhang;
-            }
+            {}
         }
     }
