[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/HangVeItem.xaml.cs:30:52
         {
             InitializeComponent();
             string query = "SELECT * FROM HANGVE";
-            SqlParameter param1 = new SqlParameter("", "");
+            SqlParameter param1 = new SqlParameter("Stryker was here!", "");
             DataTable dt;
             using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text, param1))

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/HangVeItem.xaml.cs:30:56
         {
             InitializeComponent();
             string query = "SELECT * FROM HANGVE";
-            SqlParameter param1 = new SqlParameter("", "");
+            SqlParameter param1 = new SqlParameter("", "Stryker was here!");
             DataTable dt;
             using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text, param1))

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/HangVeItem.xaml.cs:42:17
             }
             foreach (DataRow dr in dt.Rows)
             {
-                maHVcBox.Items.Add(dr["TenHangVe"]);
+                ;
             }
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/HangVeItem.xaml.cs:45:13
                 maHVcBox.Items.Add(dr["TenHangVe"]);
             }
 
-            SLcBox.Items.Add("6");
+            ;
             SLcBox.Items.Add("12");
             SLcBox.Items.Add("18");

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/HangVeItem.xaml.cs:45:30
                 maHVcBox.Items.Add(dr["TenHangVe"]);
             }
 
-            SLcBox.Items.Add("6");
+            SLcBox.Items.Add("");
             SLcBox.Items.Add("12");
             SLcBox.Items.Add("18");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/HangVeItem.xaml.cs:46:13
             }
 
             SLcBox.Items.Add("6");
-            SLcBox.Items.Add("12");
+            ;
             SLcBox.Items.Add("18");
 

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/HangVeItem.xaml.cs:46:30
             }
 
             SLcBox.Items.Add("6");
-            SLcBox.Items.Add("12");
+            SLcBox.Items.Add("");
             SLcBox.Items.Add("18");
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/HangVeItem.xaml.cs:47:13
 
             SLcBox.Items.Add("6");
             SLcBox.Items.Add("12");
-            SLcBox.Items.Add("18");
+            ;
 
         }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/HangVeItem.xaml.cs:55:17
         private void maHVcBox_DropDownClosed(object sender, EventArgs e)
         {
             QLHangVeClass hv = (sender as ComboBox).DataContext as QLHangVeClass;
-            if (hv != null)
+            if (hv == null)
             {
                 hv.Mahangve = (sender as ComboBox).SelectedItem as string;

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/HangVeItem.xaml.cs:56:13
         {
             QLHangVeClass hv = (sender as ComboBox).DataContext as QLHangVeClass;
             if (hv != null)
-            {
-                hv.Mahangve = (sender as ComboBox).SelectedItem as string;
-                //string s = "SELECT * From HANGVE WHERE TenHangVe = @ten";
-                //SqlParameter p = new SqlParameter("@ten", (sender as ComboBox).SelectedItem as string);
-                //using (SqlDataReader reader = DataProvider.ExecuteReader(s, CommandType.Text, p))
-                //{
-                //    if (reader.Read())
-                //    {
-                //        hv.Mahangve = reader.GetString(reader.GetOrdinal("MaHangVe"));
-                //    }
-                //}
-            }
+            {}
         }
 

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/HangVeItem.xaml.cs:74:13
         {
             QLHangVeClass hv = (sender as ComboBox).DataContext as QLHangVeClass;
             if (hv != null)
-            {
-                hv.Soluong = (sender as ComboBox).SelectedItem as string;
-            }
+            {}
         }
 

[NoCoverage] Logical mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/HangVeItem.xaml.cs:82:17
         private void maHVcBox_DropDownOpened(object sender, EventArgs e)
         {
             QLHangVeClass hv = (sender as ComboBox).DataContext as QLHangVeClass;
-            if (hv.Machuyenbay != null && hv.Mahangve != null)
+            if (hv.Machuyenbay != null || hv.Mahangve != null)
             {
                 string maHV = "";

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/HangVeItem.xaml.cs:82:43
         private void maHVcBox_DropDownOpened(object sender, EventArgs e)
         {
             QLHangVeClass hv = (sender as ComboBox).DataContext as QLHangVeClass;
-            if (hv.Machuyenbay != null && hv.Mahangve != null)
+            if (hv.Machuyenbay != null && hv.Mahangve == null)
             {
                 string maHV = "";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/HangVeItem.xaml.cs:86:51
             {
                 string maHV = "";
                 string s = "SELECT * From HANGVE WHERE TenHangVe = @ten";
-                SqlParameter p = new SqlParameter("@ten", hv.Mahangve);
+                SqlParameter p = new SqlParameter("", hv.Mahangve);
                 using (SqlDataReader reader = DataProvider.ExecuteReader(s, CommandType.Text, p))
                 {

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/HangVeItem.xaml.cs:91:67
                 {
                     if (reader.Read())
                     {
-                        maHV = reader.GetString(reader.GetOrdinal("MaHangVe"));
+                        maHV = reader.GetString(reader.GetOrdinal(""));
                     }
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/HangVeItem.xaml.cs:94:32
                         maHV = reader.GetString(reader.GetOrdinal("MaHangVe"));
                     }
                 }
-                string query = "SELECT * From VE where MaChuyenBay = @ma and MaHangVe = @mah";
+                string query = "";
                 SqlParameter param1 = new SqlParameter("@ma", hv.Machuyenbay);
                 SqlParameter param2 = new SqlParameter("@mah", maHV);

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/HangVeItem.xaml.cs:96:56
                 }
                 string query = "SELECT * From VE where MaChuyenBay = @ma and MaHangVe = @mah";
                 SqlParameter param1 = new SqlParameter("@ma", hv.Machuyenbay);
-                SqlParameter param2 = new SqlParameter("@mah", maHV);
+                SqlParameter param2 = new SqlParameter("", maHV);
                 DataTable table;
                 using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text, param1, param2))

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/HangVeItem.xaml.cs:103:25
                     table = new DataTable();
                     if (reader.HasRows)
                     {
-                        MessageBox.Show("Không thể sửa hạng vé này.", "Thông báo");
+                        ;
 
                         return;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/HangVeItem.xaml.cs:103:41
                     table = new DataTable();
                     if (reader.HasRows)
                     {
-                        MessageBox.Show("Không thể sửa hạng vé này.", "Thông báo");
+                        MessageBox.Show("", "Thông báo");
 
                         return;

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/HangVeItem.xaml.cs:115:17
         private void SLcBox_DropDownOpened(object sender, EventArgs e)
         {
             QLHangVeClass hv = (sender as ComboBox).DataContext as QLHangVeClass;
-            if (hv.Machuyenbay != null && hv.Mahangve != null)
+            if (hv.Machuyenbay == null && hv.Mahangve != null)
             {
                 string maHV = "";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/HangVeItem.xaml.cs:118:28
             if (hv.Machuyenbay != null && hv.Mahangve != null)
             {
                 string maHV = "";
-                string s = "SELECT * From HANGVE WHERE TenHangVe = @ten";
+                string s = "";
                 SqlParameter p = new SqlParameter("@ten", hv.Mahangve);
                 using (SqlDataReader reader = DataProvider.ExecuteReader(s, CommandType.Text, p))
