[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:39:33
             InitializeComponent();
 
             List<int> months = new List<int>();
-            for (int month = 1; month <= 12; month++)
+            for (int month = 1; month < 12; month++)
             {
                 months.Add(month);

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:39:46
             InitializeComponent();
 
             List<int> months = new List<int>();
-            for (int month = 1; month <= 12; month++)
+            for (int month = 1; month <= 12; month--)
             {
                 months.Add(month);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:41:17
             List<int> months = new List<int>();
             for (int month = 1; month <= 12; month++)
             {
-                months.Add(month);
+                ;
             }
             cBoxMonth.ItemsSource = months;

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:47:35
             cBoxMonth.SelectedIndex = 0;
             List<int> years = new List<int>();
             int currentYear = DateTime.Now.Year;
-            for (int year = 2020; year <= currentYear; year++)
+            for (int year = 2020; year > currentYear; year++)
             {
                 years.Add(year);

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:47:56
             cBoxMonth.SelectedIndex = 0;
             List<int> years = new List<int>();
             int currentYear = DateTime.Now.Year;
-            for (int year = 2020; year <= currentYear; year++)
+            for (int year = 2020; year <= currentYear; year--)
             {
                 years.Add(year);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:49:17
             int currentYear = DateTime.Now.Year;
             for (int year = 2020; year <= currentYear; year++)
             {
-                years.Add(year);
+                ;
             }
             cBoxYear.ItemsSource = years;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:69:13
         DataTable loadData()
         {
             DataTable dt = new DataTable();
-            MonthRevenueTable.Items.Clear();
+            ;
 
             string query =

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:73:21
 
             string query =
                 "SELECT C.MaChuyenBay, " +
-                    "COUNT(DISTINCT MaVe) AS SoVe, " +
+                    "" +
                     "COALESCE(SUM(V.GiaVe), 0) AS DoanhThu, " +
                 "CASE " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:76:29
                     "COUNT(DISTINCT MaVe) AS SoVe, " +
                     "COALESCE(SUM(V.GiaVe), 0) AS DoanhThu, " +
                 "CASE " +
-                            "WHEN(SELECT SUM(V1.GiaVe) " +
+                            "" +
                       "FROM VE V1 " +
                       "JOIN CHUYENBAY C1 ON V1.MaChuyenBay = C1.MaChuyenBay " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:77:23
                     "COALESCE(SUM(V.GiaVe), 0) AS DoanhThu, " +
                 "CASE " +
                             "WHEN(SELECT SUM(V1.GiaVe) " +
-                      "FROM VE V1 " +
+                      "" +
                       "JOIN CHUYENBAY C1 ON V1.MaChuyenBay = C1.MaChuyenBay " +
                       "WHERE SUBSTRING(C1.NgayKhoiHanh, 4, 2) = @Month AND SUBSTRING(C1.NgayKhoiHanh, 7, 4) = @Year AND V1.TinhTrang = 'SOLD') IS NULL THEN 0 " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:78:23
                 "CASE " +
                             "WHEN(SELECT SUM(V1.GiaVe) " +
                       "FROM VE V1 " +
-                      "JOIN CHUYENBAY C1 ON V1.MaChuyenBay = C1.MaChuyenBay " +
+                      "" +
                       "WHERE SUBSTRING(C1.NgayKhoiHanh, 4, 2) = @Month AND SUBSTRING(C1.NgayKhoiHanh, 7, 4) = @Year AND V1.TinhTrang = 'SOLD') IS NULL THEN 0 " +
                 "ELSE(COALESCE(SUM(CAST(V.GiaVe AS decimal(18, 2))), 0) * 100) / " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:85:23
                       "FROM VE V1 " +
                       "JOIN CHUYENBAY C1 ON V1.MaChuyenBay = C1.MaChuyenBay " +
                       "WHERE SUBSTRING(C1.NgayKhoiHanh, 4, 2) = @Month AND SUBSTRING(C1.NgayKhoiHanh, 7, 4) = @Year AND V1.TinhTrang = 'SOLD') " +
-                      "END AS 'TyLe' " +
+                      "" +
                 "FROM CHUYENBAY C LEFT JOIN VE V ON C.MaChuyenBay = V.MaChuyenBay AND TinhTrang = 'SOLD' " +
                 "WHERE SUBSTRING(C.NgayKhoiHanh, 4, 2) = @Month AND SUBSTRING(C.NgayKhoiHanh, 7, 4) = @Year " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:90:29
                 "WHERE SUBSTRING(C.NgayKhoiHanh, 4, 2) = @Month AND SUBSTRING(C.NgayKhoiHanh, 7, 4) = @Year " +
                 "GROUP BY C.MaChuyenBay, C.NgayKhoiHanh";
 
-            string query1 = "SELECT * FROM [BaoCaoThang] where Thang=@Month and Nam=@Year";
+            string query1 = "";
 
             SqlParameter param1 = new SqlParameter("@Month", int.Parse(cBoxMonth.SelectedItem.ToString()));

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:93:52
             string query1 = "SELECT * FROM [BaoCaoThang] where Thang=@Month and Nam=@Year";
 
             SqlParameter param1 = new SqlParameter("@Month", int.Parse(cBoxMonth.SelectedItem.ToString()));
-            SqlParameter param2 = new SqlParameter("@Year", int.Parse(cBoxYear.SelectedItem.ToString()));
+            SqlParameter param2 = new SqlParameter("", int.Parse(cBoxYear.SelectedItem.ToString()));
 
             try

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:97:29
 
             try
             {              
-                bool flag = true;
+                bool flag = false;
                 dt = new DataTable();
                 DateTime currentDate = DateTime.Now;

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:102:25
                 DateTime currentDate = DateTime.Now;
                 using (SqlDataReader reader = DataProvider.ExecuteReader(query1, CommandType.Text, param1, param2))
                 {
-                    if (reader.HasRows)
+                    if (!(reader.HasRows))
                     {
                         dt.Load(reader);

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:105:32
                     if (reader.HasRows)
                     {
                         dt.Load(reader);
-                        flag = false;
+                        flag = true;
                         return dt;
                     }

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:109:21
                         return dt;
                     }
                 }
-                if (flag)
+                if (!(flag))
                 {
                     SqlParameter param3 = new SqlParameter("@Month", int.Parse(cBoxMonth.SelectedItem.ToString()));

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:118:29
                         if (reader.HasRows)
                         {
                             dt = new DataTable();
-                            dt.Load(reader);
+                            ;
                             if (currentDate.Month > int.Parse(cBoxMonth.SelectedItem.ToString()))
                             {

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:119:33
                         {
                             dt = new DataTable();
                             dt.Load(reader);
-                            if (currentDate.Month > int.Parse(cBoxMonth.SelectedItem.ToString()))
+                            if (currentDate.Month < int.Parse(cBoxMonth.SelectedItem.ToString()))
                             {
                                 SqlConnection sqlCon = DataProvider.sqlConnection;

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:119:33
                         {
                             dt = new DataTable();
                             dt.Load(reader);
-                            if (currentDate.Month > int.Parse(cBoxMonth.SelectedItem.ToString()))
+                            if (!(currentDate.Month > int.Parse(cBoxMonth.SelectedItem.ToString())))
                             {
                                 SqlConnection sqlCon = DataProvider.sqlConnection;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:126:37
                                 using (sqlCon)
                                 {
 
-                                    sqlCon.Open();
+                                    ;
 
                                     foreach (DataRow row in dt.Rows)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:136:64
                                             cmd.CommandType = CommandType.Text;
                                             cmd.ExecuteNonQuery();
                                         }
-                                        catch (Exception ex) { System.Windows.MessageBox.Show(ex.ToString()); }
+                                        catch (Exception ex) { ; }
                                     }
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:139:37
                                         catch (Exception ex) { System.Windows.MessageBox.Show(ex.ToString()); }
                                     }
 
-                                    sqlCon.Close();
+                                    ;
                                 }
                             }                           

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:148:36
                 }
 
             }
-            catch (Exception ex) { Console.WriteLine(ex); return dt; }
+            catch (Exception ex) { ; return dt; }
             return dt;
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:165:17
                 ms.sove = (dr.Field<int>(1)).ToString();
                 ms.doanhthu = dr[2].ToString();
                 ms.tile = dr[3].ToString();
-                MonthRevenueTable.Items.Add(ms);
+                ;
                 stt++;
                 sum += int.Parse(ms.doanhthu);

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:166:17
                 ms.doanhthu = dr[2].ToString();
                 ms.tile = dr[3].ToString();
                 MonthRevenueTable.Items.Add(ms);
-                stt++;
+                stt--;
                 sum += int.Parse(ms.doanhthu);
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:166:17
                 ms.doanhthu = dr[2].ToString();
                 ms.tile = dr[3].ToString();
                 MonthRevenueTable.Items.Add(ms);
-                stt++;
+                ;
                 sum += int.Parse(ms.doanhthu);
             }

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:167:17
                 ms.tile = dr[3].ToString();
                 MonthRevenueTable.Items.Add(ms);
                 stt++;
-                sum += int.Parse(ms.doanhthu);
+                sum -= int.Parse(ms.doanhthu);
             }
             tb_total.Text = sum.ToString();
