[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/QLCB_SB.xaml.cs:35:13
             Hbaydetail.Visibility = Visibility.Hidden;
             Hvedetail.Visibility = Visibility.Hidden;
             sanbay = new Sanbay(this);
-            SB_CB.NavigationService.Navigate(sanbay);
+            ;
         }
         private static string Masb;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/QLCB_SB.xaml.cs:55:13
             Cbaydetail.Visibility = Visibility.Hidden;
             Hbaydetail.Visibility = Visibility.Hidden;
             Hvedetail.Visibility = Visibility.Hidden;
-            SB_CB.NavigationService.Navigate(sanbay);
+            ;
 
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/QLCB_SB.xaml.cs:66:13
             Cbaydetail.Visibility = Visibility.Visible;
             Hbaydetail.Visibility = Visibility.Hidden;
             Hvedetail.Visibility = Visibility.Hidden;
-            SB_CB.NavigationService.Navigate(chuyenbay);
+            ;
         }
         //private void HangMB_Click(object sender, RoutedEventArgs e)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/QLCB_SB.xaml.cs:84:13
             Cbaydetail.Visibility = Visibility.Hidden;
             Hbaydetail.Visibility = Visibility.Hidden;
             Hvedetail.Visibility = Visibility.Visible;
-            SB_CB.NavigationService.Navigate(fareClassManagement);
+            ;
         }
     }
