[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:37:28
         }
         private void loadData()
         {
-            string query = "SELECT * FROM BANGTHAMSO";
+            string query = "";
             DataTable dt;
             using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text))

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:66:32
         private void editTGBTT_Click(object sender, RoutedEventArgs e)
         {
             panelTGBTT.Visibility = Visibility.Visible;
-            TGBTT.IsReadOnly = false;
+            TGBTT.IsReadOnly = true;
             TGBTT.Focus();
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:67:13
         {
             panelTGBTT.Visibility = Visibility.Visible;
             TGBTT.IsReadOnly = false;
-            TGBTT.Focus();
+            ;
         }
         private void editSSBTGTD_Click(object sender, RoutedEventArgs e)

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:72:34
         private void editSSBTGTD_Click(object sender, RoutedEventArgs e)
         {
             panelSSBTGTD.Visibility = Visibility.Visible;
-            SSBTGTD.IsReadOnly = false;
+            SSBTGTD.IsReadOnly = true;
             SSBTGTD.Focus();
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:73:13
         {
             panelSSBTGTD.Visibility = Visibility.Visible;
             SSBTGTD.IsReadOnly = false;
-            SSBTGTD.Focus();
+            ;
         }
         private void editTGDTT_Click(object sender, RoutedEventArgs e)

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:78:32
         private void editTGDTT_Click(object sender, RoutedEventArgs e)
         {
             panelTGDTT.Visibility = Visibility.Visible;
-            TGDTT.IsReadOnly = false;
+            TGDTT.IsReadOnly = true;
             TGDTT.Focus();
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:79:13
         {
             panelTGDTT.Visibility = Visibility.Visible;
             TGDTT.IsReadOnly = false;
-            TGDTT.Focus();
+            ;
         }
         private void editTGDTD_Click(object sender, RoutedEventArgs e)

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:84:32
         private void editTGDTD_Click(object sender, RoutedEventArgs e)
         {
             panelTGDTD.Visibility = Visibility.Visible;
-            TGDTD.IsReadOnly = false;
+            TGDTD.IsReadOnly = true;
             TGDTD.Focus();
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:85:13
         {
             panelTGDTD.Visibility = Visibility.Visible;
             TGDTD.IsReadOnly = false;
-            TGDTD.Focus();
+            ;
         }
         private void editSGTKHCPDV_Click(object sender, RoutedEventArgs e)

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:90:36
         private void editSGTKHCPDV_Click(object sender, RoutedEventArgs e)
         {
             panelSGTKHCPDV.Visibility = Visibility.Visible;
-            SGTKHCPDV.IsReadOnly = false;
+            SGTKHCPDV.IsReadOnly = true;
             SGTKHCPDV.Focus();
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:91:13
         {
             panelSGTKHCPDV.Visibility = Visibility.Visible;
             SGTKHCPDV.IsReadOnly = false;
-            SGTKHCPDV.Focus();
+            ;
         }
         private void editSGTKHCPHV_Click(object sender, RoutedEventArgs e)

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:96:36
         private void editSGTKHCPHV_Click(object sender, RoutedEventArgs e)
         {
             panelSGTKHCPHV.Visibility = Visibility.Visible;
-            SGTKHCPHV.IsReadOnly = false;
+            SGTKHCPHV.IsReadOnly = true;
             SGTKHCPHV.Focus();
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:97:13
         {
             panelSGTKHCPHV.Visibility = Visibility.Visible;
             SGTKHCPHV.IsReadOnly = false;
-            SGTKHCPHV.Focus();
+            ;
         }
         private void OkTGBTTBtn_Click(object sender, RoutedEventArgs e)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:104:21
             try
             {
                 int oldvalue = ruleChangeVM.ThoiGianBayToiThieu;               
-                if (int.Parse(TGBTT.Text) <= 10)
+                if (int.Parse(TGBTT.Text) < 10)
                 {
                     MessageBox.Show("Vui lòng nhập thời gian bay tối thiểu lớn hơn 10 phút.", "Dữ liệu không hợp lệ!");

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:104:21
             try
             {
                 int oldvalue = ruleChangeVM.ThoiGianBayToiThieu;               
-                if (int.Parse(TGBTT.Text) <= 10)
+                if (int.Parse(TGBTT.Text) > 10)
                 {
                     MessageBox.Show("Vui lòng nhập thời gian bay tối thiểu lớn hơn 10 phút.", "Dữ liệu không hợp lệ!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:106:21
                 int oldvalue = ruleChangeVM.ThoiGianBayToiThieu;               
                 if (int.Parse(TGBTT.Text) <= 10)
                 {
-                    MessageBox.Show("Vui lòng nhập thời gian bay tối thiểu lớn hơn 10 phút.", "Dữ liệu không hợp lệ!");
+                    ;
                     return;
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:107:21
                 if (int.Parse(TGBTT.Text) <= 10)
                 {
                     MessageBox.Show("Vui lòng nhập thời gian bay tối thiểu lớn hơn 10 phút.", "Dữ liệu không hợp lệ!");
-                    return;
+                    ;
                 }
                 ruleChangeVM.ThoiGianBayToiThieu = int.Parse(TGBTT.Text);

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:117:36
                 cmd.ExecuteNonQuery();
                 sqlCon.Close();
                 panelTGBTT.Visibility = Visibility.Collapsed;
-                TGBTT.IsReadOnly = true;
+                TGBTT.IsReadOnly = false;
             } catch(Exception ex) {
                 MessageBox.Show("Vui lòng nhập một số nguyên dương.", "Dữ liệu không hợp lệ!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:119:17
                 panelTGBTT.Visibility = Visibility.Collapsed;
                 TGBTT.IsReadOnly = true;
             } catch(Exception ex) {
-                MessageBox.Show("Vui lòng nhập một số nguyên dương.", "Dữ liệu không hợp lệ!");
+                ;
             }
         }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:135:21
             {
                 int oldvalue = ruleChangeVM.SoSanBayTrungGianToiDa;
 
-                if (int.Parse(SSBTGTD.Text) <= 0)
+                if (int.Parse(SSBTGTD.Text) > 0)
                 {
                     MessageBox.Show("Vui lòng nhập một số nguyên dương.", "Dữ liệu không hợp lệ!");

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:135:21
             {
                 int oldvalue = ruleChangeVM.SoSanBayTrungGianToiDa;
 
-                if (int.Parse(SSBTGTD.Text) <= 0)
+                if (!(int.Parse(SSBTGTD.Text) <= 0))
                 {
                     MessageBox.Show("Vui lòng nhập một số nguyên dương.", "Dữ liệu không hợp lệ!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:137:21
 
                 if (int.Parse(SSBTGTD.Text) <= 0)
                 {
-                    MessageBox.Show("Vui lòng nhập một số nguyên dương.", "Dữ liệu không hợp lệ!");
+                    ;
                     return;
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:137:75
 
                 if (int.Parse(SSBTGTD.Text) <= 0)
                 {
-                    MessageBox.Show("Vui lòng nhập một số nguyên dương.", "Dữ liệu không hợp lệ!");
+                    MessageBox.Show("Vui lòng nhập một số nguyên dương.", "");
                     return;
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:138:21
                 if (int.Parse(SSBTGTD.Text) <= 0)
                 {
                     MessageBox.Show("Vui lòng nhập một số nguyên dương.", "Dữ liệu không hợp lệ!");
-                    return;
+                    ;
                 }
                 ruleChangeVM.SoSanBayTrungGianToiDa = int.Parse(SSBTGTD.Text);

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:143:49
                 ruleChangeVM.SoSanBayTrungGianToiDa = int.Parse(SSBTGTD.Text);
                 SqlConnection sqlCon = DataProvider.sqlConnection;
                 sqlCon.Open();
-                SqlCommand cmd = new SqlCommand("Update BANGTHAMSO set GiaTri=" + ruleChangeVM.SoSanBayTrungGianToiDa + "where CONVERT(varchar, TenThamSo)='SoSanBayTrungGianToiDa'", sqlCon);
+                SqlCommand cmd = new SqlCommand("" + ruleChangeVM.SoSanBayTrungGianToiDa + "where CONVERT(varchar, TenThamSo)='SoSanBayTrungGianToiDa'", sqlCon);
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:148:38
                 cmd.ExecuteNonQuery();
                 sqlCon.Close();
                 panelSSBTGTD.Visibility = Visibility.Collapsed;
-                SSBTGTD.IsReadOnly = true;
+                SSBTGTD.IsReadOnly = false;
             }
             catch (Exception ex)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:167:21
             {
                 int oldvalue = ruleChangeVM.ThoiGianDungToiThieu;
                 
-                if (int.Parse(TGDTT.Text) <= 5)
+                if (int.Parse(TGDTT.Text) > 5)
                 {
                     MessageBox.Show("Vui lòng nhập thời gian dừng tối thiểu lớn hơn 5 phút.", "Dữ liệu không hợp lệ!");

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:167:21
             {
                 int oldvalue = ruleChangeVM.ThoiGianDungToiThieu;
                 
-                if (int.Parse(TGDTT.Text) <= 5)
+                if (!(int.Parse(TGDTT.Text) <= 5))
                 {
                     MessageBox.Show("Vui lòng nhập thời gian dừng tối thiểu lớn hơn 5 phút.", "Dữ liệu không hợp lệ!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:169:21
                 
                 if (int.Parse(TGDTT.Text) <= 5)
                 {
-                    MessageBox.Show("Vui lòng nhập thời gian dừng tối thiểu lớn hơn 5 phút.", "Dữ liệu không hợp lệ!");
+                    ;
                     return;
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:169:37
                 
                 if (int.Parse(TGDTT.Text) <= 5)
                 {
-                    MessageBox.Show("Vui lòng nhập thời gian dừng tối thiểu lớn hơn 5 phút.", "Dữ liệu không hợp lệ!");
+                    MessageBox.Show("", "Dữ liệu không hợp lệ!");
                     return;
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:170:21
                 if (int.Parse(TGDTT.Text) <= 5)
                 {
                     MessageBox.Show("Vui lòng nhập thời gian dừng tối thiểu lớn hơn 5 phút.", "Dữ liệu không hợp lệ!");
-                    return;
+                    ;
                 }
                 ruleChangeVM.ThoiGianDungToiThieu = int.Parse(TGDTT.Text);

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:175:49
                 ruleChangeVM.ThoiGianDungToiThieu = int.Parse(TGDTT.Text);
                 SqlConnection sqlCon = DataProvider.sqlConnection;
                 sqlCon.Open();
-                SqlCommand cmd = new SqlCommand("Update BANGTHAMSO set GiaTri=" + ruleChangeVM.ThoiGianDungToiThieu + "where CONVERT(varchar, TenThamSo)='ThoiGianDungToiThieu'", sqlCon);
+                SqlCommand cmd = new SqlCommand("" + ruleChangeVM.ThoiGianDungToiThieu + "where CONVERT(varchar, TenThamSo)='ThoiGianDungToiThieu'", sqlCon);
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:180:36
                 cmd.ExecuteNonQuery();
                 sqlCon.Close();
                 panelTGDTT.Visibility = Visibility.Collapsed;
-                TGDTT.IsReadOnly = true;
+                TGDTT.IsReadOnly = false;
             }
             catch (Exception ex)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:184:17
             }
             catch (Exception ex)
             {
-                MessageBox.Show("Vui lòng nhập một số nguyên.", "Dữ liệu không hợp lệ!");
+                ;
             }
         }

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:200:21
             {
                 int oldvalue = ruleChangeVM.ThoiGianDungToiDa;
                 
-                if (int.Parse(TGDTD.Text) <= 5)
+                if (!(int.Parse(TGDTD.Text) <= 5))
                 {
                     MessageBox.Show("Vui lòng nhập thời gian dừng tối đa lớn hơn 5 phút.", "Dữ liệu không hợp lệ!");

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:200:21
             {
                 int oldvalue = ruleChangeVM.ThoiGianDungToiDa;
                 
-                if (int.Parse(TGDTD.Text) <= 5)
+                if (int.Parse(TGDTD.Text) > 5)
                 {
                     MessageBox.Show("Vui lòng nhập thời gian dừng tối đa lớn hơn 5 phút.", "Dữ liệu không hợp lệ!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:202:21
                 
                 if (int.Parse(TGDTD.Text) <= 5)
                 {
-                    MessageBox.Show("Vui lòng nhập thời gian dừng tối đa lớn hơn 5 phút.", "Dữ liệu không hợp lệ!");
+                    ;
                     return;
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:203:21
                 if (int.Parse(TGDTD.Text) <= 5)
                 {
                     MessageBox.Show("Vui lòng nhập thời gian dừng tối đa lớn hơn 5 phút.", "Dữ liệu không hợp lệ!");
-                    return;
+                    ;
                 }
                 ruleChangeVM.ThoiGianDungToiDa = int.Parse(TGDTD.Text);

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:208:49
                 ruleChangeVM.ThoiGianDungToiDa = int.Parse(TGDTD.Text);
                 SqlConnection sqlCon = DataProvider.sqlConnection;
                 sqlCon.Open();
-                SqlCommand cmd = new SqlCommand("Update BANGTHAMSO set GiaTri=" + ruleChangeVM.ThoiGianDungToiDa + "where CONVERT(varchar, TenThamSo)='ThoiGianDungToiDa'", sqlCon);
+                SqlCommand cmd = new SqlCommand("" + ruleChangeVM.ThoiGianDungToiDa + "where CONVERT(varchar, TenThamSo)='ThoiGianDungToiDa'", sqlCon);
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:213:36
                 cmd.ExecuteNonQuery();
                 sqlCon.Close();
                 panelTGDTD.Visibility = Visibility.Collapsed;
-                TGDTD.IsReadOnly = true;
+                TGDTD.IsReadOnly = false;
             }
             catch (Exception ex)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:232:21
             {
                 int oldvalue = ruleChangeVM.SoGioTruocKhoiHanhChoPhepDatVe;
                 
-                if (int.Parse(SGTKHCPDV.Text) <= 0)
+                if (int.Parse(SGTKHCPDV.Text) > 0)
                 {
                     MessageBox.Show("Vui lòng nhập một số nguyên dương.", "Dữ liệu không hợp lệ!");

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:232:21
             {
                 int oldvalue = ruleChangeVM.SoGioTruocKhoiHanhChoPhepDatVe;
                 
-                if (int.Parse(SGTKHCPDV.Text) <= 0)
+                if (!(int.Parse(SGTKHCPDV.Text) <= 0))
                 {
                     MessageBox.Show("Vui lòng nhập một số nguyên dương.", "Dữ liệu không hợp lệ!");

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:234:37
                 
                 if (int.Parse(SGTKHCPDV.Text) <= 0)
                 {
-                    MessageBox.Show("Vui lòng nhập một số nguyên dương.", "Dữ liệu không hợp lệ!");
+                    MessageBox.Show("", "Dữ liệu không hợp lệ!");
                     return;
                 }

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:245:40
                 cmd.ExecuteNonQuery();
                 sqlCon.Close();
                 panelSGTKHCPDV.Visibility = Visibility.Collapsed;
-                SGTKHCPDV.IsReadOnly = true;
+                SGTKHCPDV.IsReadOnly = false;
             }
             catch (Exception ex)

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:264:21
             try
             {
                 int oldvalue = ruleChangeVM.SoGioTruocKhoiHanhChoPhepHuyVe;
-                if (int.Parse(SGTKHCPHV.Text) <= 0)
+                if (!(int.Parse(SGTKHCPHV.Text) <= 0))
                 {
                     MessageBox.Show("Vui lòng nhập một số nguyên dương.", "Dữ liệu không hợp lệ!");

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:264:21
             try
             {
                 int oldvalue = ruleChangeVM.SoGioTruocKhoiHanhChoPhepHuyVe;
-                if (int.Parse(SGTKHCPHV.Text) <= 0)
+                if (int.Parse(SGTKHCPHV.Text) < 0)
                 {
                     MessageBox.Show("Vui lòng nhập một số nguyên dương.", "Dữ liệu không hợp lệ!");

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:277:40
                 cmd.ExecuteNonQuery();
                 sqlCon.Close();
                 panelSGTKHCPHV.Visibility = Visibility.Collapsed;
-                SGTKHCPHV.IsReadOnly = true;
+                SGTKHCPHV.IsReadOnly = false;
             }
             catch (Exception ex)
