[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:43:28
         }
         public void loadDatatoTable()
         {
-            string query = "SELECT * FROM SANBAY";
+            string query = "";
             SqlParameter param1 = new SqlParameter("", "");
             using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text, param1))

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:44:56
         public void loadDatatoTable()
         {
             string query = "SELECT * FROM SANBAY";
-            SqlParameter param1 = new SqlParameter("", "");
+            SqlParameter param1 = new SqlParameter("", "Stryker was here!");
             using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text, param1))
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:62:17
                 sb.maSB = dr["MaSanBay"].ToString();
                 sb.tenSB = dr["TenSanBay"].ToString();
                 sb.tinh = dr["Tinh"].ToString();
-                SBTable.Items.Add(sb);
+                ;
                 stt++;
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:63:17
                 sb.tenSB = dr["TenSanBay"].ToString();
                 sb.tinh = dr["Tinh"].ToString();
                 SBTable.Items.Add(sb);
-                stt++;
+                ;
             }
         }

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:63:17
                 sb.tenSB = dr["TenSanBay"].ToString();
                 sb.tinh = dr["Tinh"].ToString();
                 SBTable.Items.Add(sb);
-                stt++;
+                stt--;
             }
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:79:13
         private void Them_Click(object sender, RoutedEventArgs e)
         {
             addSB = new AddSanBay(SBTable, 0);
-            addSB.Show();
+            ;
         }
         // DataRowView dataRow;

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:85:17
         private void Xoa_Click(object sender, RoutedEventArgs e)
         {
             sanbayclass info = SBTable.SelectedItem as sanbayclass;
-            if (info != null)
+            if (info == null)
             {
                 int kt = 0;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:88:32
             if (info != null)
             {
                 int kt = 0;
-                string query = "SELECT * From CHUYENBAY where SanBayDi = @sbdi";
+                string query = "";
                 SqlParameter param1 = new SqlParameter("@sbdi", info.maSB);
                 using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text, param1))

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:94:25
                 {
                     if (reader.HasRows)
                     {
-                        kt += 1;
+                        kt -= 1;
 
                     }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:98:33
 
                     }
                 }
-                string query1 = "SELECT * From CHUYENBAY where SanBayDen = @sbden";
+                string query1 = "";
                 SqlParameter param2 = new SqlParameter("@sbden", info.maSB);
                 using (SqlDataReader reader = DataProvider.ExecuteReader(query1, CommandType.Text, param2))

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:108:21
 
                     }
                 }
-                if (kt == 0)
+                if (kt != 0)
                 {
                     SqlConnection con = DataProvider.sqlConnection;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:119:21
                     cmd.CommandType = CommandType.Text;
                     cmd.ExecuteReader();
                     con.Close();
-                    SBTable.Items.Clear();
+                    ;
                     loadDatatoTable();
                     MessageBox.Show("Xóa sân bay thành công ", "Thông báo");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:120:21
                     cmd.ExecuteReader();
                     con.Close();
                     SBTable.Items.Clear();
-                    loadDatatoTable();
+                    ;
                     MessageBox.Show("Xóa sân bay thành công ", "Thông báo");
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:121:21
                     con.Close();
                     SBTable.Items.Clear();
                     loadDatatoTable();
-                    MessageBox.Show("Xóa sân bay thành công ", "Thông báo");
+                    ;
                 }
                 else

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:121:64
                     con.Close();
                     SBTable.Items.Clear();
                     loadDatatoTable();
-                    MessageBox.Show("Xóa sân bay thành công ", "Thông báo");
+                    MessageBox.Show("Xóa sân bay thành công ", "");
                 }
                 else

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:125:21
                 }
                 else
                 {
-                    MessageBox.Show("Sân bay này không thể xóa", "Thông báo");
+                    ;
                 }
             }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:139:17
         private void Sua_Click(object sender, RoutedEventArgs e)
         {
             sanbaytofix = SBTable.SelectedItem as sanbayclass;
-            if (sanbaytofix != null)
+            if (sanbaytofix == null)
             {
                 addSB = new AddSanBay(SBTable, 1);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:142:17
             if (sanbaytofix != null)
             {
                 addSB = new AddSanBay(SBTable, 1);
-                addSB.Show();
+                ;
             }
             else

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:146:33
             }
             else
             {
-                MessageBox.Show("Vui lòng chọn dòng bạn muốn sửa");
+                MessageBox.Show("");
             }
 

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:160:17
             //q.Cbaydetail.Visibility = Visibility.Hidden;
             sanbayclass info = SBTable.SelectedItem as sanbayclass;
             // qLCB_SB = new QLCB_SB(info.maSB,info.tenSB);
-            if (info != null)
+            if (info == null)
             {
                 q.masanbayTxb.Text = info.maSB;

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:161:13
             sanbayclass info = SBTable.SelectedItem as sanbayclass;
             // qLCB_SB = new QLCB_SB(info.maSB,info.tenSB);
             if (info != null)
-            {
-                q.masanbayTxb.Text = info.maSB;
-                q.tensanbayTxb.Text = info.tenSB;
-                q.tinhTxb.Text = info.tinh;
-            }
+            {}
         }
     }
