[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:48:13
         DataTable dt;
         private void loadData()
         {
-            YearRevenueTable.Items.Clear();
+            ;
             //string query =
             //    "SELECT SUBSTRING(C.NgayKhoiHanh, 4, 2) AS Thang, " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:61:28
             //    "GROUP BY SUBSTRING(C.NgayKhoiHanh, 4, 2), C.NgayKhoiHanh " +
             //    "ORDER BY SUBSTRING(C.NgayKhoiHanh, 4, 2) ASC";
 
-            string query = "WITH AllMonths AS (" +
+            string query = "" +
                 "SELECT '01' AS MonthNumber UNION ALL SELECT '02' UNION ALL SELECT '03' UNION ALL SELECT '04' UNION ALL " +
                 "SELECT '05' UNION ALL SELECT '06' UNION ALL SELECT '07' UNION ALL SELECT '08' UNION ALL " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:64:17
             string query = "WITH AllMonths AS (" +
                 "SELECT '01' AS MonthNumber UNION ALL SELECT '02' UNION ALL SELECT '03' UNION ALL SELECT '04' UNION ALL " +
                 "SELECT '05' UNION ALL SELECT '06' UNION ALL SELECT '07' UNION ALL SELECT '08' UNION ALL " +
-                "SELECT '09' UNION ALL SELECT '10' UNION ALL SELECT '11' UNION ALL SELECT '12'" +
+                "" +
                 ")" +
                 "SELECT AllMonths.MonthNumber AS Thang, " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:68:17
                 ")" +
                 "SELECT AllMonths.MonthNumber AS Thang, " +
                 "COUNT(DISTINCT C.MaChuyenBay) AS SoChuyenBay, " +
-                "COALESCE(SUM(V.GiaVe), 0) AS DoanhThu, " +
+                "" +
                 "CASE WHEN SUM(V.GiaVe) > 0 THEN " +
                 "   (SUM(CAST(V.GiaVe AS decimal(18, 2))) * 100) / " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:70:17
                 "COUNT(DISTINCT C.MaChuyenBay) AS SoChuyenBay, " +
                 "COALESCE(SUM(V.GiaVe), 0) AS DoanhThu, " +
                 "CASE WHEN SUM(V.GiaVe) > 0 THEN " +
-                "   (SUM(CAST(V.GiaVe AS decimal(18, 2))) * 100) / " +
+                "" +
                 "       (SELECT SUM(V1.GiaVe) " +
                 "       FROM VE V1 " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:75:17
                 "       FROM VE V1 " +
                 "       JOIN CHUYENBAY C1 ON V1.MaChuyenBay = C1.MaChuyenBay " +
                 "       WHERE SUBSTRING(C1.NgayKhoiHanh, 7, 4) = @Year " +
-                "           AND V1.TinhTrang = 'SOLD') " +
+                "" +
                 "ELSE 0 END AS TyLe " +
                 "FROM AllMonths " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:76:17
                 "       JOIN CHUYENBAY C1 ON V1.MaChuyenBay = C1.MaChuyenBay " +
                 "       WHERE SUBSTRING(C1.NgayKhoiHanh, 7, 4) = @Year " +
                 "           AND V1.TinhTrang = 'SOLD') " +
-                "ELSE 0 END AS TyLe " +
+                "" +
                 "FROM AllMonths " +
                 "LEFT JOIN CHUYENBAY C ON AllMonths.MonthNumber = SUBSTRING(C.NgayKhoiHanh, 4, 2) " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:77:17
                 "       WHERE SUBSTRING(C1.NgayKhoiHanh, 7, 4) = @Year " +
                 "           AND V1.TinhTrang = 'SOLD') " +
                 "ELSE 0 END AS TyLe " +
-                "FROM AllMonths " +
+                "" +
                 "LEFT JOIN CHUYENBAY C ON AllMonths.MonthNumber = SUBSTRING(C.NgayKhoiHanh, 4, 2) " +
                 "AND SUBSTRING(C.NgayKhoiHanh, 7, 4) = @Year " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:81:17
                 "LEFT JOIN CHUYENBAY C ON AllMonths.MonthNumber = SUBSTRING(C.NgayKhoiHanh, 4, 2) " +
                 "AND SUBSTRING(C.NgayKhoiHanh, 7, 4) = @Year " +
                 "LEFT JOIN VE V ON C.MaChuyenBay = V.MaChuyenBay " +
-                "AND V.TinhTrang = 'SOLD' " +
+                "" +
                 "GROUP BY AllMonths.MonthNumber " +
                 "ORDER BY AllMonths.MonthNumber ASC";

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:106:21
                     ys.sochuyenbay = dr[1].ToString();
                     ys.doanhthu = dr[2].ToString();
                     ys.tile = dr[3].ToString();
-                    YearRevenueTable.Items.Add(ys);
+                    ;
                     sum += dr.Field<int>(2);
                 }

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:107:21
                     ys.doanhthu = dr[2].ToString();
                     ys.tile = dr[3].ToString();
                     YearRevenueTable.Items.Add(ys);
-                    sum += dr.Field<int>(2);
+                    sum -= dr.Field<int>(2);
                 }
                 tb_total.Text = sum.ToString();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:116:13
 
         private void cbox_selectionChanged(object sender, SelectionChangedEventArgs e)
         {
-            loadData();
+            ;
         }
         private void Excel_Click(object sender, RoutedEventArgs e)
