[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/ViewModel/RuleChangeVM.cs:20:17
         private int _soGioTruocKhoiHanhChoPhepHuyVe;
         public int ThoiGianBayToiThieu
         {
-            get { return _thoiGianBayToiThieu; }
+            get {}
             set
             {

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/ViewModel/RuleChangeVM.cs:23:21
             get { return _thoiGianBayToiThieu; }
             set
             {
-                if (_thoiGianBayToiThieu != value)
+                if (_thoiGianBayToiThieu == value)
                 {
                     _thoiGianBayToiThieu = value;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/ViewModel/RuleChangeVM.cs:26:21
                 if (_thoiGianBayToiThieu != value)
                 {
                     _thoiGianBayToiThieu = value;
-                    OnPropertyChanged("ThoiGianBayToiThieu");
+                    ;
                 }
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/ViewModel/RuleChangeVM.cs:26:39
                 if (_thoiGianBayToiThieu != value)
                 {
                     _thoiGianBayToiThieu = value;
-                    OnPropertyChanged("ThoiGianBayToiThieu");
+                    OnPropertyChanged("");
                 }
             }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/ViewModel/RuleChangeVM.cs:32:17
         }
         public int SoSanBayTrungGianToiDa
         {
-            get { return _soSanBayTrungGianToiDa; }
+            get {}
             set
             {

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/ViewModel/RuleChangeVM.cs:35:21
             get { return _soSanBayTrungGianToiDa; }
             set
             {
-                if (_soSanBayTrungGianToiDa != value)
+                if (_soSanBayTrungGianToiDa == value)
                 {
                     _soSanBayTrungGianToiDa = value;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/ViewModel/RuleChangeVM.cs:38:21
                 if (_soSanBayTrungGianToiDa != value)
                 {
                     _soSanBayTrungGianToiDa = value;
-                    OnPropertyChanged("SoSanBayTrungGianToiDa");
+                    ;
                 }
             }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/ViewModel/RuleChangeVM.cs:44:17
         }
         public int ThoiGianDungToiThieu
         {
-            get { return _thoiGianDungToiThieu; }
+            get {}
             set
             {

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/ViewModel/RuleChangeVM.cs:47:21
             get { return _thoiGianDungToiThieu; }
             set
             {
-                if (_thoiGianDungToiThieu != value)
+                if (_thoiGianDungToiThieu == value)
                 {
                     _thoiGianDungToiThieu = value;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/ViewModel/RuleChangeVM.cs:50:21
                 if (_thoiGianDungToiThieu != value)
                 {
                     _thoiGianDungToiThieu = value;
-                    OnPropertyChanged("ThoiGianDungToiThieu");
+                    ;
                 }
             }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/ViewModel/RuleChangeVM.cs:56:17
         }
         public int ThoiGianDungToiDa
         {
-            get { return _thoiGianDungToiDa; }
+            get {}
             set
             {

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/ViewModel/RuleChangeVM.cs:59:21
             get { return _thoiGianDungToiDa; }
             set
             {
-                if (_thoiGianDungToiDa != value)
+                if (_thoiGianDungToiDa == value)
                 {
                     _thoiGianDungToiDa = value;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/ViewModel/RuleChangeVM.cs:62:21
                 if (_thoiGianDungToiDa != value)
                 {
                     _thoiGianDungToiDa = value;
-                    OnPropertyChanged("ThoiGianDungToiDa");
+                    ;
                 }
             }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/ViewModel/RuleChangeVM.cs:68:17
         }
         public int SoGioTruocKhoiHanhChoPhepHuyVe
         {
-            get { return _soGioTruocKhoiHanhChoPhepHuyVe; }
+            get {}
             set
             {

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/ViewModel/RuleChangeVM.cs:71:21
             get { return _soGioTruocKhoiHanhChoPhepHuyVe; }
             set
             {
-                if (_soGioTruocKhoiHanhChoPhepHuyVe != value)
+                if (_soGioTruocKhoiHanhChoPhepHuyVe == value)
                 {
                     _soGioTruocKhoiHanhChoPhepHuyVe = value;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/ViewModel/RuleChangeVM.cs:74:21
                 if (_soGioTruocKhoiHanhChoPhepHuyVe != value)
                 {
                     _soGioTruocKhoiHanhChoPhepHuyVe = value;
-                    OnPropertyChanged("SoGioTruocKhoiHanhChoPhepHuyVe");
+                    ;
                 }
             }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/ViewModel/RuleChangeVM.cs:80:17
         }
         public int SoGioTruocKhoiHanhChoPhepDatVe
         {
-            get { return _soGioTruocKhoiHanhChoPhepDatVe; }
+            get {}
             set
             {

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/ViewModel/RuleChangeVM.cs:83:21
             get { return _soGioTruocKhoiHanhChoPhepDatVe; }
             set
             {
-                if (_soGioTruocKhoiHanhChoPhepDatVe != value)
+                if (_soGioTruocKhoiHanhChoPhepDatVe == value)
                 {
                     _soGioTruocKhoiHanhChoPhepDatVe = value;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/ViewModel/RuleChangeVM.cs:86:21
                 if (_soGioTruocKhoiHanhChoPhepDatVe != value)
                 {
                     _soGioTruocKhoiHanhChoPhepDatVe = value;
-                    OnPropertyChanged("SoGioTruocKhoiHanhChoPhepDatVe");
+                    ;
                 }
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/ViewModel/RuleChangeVM.cs:86:39
                 if (_soGioTruocKhoiHanhChoPhepDatVe != value)
                 {
                     _soGioTruocKhoiHanhChoPhepDatVe = value;
-                    OnPropertyChanged("SoGioTruocKhoiHanhChoPhepDatVe");
+                    OnPropertyChanged("");
                 }
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/ViewModel/RuleChangeVM.cs:96:13
 
         protected void OnPropertyChanged(string propertyName)
         {
-            PropertyChanged?.Invoke(this, new PropertyChangedEventArgs(propertyName));
+            ;
         }
     }
