[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:42:26
         int thaotac;
         List<QLHangVeClass> qLHangVeClass;
         List<QLHangVeClass> qLHangVeClassexist;
-        Boolean isSave = false;
+        Boolean isSave = true;
         public AddChuyenbay(DataGrid chuyenbayTable, int thaotac)
         {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:51:13
             qLHangVeClass = new List<QLHangVeClass>();
             qLHangVeClassexist = new List<QLHangVeClass>();
 
-            loaimaybaycb.Items.Add("BOEING");
+            ;
             loaimaybaycb.Items.Add("Airbus A321-200");
             loaimaybaycb.Items.Add("ATR 72");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:52:13
             qLHangVeClassexist = new List<QLHangVeClass>();
 
             loaimaybaycb.Items.Add("BOEING");
-            loaimaybaycb.Items.Add("Airbus A321-200");
+            ;
             loaimaybaycb.Items.Add("ATR 72");
             loaimaybaycb.Items.Add("Airbus A330-200");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:53:13
 
             loaimaybaycb.Items.Add("BOEING");
             loaimaybaycb.Items.Add("Airbus A321-200");
-            loaimaybaycb.Items.Add("ATR 72");
+            ;
             loaimaybaycb.Items.Add("Airbus A330-200");
             loaimaybaycb.Items.Add("Airbus A350-900 XWB");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:54:13
             loaimaybaycb.Items.Add("BOEING");
             loaimaybaycb.Items.Add("Airbus A321-200");
             loaimaybaycb.Items.Add("ATR 72");
-            loaimaybaycb.Items.Add("Airbus A330-200");
+            ;
             loaimaybaycb.Items.Add("Airbus A350-900 XWB");
             string query = "SELECT * FROM SANBAY";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:54:36
             loaimaybaycb.Items.Add("BOEING");
             loaimaybaycb.Items.Add("Airbus A321-200");
             loaimaybaycb.Items.Add("ATR 72");
-            loaimaybaycb.Items.Add("Airbus A330-200");
+            loaimaybaycb.Items.Add("");
             loaimaybaycb.Items.Add("Airbus A350-900 XWB");
             string query = "SELECT * FROM SANBAY";

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:55:13
             loaimaybaycb.Items.Add("Airbus A321-200");
             loaimaybaycb.Items.Add("ATR 72");
             loaimaybaycb.Items.Add("Airbus A330-200");
-            loaimaybaycb.Items.Add("Airbus A350-900 XWB");
+            ;
             string query = "SELECT * FROM SANBAY";
             SqlParameter param1 = new SqlParameter("", "");

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:55:36
             loaimaybaycb.Items.Add("Airbus A321-200");
             loaimaybaycb.Items.Add("ATR 72");
             loaimaybaycb.Items.Add("Airbus A330-200");
-            loaimaybaycb.Items.Add("Airbus A350-900 XWB");
+            loaimaybaycb.Items.Add("");
             string query = "SELECT * FROM SANBAY";
             SqlParameter param1 = new SqlParameter("", "");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:69:17
             }
             foreach (DataRow dr in dt.Rows)
             {
-                FromcBox.Items.Add(dr["TenSanBay"].ToString());
+                ;
                 TocBox.Items.Add(dr["TenSanBay"].ToString());
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:70:17
             foreach (DataRow dr in dt.Rows)
             {
                 FromcBox.Items.Add(dr["TenSanBay"].ToString());
-                TocBox.Items.Add(dr["TenSanBay"].ToString());
+                ;
             }
             FromcBox.SelectedIndex = 0;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:74:21
             }
             FromcBox.SelectedIndex = 0;
             TocBox.SelectedIndex = 0;
-            query = "SELECT * FROM HANGMAYBAY";
+            query = "";
             param1 = new SqlParameter("", "");
             using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text, param1))

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:75:43
             FromcBox.SelectedIndex = 0;
             TocBox.SelectedIndex = 0;
             query = "SELECT * FROM HANGMAYBAY";
-            param1 = new SqlParameter("", "");
+            param1 = new SqlParameter("", "Stryker was here!");
             using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text, param1))
             {

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:75:39
             FromcBox.SelectedIndex = 0;
             TocBox.SelectedIndex = 0;
             query = "SELECT * FROM HANGMAYBAY";
-            param1 = new SqlParameter("", "");
+            param1 = new SqlParameter("Stryker was here!", "");
             using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text, param1))
             {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:86:17
             }
             foreach (DataRow dr in dt.Rows)
             {
-                MaHcBox.Items.Add(dr["TenHang"].ToString());
+                ;
             }
             if (thaotac == 0)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:88:17
             {
                 MaHcBox.Items.Add(dr["TenHang"].ToString());
             }
-            if (thaotac == 0)
+            if (thaotac != 0)
             {
                 QLHangVeClass hv = new QLHangVeClass();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:91:17
             if (thaotac == 0)
             {
                 QLHangVeClass hv = new QLHangVeClass();
-                qLHangVeClass.Add(hv);
+                ;
                 HangVeList.Items.Add(hv);
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:92:17
             {
                 QLHangVeClass hv = new QLHangVeClass();
                 qLHangVeClass.Add(hv);
-                HangVeList.Items.Add(hv);
+                ;
             }
 

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:95:17
                 HangVeList.Items.Add(hv);
             }
 
-            if (thaotac == 1)
+            if (thaotac != 1)
             {
                 headertxt.Text = "Sửa chuyến bay";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:97:34
 
             if (thaotac == 1)
             {
-                headertxt.Text = "Sửa chuyến bay";
+                headertxt.Text = "";
                 query = "SELECT * FROM CHUYENBAY where MaChuyenBay = @macb";
                 param1 = new SqlParameter("@macb", Chuyenbay.chuyenbaytofix.maCB);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:131:17
                 //    SBTGTable.Items.Add(sb);
                 //    stt2++;
                 //}
-                loadDatatoSBTG(Chuyenbay.chuyenbaytofix.maCB);
+                ;
                 int stt = 1;
                 foreach (DataRow dr in dt.Rows)

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:141:33
                     int ngay = int.Parse(thoigian[0]);
                     Ngaypicker.SelectedDate = new DateTime(nam, thang, ngay);
                     gioTxb.Text = dr["ThoiGianXuatPhat"].ToString();
-                    string s1 = "SELECT * From HANGMAYBAY WHERE MaHang = @ma";
+                    string s1 = "";
                     SqlParameter p1 = new SqlParameter("@ma", dr["MaHangMayBay"].ToString());
                     using (SqlDataReader reader = DataProvider.ExecuteReader(s1, CommandType.Text, p1))

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:142:66
                     Ngaypicker.SelectedDate = new DateTime(nam, thang, ngay);
                     gioTxb.Text = dr["ThoiGianXuatPhat"].ToString();
                     string s1 = "SELECT * From HANGMAYBAY WHERE MaHang = @ma";
-                    SqlParameter p1 = new SqlParameter("@ma", dr["MaHangMayBay"].ToString());
+                    SqlParameter p1 = new SqlParameter("@ma", dr[""].ToString());
                     using (SqlDataReader reader = DataProvider.ExecuteReader(s1, CommandType.Text, p1))
                     {

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:151:44
                         }
                     }
                     // MaHcBox.SelectedItem = dr["MaHangMayBay"].ToString();
-                    loaimaybaycb.Text = dr["LoaiMayBay"].ToString();
+                    loaimaybaycb.Text = dr[""].ToString();
                 }
                 machuyenbayTxb.Text = Chuyenbay.chuyenbaytofix.maCB;

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:154:44
                     loaimaybaycb.Text = dr["LoaiMayBay"].ToString();
                 }
                 machuyenbayTxb.Text = Chuyenbay.chuyenbaytofix.maCB;
-                machuyenbayTxb.IsEnabled = false;
+                machuyenbayTxb.IsEnabled = true;
 
                 string s = "SELECT * From SANBAY WHERE MaSanBay = @ma";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:157:51
                 machuyenbayTxb.IsEnabled = false;
 
                 string s = "SELECT * From SANBAY WHERE MaSanBay = @ma";
-                SqlParameter p = new SqlParameter("@ma", Chuyenbay.chuyenbaytofix.SBdi);
+                SqlParameter p = new SqlParameter("", Chuyenbay.chuyenbaytofix.SBdi);
                 using (SqlDataReader reader = DataProvider.ExecuteReader(s, CommandType.Text, p))
                 {

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:162:76
                 {
                     if (reader.Read())
                     {
-                        FromcBox.Text = reader.GetString(reader.GetOrdinal("TenSanBay"));
+                        FromcBox.Text = reader.GetString(reader.GetOrdinal(""));
                     }
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:166:21
                     }
                 }
                 // FromcBox.Text = Chuyenbay.chuyenbaytofix.SBdi;
-                s = "SELECT * From SANBAY WHERE MaSanBay = @ma";
+                s = "";
                 p = new SqlParameter("@ma", Chuyenbay.chuyenbaytofix.SBden);
                 using (SqlDataReader reader = DataProvider.ExecuteReader(s, CommandType.Text, p))

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:167:38
                 }
                 // FromcBox.Text = Chuyenbay.chuyenbaytofix.SBdi;
                 s = "SELECT * From SANBAY WHERE MaSanBay = @ma";
-                p = new SqlParameter("@ma", Chuyenbay.chuyenbaytofix.SBden);
+                p = new SqlParameter("", Chuyenbay.chuyenbaytofix.SBden);
                 using (SqlDataReader reader = DataProvider.ExecuteReader(s, CommandType.Text, p))
                 {

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:185:25
                 using (SqlDataReader reader = DataProvider.ExecuteReader(query1, CommandType.Text, param2))
                 {
                     dt2 = new DataTable();
-                    if (reader.HasRows)
+                    if (!(reader.HasRows))
                     {
                         dt2.Load(reader);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:187:25
                     dt2 = new DataTable();
                     if (reader.HasRows)
                     {
-                        dt2.Load(reader);
+                        ;
                     }
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:199:78
                     {
                         if (reader.Read())
                         {
-                            HV.Mahangve = reader.GetString(reader.GetOrdinal("TenHangVe"));
+                            HV.Mahangve = reader.GetString(reader.GetOrdinal(""));
                         }
                     }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:203:41
                         }
                     }
                     // HV.Mahangve = dr["TenHangVe"].ToString();
-                    HV.Machuyenbay = dr["MaChuyenBay"].ToString();
+                    HV.Machuyenbay = dr[""].ToString();
                     HV.Soluong = dr["SoLuong"].ToString();
                     // qLHangVeClass.Add(HV);

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:204:37
                     }
                     // HV.Mahangve = dr["TenHangVe"].ToString();
                     HV.Machuyenbay = dr["MaChuyenBay"].ToString();
-                    HV.Soluong = dr["SoLuong"].ToString();
+                    HV.Soluong = dr[""].ToString();
                     // qLHangVeClass.Add(HV);
                     qLHangVeClassexist.Add(HV);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:206:21
                     HV.Machuyenbay = dr["MaChuyenBay"].ToString();
                     HV.Soluong = dr["SoLuong"].ToString();
                     // qLHangVeClass.Add(HV);
-                    qLHangVeClassexist.Add(HV);
+                    ;
                     HangVeList.Items.Add(HV);
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:207:21
                     HV.Soluong = dr["SoLuong"].ToString();
                     // qLHangVeClass.Add(HV);
                     qLHangVeClassexist.Add(HV);
-                    HangVeList.Items.Add(HV);
+                    ;
                 }
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:216:13
 
         private void BtnClose_Click(object sender, RoutedEventArgs e)
         {
-            this.Close();
+            ;
         }
         AddSBTG addSBTG;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:222:24
         private void AddSBTG_Click(object sender, RoutedEventArgs e)
         {
             int SoSanBayTGtoida = 0;
-            string q = "SELECT * FROM BANGTHAMSO";
+            string q = "";
             DataTable d;
             using (SqlDataReader reader = DataProvider.ExecuteReader(q, CommandType.Text))

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:227:21
             using (SqlDataReader reader = DataProvider.ExecuteReader(q, CommandType.Text))
             {
                 d = new DataTable();
-                if (reader.HasRows)
+                if (!(reader.HasRows))
                 {
                     d.Load(reader);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:229:21
                 d = new DataTable();
                 if (reader.HasRows)
                 {
-                    d.Load(reader);
+                    ;
                     DataRow dr = d.Rows[1];
                     SoSanBayTGtoida = dr.Field<int>(1);

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:235:17
                 }
             }
             int rowCount = SBTGTable.Items.Count;
-            if (rowCount < SoSanBayTGtoida)
+            if (rowCount <= SoSanBayTGtoida)
             {
                 if (isSave == true)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:235:17
                 }
             }
             int rowCount = SBTGTable.Items.Count;
-            if (rowCount < SoSanBayTGtoida)
+            if (rowCount > SoSanBayTGtoida)
             {
                 if (isSave == true)

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:237:31
             int rowCount = SBTGTable.Items.Count;
             if (rowCount < SoSanBayTGtoida)
             {
-                if (isSave == true)
+                if (isSave == false)
                 {
                     addSBTG = new AddSBTG(SBTGTable, machuyenbayTxb.Text, 0);

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:237:21
             int rowCount = SBTGTable.Items.Count;
             if (rowCount < SoSanBayTGtoida)
             {
-                if (isSave == true)
+                if (isSave != true)
                 {
                     addSBTG = new AddSBTG(SBTGTable, machuyenbayTxb.Text, 0);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:240:21
                 if (isSave == true)
                 {
                     addSBTG = new AddSBTG(SBTGTable, machuyenbayTxb.Text, 0);
-                    addSBTG.Show();
+                    ;
                 }
                 else

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:244:21
                 }
                 else
                 {
-                    MessageBox.Show("Vui lòng lưu thông tin chuyến bay trước. ", "Thông báo!");
+                    ;
                 }
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:250:17
             }
             else
             {
-                MessageBox.Show("Số sân bay trung gian đã đạt đến giới hạn quy định. ", "Thông báo!");
+                ;
             }
         }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:250:33
             }
             else
             {
-                MessageBox.Show("Số sân bay trung gian đã đạt đến giới hạn quy định. ", "Thông báo!");
+                MessageBox.Show("", "Thông báo!");
             }
         }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:274:51
                 SanbayTG sb = new SanbayTG();
                 sb.STT = stt.ToString();
                 string s = "SELECT * From SANBAY WHERE MaSanBay = @ma";
-                SqlParameter p = new SqlParameter("@ma", dr["SanBayTrungGian"].ToString());
+                SqlParameter p = new SqlParameter("", dr["SanBayTrungGian"].ToString());
                 using (SqlDataReader reader = DataProvider.ExecuteReader(s, CommandType.Text, p))
                 {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:285:17
                 // sb.tenSB = dr["SanBayTrungGian"].ToString();
                 sb.TGdung = dr["ThoiGianDung"].ToString();
                 sb.ghichu = dr["GhiChu"].ToString();
-                SBTGTable.Items.Add(sb);
+                ;
                 stt++;
             }

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:286:17
                 sb.TGdung = dr["ThoiGianDung"].ToString();
                 sb.ghichu = dr["GhiChu"].ToString();
                 SBTGTable.Items.Add(sb);
-                stt++;
+                stt--;
             }
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:286:17
                 sb.TGdung = dr["ThoiGianDung"].ToString();
                 sb.ghichu = dr["GhiChu"].ToString();
                 SBTGTable.Items.Add(sb);
-                stt++;
+                ;
             }
         }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:294:17
         {
             int rowCount = 0;
             SqlConnection sqlCon = DataProvider.sqlConnection;
-            if (sqlCon.State == ConnectionState.Closed)
+            if (sqlCon.State != ConnectionState.Closed)
             {
                 sqlCon.Open();

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:300:13
             }
             String query = "SELECT COUNT(*) FROM HANGVE";
             using (SqlCommand sqlCmd = new SqlCommand(query, sqlCon))
-            {
-                rowCount = (int)sqlCmd.ExecuteScalar();
-            }
+            {}
 
 

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:305:17
             }
 
 
-            if (HangVeList.Items.Count < rowCount)
+            if (HangVeList.Items.Count > rowCount)
             {
                 QLHangVeClass hv = new QLHangVeClass();

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:305:17
             }
 
 
-            if (HangVeList.Items.Count < rowCount)
+            if (!(HangVeList.Items.Count < rowCount))
             {
                 QLHangVeClass hv = new QLHangVeClass();

[NoCoverage] Logical mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:320:17
         {
             QLHangVeClass hv = (sender as Button).DataContext as QLHangVeClass;
 
-            if (thaotac == 1 && hv.Mahangve != null)
+            if (thaotac == 1 || hv.Mahangve != null)
             {
                 string query = "SELECT * From VE where MaChuyenBay = @ma and MaHangVe = @mah";

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:320:17
         {
             QLHangVeClass hv = (sender as Button).DataContext as QLHangVeClass;
 
-            if (thaotac == 1 && hv.Mahangve != null)
+            if (thaotac != 1 && hv.Mahangve != null)
             {
                 string query = "SELECT * From VE where MaChuyenBay = @ma and MaHangVe = @mah";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:322:32
 
             if (thaotac == 1 && hv.Mahangve != null)
             {
-                string query = "SELECT * From VE where MaChuyenBay = @ma and MaHangVe = @mah";
+                string query = "";
                 SqlParameter param1 = new SqlParameter("@ma", machuyenbayTxb.Text);
                 SqlParameter param2 = new SqlParameter("@mah", hv.Mahangve);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:329:25
                 {
                     if (reader.HasRows)
                     {
-                        MessageBox.Show("Không thể xóa hạng vé này.", "Thông báo");
+                        ;
                         return;
 

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:329:71
                 {
                     if (reader.HasRows)
                     {
-                        MessageBox.Show("Không thể xóa hạng vé này.", "Thông báo");
+                        MessageBox.Show("Không thể xóa hạng vé này.", "");
                         return;
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:330:25
                     if (reader.HasRows)
                     {
                         MessageBox.Show("Không thể xóa hạng vé này.", "Thông báo");
-                        return;
+                        ;
 
                     }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:338:17
             }
             else
             {
-                HangVeList.Items.Remove(hv);
+                ;
                 qLHangVeClass.Remove(hv);
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:339:17
             else
             {
                 HangVeList.Items.Remove(hv);
-                qLHangVeClass.Remove(hv);
+                ;
             }
 

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:347:17
         private void SuaSBTG_Click(object sender, RoutedEventArgs e)
         {
             infotofix = SBTGTable.SelectedItem as SanbayTG;
-            if (infotofix != null)
+            if (infotofix == null)
             {
                 addSBTG = new AddSBTG(SBTGTable, machuyenbayTxb.Text, 1);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:350:17
             if (infotofix != null)
             {
                 addSBTG = new AddSBTG(SBTGTable, machuyenbayTxb.Text, 1);
-                addSBTG.Show();
+                ;
             }
             else

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:362:17
         private void XoaSBTG_Click(object sender, RoutedEventArgs e)
         {
             SanbayTG info = SBTGTable.SelectedItem as SanbayTG;
-            if (info != null)
+            if (info == null)
             {
                 string MA = "";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:379:158
                 {
                     con.Open();
                 }
-                SqlCommand cmd = new SqlCommand("Delete from SANBAYTRUNGGIAN where SanBayTrungGian=N'" + MA + "' and MaChuyenBay=N'" + machuyenbayTxb.Text + "'", con);
+                SqlCommand cmd = new SqlCommand("Delete from SANBAYTRUNGGIAN where SanBayTrungGian=N'" + MA + "' and MaChuyenBay=N'" + machuyenbayTxb.Text + "", con);
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteReader();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:383:17
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteReader();
                 con.Close();
-                SBTGTable.Items.Clear();
+                ;
                 loadDatatoSBTG(machuyenbayTxb.Text);
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:384:17
                 cmd.ExecuteReader();
                 con.Close();
                 SBTGTable.Items.Clear();
-                loadDatatoSBTG(machuyenbayTxb.Text);
+                ;
             }
             else

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:394:56
         public void loadDatatoTable()
         {
             string query = "SELECT * FROM CHUYENBAY";
-            SqlParameter param1 = new SqlParameter("", "");
+            SqlParameter param1 = new SqlParameter("", "Stryker was here!");
             DataTable dt;
             using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text, param1))

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:410:30
 
                 chuyenbayclass cb = new chuyenbayclass();
                 cb.STT = stt.ToString();
-                cb.maCB = dr["MaChuyenBay"].ToString();
+                cb.maCB = dr[""].ToString();
                 cb.SBdi = dr["SanBayDi"].ToString();
                 cb.SBden = dr["SanBayDen"].ToString();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:412:31
                 cb.STT = stt.ToString();
                 cb.maCB = dr["MaChuyenBay"].ToString();
                 cb.SBdi = dr["SanBayDi"].ToString();
-                cb.SBden = dr["SanBayDen"].ToString();
+                cb.SBden = dr[""].ToString();
                 cb.datetime = dr["NgayKhoiHanh"].ToString() + "-" + dr["ThoiGianXuatPhat"].ToString();
                 cb.tgBay = dr["ThoiGianDuKien"].ToString();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:413:63
                 cb.maCB = dr["MaChuyenBay"].ToString();
                 cb.SBdi = dr["SanBayDi"].ToString();
                 cb.SBden = dr["SanBayDen"].ToString();
-                cb.datetime = dr["NgayKhoiHanh"].ToString() + "-" + dr["ThoiGianXuatPhat"].ToString();
+                cb.datetime = dr["NgayKhoiHanh"].ToString() + "" + dr["ThoiGianXuatPhat"].ToString();
                 cb.tgBay = dr["ThoiGianDuKien"].ToString();
                 cb.Gia = dr["Gia"].ToString();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:416:17
                 cb.datetime = dr["NgayKhoiHanh"].ToString() + "-" + dr["ThoiGianXuatPhat"].ToString();
                 cb.tgBay = dr["ThoiGianDuKien"].ToString();
                 cb.Gia = dr["Gia"].ToString();
-                chuyenbayTable.Items.Add(cb);
+                ;
                 stt++;
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:417:17
                 cb.tgBay = dr["ThoiGianDuKien"].ToString();
                 cb.Gia = dr["Gia"].ToString();
                 chuyenbayTable.Items.Add(cb);
-                stt++;
+                ;
             }
         }

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:417:17
                 cb.tgBay = dr["ThoiGianDuKien"].ToString();
                 cb.Gia = dr["Gia"].ToString();
                 chuyenbayTable.Items.Add(cb);
-                stt++;
+                stt--;
             }
         }
