[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:422:29
         }
         private void SaveHV_VE()
         {
-            for (int i = 0; i < qLHangVeClass.Count; i++)
+            for (int i = 0; i > qLHangVeClass.Count; i++)
             {
                 string maHV = "";

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:422:29
         }
         private void SaveHV_VE()
         {
-            for (int i = 0; i < qLHangVeClass.Count; i++)
+            for (int i = 0; i <= qLHangVeClass.Count; i++)
             {
                 string maHV = "";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:424:31
         {
             for (int i = 0; i < qLHangVeClass.Count; i++)
             {
-                string maHV = "";
+                string maHV = "Stryker was here!";
                 string s = "SELECT * From HANGVE WHERE TenHangVe = @ten";
                 SqlParameter p = new SqlParameter("@ten", qLHangVeClass[i].Mahangve);

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:441:25
                 using (SqlDataReader reader = DataProvider.ExecuteReader(query1, CommandType.Text, param2))
                 {
                     dt1 = new DataTable();
-                    if (reader.HasRows)
+                    if (!(reader.HasRows))
                     {
                         dt1.Load(reader);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:443:25
                     dt1 = new DataTable();
                     if (reader.HasRows)
                     {
-                        dt1.Load(reader);
+                        ;
                     }
                 }

[NoCoverage] Arithmetic mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:448:39
                 }
                 foreach (DataRow dr in dt1.Rows)
                 {
-                    double phantram = int.Parse(dr["TyLe"].ToString()) / 100.0;
+                    double phantram = int.Parse(dr["TyLe"].ToString()) * 100.0;
                     giave = (int)(int.Parse(Gia) * phantram);
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:448:52
                 }
                 foreach (DataRow dr in dt1.Rows)
                 {
-                    double phantram = int.Parse(dr["TyLe"].ToString()) / 100.0;
+                    double phantram = int.Parse(dr[""].ToString()) / 100.0;
                     giave = (int)(int.Parse(Gia) * phantram);
                 }

[NoCoverage] Arithmetic mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:449:35
                 foreach (DataRow dr in dt1.Rows)
                 {
                     double phantram = int.Parse(dr["TyLe"].ToString()) / 100.0;
-                    giave = (int)(int.Parse(Gia) * phantram);
+                    giave = (int)(int.Parse(Gia) / phantram);
                 }
                 qLHangVeClass[i].Machuyenbay = MaCB;

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:456:25
                 SqlConnection con = DataProvider.sqlConnection;
                 try
                 {
-                    if (con.State == ConnectionState.Closed)
+                    if (con.State != ConnectionState.Closed)
                     {
                         con.Open();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:462:21
                     }
                     SqlCommand cmd1 = new SqlCommand("Insert into [QuanLyHangVeChuyenBay] values('" + MaCB + "', N'" + maHV + "',N'" + qLHangVeClass[i].Soluong + "')", con);
                     cmd1.CommandType = CommandType.Text;
-                    cmd1.ExecuteNonQuery();
+                    ;
                     con.Close();
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:463:21
                     SqlCommand cmd1 = new SqlCommand("Insert into [QuanLyHangVeChuyenBay] values('" + MaCB + "', N'" + maHV + "',N'" + qLHangVeClass[i].Soluong + "')", con);
                     cmd1.CommandType = CommandType.Text;
                     cmd1.ExecuteNonQuery();
-                    con.Close();
+                    ;
 
                     for (int j = 0; j < int.Parse(qLHangVeClass[i].Soluong); j++)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:465:37
                     cmd1.ExecuteNonQuery();
                     con.Close();
 
-                    for (int j = 0; j < int.Parse(qLHangVeClass[i].Soluong); j++)
+                    for (int j = 0; j <= int.Parse(qLHangVeClass[i].Soluong); j++)
                     {
                         string mave = j.ToString() + MaCB + maHV;

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:465:78
                     cmd1.ExecuteNonQuery();
                     con.Close();
 
-                    for (int j = 0; j < int.Parse(qLHangVeClass[i].Soluong); j++)
+                    for (int j = 0; j < int.Parse(qLHangVeClass[i].Soluong); j--)
                     {
                         string mave = j.ToString() + MaCB + maHV;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:479:29
                             }
                             cmd2.CommandType = CommandType.Text;
-                            cmd2.ExecuteNonQuery();
+                            ;
                             con.Close();
                         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:480:29
                             cmd2.CommandType = CommandType.Text;
                             cmd2.ExecuteNonQuery();
-                            con.Close();
+                            ;
                         }
                         catch (Exception ex) { Console.WriteLine(ex); }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:489:129
 
             }
         }
-        public string MaCB = "", Sanbaydi = "", Sanbayden = "", Ngay="", Gio = "", TgBay ="", Gia = "", mahangMB = "", loaiMB = "";
+        public string MaCB = "", Sanbaydi = "", Sanbayden = "", Ngay="", Gio = "", TgBay ="", Gia = "", mahangMB = "", loaiMB = "Stryker was here!";
 
         private void machuyenbayTxb_PreviewTextInput(object sender, TextCompositionEventArgs e)

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:489:30
 
             }
         }
-        public string MaCB = "", Sanbaydi = "", Sanbayden = "", Ngay="", Gio = "", TgBay ="", Gia = "", mahangMB = "", loaiMB = "";
+        public string MaCB = "Stryker was here!", Sanbaydi = "", Sanbayden = "", Ngay="", Gio = "", TgBay ="", Gia = "", mahangMB = "", loaiMB = "";
 
         private void machuyenbayTxb_PreviewTextInput(object sender, TextCompositionEventArgs e)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:496:17
             TextBox textBox = (TextBox)sender;
             string text = textBox.Text + e.Text;
 
-            if (text.Length > 5)
+            if (text.Length < 5)
             {
                 e.Handled = true; // Ngăn người dùng nhập quá giới hạn

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:496:17
             TextBox textBox = (TextBox)sender;
             string text = textBox.Text + e.Text;
 
-            if (text.Length > 5)
+            if (!(text.Length > 5))
             {
                 e.Handled = true; // Ngăn người dùng nhập quá giới hạn

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:498:29
 
             if (text.Length > 5)
             {
-                e.Handled = true; // Ngăn người dùng nhập quá giới hạn
+                e.Handled = false; // Ngăn người dùng nhập quá giới hạn
             }
         }

[Survived] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:502:75
             }
         }
 
-        public static string tenSBdi = "", tenSBden = "", thoigianbayDC = "";
+        public static string tenSBdi = "", tenSBden = "", thoigianbayDC = "Stryker was here!";
         chuyenbayclass cb;
         void SaveCB()

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:507:17
         void SaveCB()
         {
             DateTime? selectedDate = Ngaypicker.SelectedDate;
-            if (selectedDate.HasValue)
+            if (!(selectedDate.HasValue))
             {
                 Ngay = selectedDate.Value.ToString("dd/MM/yyyy", System.Globalization.CultureInfo.InvariantCulture);

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:509:52
             DateTime? selectedDate = Ngaypicker.SelectedDate;
             if (selectedDate.HasValue)
             {
-                Ngay = selectedDate.Value.ToString("dd/MM/yyyy", System.Globalization.CultureInfo.InvariantCulture);
+                Ngay = selectedDate.Value.ToString("", System.Globalization.CultureInfo.InvariantCulture);
             }
             MaCB = machuyenbayTxb.Text;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:512:24
                 Ngay = selectedDate.Value.ToString("dd/MM/yyyy", System.Globalization.CultureInfo.InvariantCulture);
             }
             MaCB = machuyenbayTxb.Text;
-            string s = "SELECT * From SANBAY WHERE TenSanBay = @ten";
+            string s = "";
             SqlParameter p = new SqlParameter("@ten", FromcBox.Text);
             using (SqlDataReader reader = DataProvider.ExecuteReader(s, CommandType.Text, p))

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:537:48
             thoigianbayDC = TGbayTxb.Text;
             Gia = GiaTxb.Text;
             string s1 = "SELECT * From HANGMAYBAY WHERE TenHang = @ten";
-            SqlParameter pa = new SqlParameter("@ten", MaHcBox.Text);
+            SqlParameter pa = new SqlParameter("", MaHcBox.Text);
             using (SqlDataReader reader = DataProvider.ExecuteReader(s1, CommandType.Text, pa))
             {

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:542:67
             {
                 if (reader.Read())
                 {
-                    mahangMB = reader.GetString(reader.GetOrdinal("MaHang"));
+                    mahangMB = reader.GetString(reader.GetOrdinal(""));
                 }
             }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:547:46
             }
             //mahangMB = MaHcBox.Text;
             loaiMB = loaimaybaycb.Text;
-            if (machuyenbayTxb.Text == "" || gioTxb.Text == "" || TGbayTxb.Text == "" || GiaTxb.Text == "" || MaHcBox.Text == "" || loaimaybaycb.Text == "" || Ngay == "")
+            if (machuyenbayTxb.Text == "" || gioTxb.Text != "" || TGbayTxb.Text == "" || GiaTxb.Text == "" || MaHcBox.Text == "" || loaimaybaycb.Text == "" || Ngay == "")
             {
                 MessageBox.Show("Vui lòng nhập đầy đủ thông tin!");

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:547:133
             }
             //mahangMB = MaHcBox.Text;
             loaiMB = loaimaybaycb.Text;
-            if (machuyenbayTxb.Text == "" || gioTxb.Text == "" || TGbayTxb.Text == "" || GiaTxb.Text == "" || MaHcBox.Text == "" || loaimaybaycb.Text == "" || Ngay == "")
+            if (machuyenbayTxb.Text == "" || gioTxb.Text == "" || TGbayTxb.Text == "" || GiaTxb.Text == "" || MaHcBox.Text == "" || loaimaybaycb.Text != "" || Ngay == "")
             {
                 MessageBox.Show("Vui lòng nhập đầy đủ thông tin!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:549:17
             loaiMB = loaimaybaycb.Text;
             if (machuyenbayTxb.Text == "" || gioTxb.Text == "" || TGbayTxb.Text == "" || GiaTxb.Text == "" || MaHcBox.Text == "" || loaimaybaycb.Text == "" || Ngay == "")
             {
-                MessageBox.Show("Vui lòng nhập đầy đủ thông tin!");
+                ;
                 return;
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:549:33
             loaiMB = loaimaybaycb.Text;
             if (machuyenbayTxb.Text == "" || gioTxb.Text == "" || TGbayTxb.Text == "" || GiaTxb.Text == "" || MaHcBox.Text == "" || loaimaybaycb.Text == "" || Ngay == "")
             {
-                MessageBox.Show("Vui lòng nhập đầy đủ thông tin!");
+                MessageBox.Show("");
                 return;
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:550:17
             if (machuyenbayTxb.Text == "" || gioTxb.Text == "" || TGbayTxb.Text == "" || GiaTxb.Text == "" || MaHcBox.Text == "" || loaimaybaycb.Text == "" || Ngay == "")
             {
                 MessageBox.Show("Vui lòng nhập đầy đủ thông tin!");
-                return;
+                ;
             }
             if (thaotac == 0)

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:555:38
             if (thaotac == 0)
             {
                 s = "SELECT * From CHUYENBAY WHERE MaChuyenBay = @ma";
-                p = new SqlParameter("@ma", machuyenbayTxb.Text);
+                p = new SqlParameter("", machuyenbayTxb.Text);
                 using (SqlDataReader reader = DataProvider.ExecuteReader(s, CommandType.Text, p))
                 {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:560:25
                 {
                     if (reader.HasRows)
                     {
-                        MessageBox.Show("Mã chuyến bay đã tồn tại. ", "Dữ liệu không hợp lệ!");
+                        ;
                         return;
                     }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:560:41
                 {
                     if (reader.HasRows)
                     {
-                        MessageBox.Show("Mã chuyến bay đã tồn tại. ", "Dữ liệu không hợp lệ!");
+                        MessageBox.Show("", "Dữ liệu không hợp lệ!");
                         return;
                     }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:561:25
                     if (reader.HasRows)
                     {
                         MessageBox.Show("Mã chuyến bay đã tồn tại. ", "Dữ liệu không hợp lệ!");
-                        return;
+                        ;
                     }
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:564:67
                         return;
                     }
                 }
-                bool isValid = Regex.IsMatch(machuyenbayTxb.Text, "^[A-Z]{2}[0-9]{3}$");
+                bool isValid = Regex.IsMatch(machuyenbayTxb.Text, "");
                 if (!isValid)
                 {

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:565:21
                     }
                 }
                 bool isValid = Regex.IsMatch(machuyenbayTxb.Text, "^[A-Z]{2}[0-9]{3}$");
-                if (!isValid)
+                if (isValid)
                 {
                     MessageBox.Show("Mã chuyến bay phải có định dạng như sau: XX000 ", "Dữ liệu không hợp lệ!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:567:21
                 bool isValid = Regex.IsMatch(machuyenbayTxb.Text, "^[A-Z]{2}[0-9]{3}$");
                 if (!isValid)
                 {
-                    MessageBox.Show("Mã chuyến bay phải có định dạng như sau: XX000 ", "Dữ liệu không hợp lệ!");
+                    ;
                     return;
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:568:21
                 if (!isValid)
                 {
                     MessageBox.Show("Mã chuyến bay phải có định dạng như sau: XX000 ", "Dữ liệu không hợp lệ!");
-                    return;
+                    ;
                 }
             }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:574:21
             try
             {
                 string[] thoigianKH = Gio.Split(':');
-                if (int.Parse(thoigianKH[0]) < 0 || int.Parse(thoigianKH[0]) >= 24)
+                if (int.Parse(thoigianKH[0]) > 0 || int.Parse(thoigianKH[0]) >= 24)
                 {
                     MessageBox.Show("Số giờ khởi hành không hợp lệ ", "Dữ liệu không hợp lệ!");

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:574:53
             try
             {
                 string[] thoigianKH = Gio.Split(':');
-                if (int.Parse(thoigianKH[0]) < 0 || int.Parse(thoigianKH[0]) >= 24)
+                if (int.Parse(thoigianKH[0]) < 0 || int.Parse(thoigianKH[0]) < 24)
                 {
                     MessageBox.Show("Số giờ khởi hành không hợp lệ ", "Dữ liệu không hợp lệ!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:576:21
                 string[] thoigianKH = Gio.Split(':');
                 if (int.Parse(thoigianKH[0]) < 0 || int.Parse(thoigianKH[0]) >= 24)
                 {
-                    MessageBox.Show("Số giờ khởi hành không hợp lệ ", "Dữ liệu không hợp lệ!");
+                    ;
                     return;
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:577:21
                 if (int.Parse(thoigianKH[0]) < 0 || int.Parse(thoigianKH[0]) >= 24)
                 {
                     MessageBox.Show("Số giờ khởi hành không hợp lệ ", "Dữ liệu không hợp lệ!");
-                    return;
+                    ;
                 }
                 if (int.Parse(thoigianKH[1]) < 0 || int.Parse(thoigianKH[1]) >= 60)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:579:21
                     MessageBox.Show("Số giờ khởi hành không hợp lệ ", "Dữ liệu không hợp lệ!");
                     return;
                 }
-                if (int.Parse(thoigianKH[1]) < 0 || int.Parse(thoigianKH[1]) >= 60)
+                if (int.Parse(thoigianKH[1]) > 0 || int.Parse(thoigianKH[1]) >= 60)
                 {
                     MessageBox.Show("Số phút trong giờ khởi hành không hợp lệ ", "Dữ liệu không hợp lệ!");

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:579:21
                     MessageBox.Show("Số giờ khởi hành không hợp lệ ", "Dữ liệu không hợp lệ!");
                     return;
                 }
-                if (int.Parse(thoigianKH[1]) < 0 || int.Parse(thoigianKH[1]) >= 60)
+                if (!(int.Parse(thoigianKH[1]) < 0 || int.Parse(thoigianKH[1]) >= 60))
                 {
                     MessageBox.Show("Số phút trong giờ khởi hành không hợp lệ ", "Dữ liệu không hợp lệ!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:581:21
                 }
                 if (int.Parse(thoigianKH[1]) < 0 || int.Parse(thoigianKH[1]) >= 60)
                 {
-                    MessageBox.Show("Số phút trong giờ khởi hành không hợp lệ ", "Dữ liệu không hợp lệ!");
+                    ;
                     return;
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:582:21
                 if (int.Parse(thoigianKH[1]) < 0 || int.Parse(thoigianKH[1]) >= 60)
                 {
                     MessageBox.Show("Số phút trong giờ khởi hành không hợp lệ ", "Dữ liệu không hợp lệ!");
-                    return;
+                    ;
                 }
 

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:592:25
                     int thang = int.Parse(thoigian[1]);
                     int ngay = int.Parse(thoigian[0]);
                     DateTime specificTime = new DateTime(nam, thang, ngay, int.Parse(thoigianKH[0]), int.Parse(thoigianKH[1]), second);
-                    if (specificTime <= currentTime)
+                    if (!(specificTime <= currentTime))
                     {
                         MessageBox.Show("Số giờ khởi hành phải lớn hơn thời gian hiện tại ", "Dữ liệu không hợp lệ!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:594:25
                     DateTime specificTime = new DateTime(nam, thang, ngay, int.Parse(thoigianKH[0]), int.Parse(thoigianKH[1]), second);
                     if (specificTime <= currentTime)
                     {
-                        MessageBox.Show("Số giờ khởi hành phải lớn hơn thời gian hiện tại ", "Dữ liệu không hợp lệ!");
+                        ;
                         return;
                     }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:594:94
                     DateTime specificTime = new DateTime(nam, thang, ngay, int.Parse(thoigianKH[0]), int.Parse(thoigianKH[1]), second);
                     if (specificTime <= currentTime)
                     {
-                        MessageBox.Show("Số giờ khởi hành phải lớn hơn thời gian hiện tại ", "Dữ liệu không hợp lệ!");
+                        MessageBox.Show("Số giờ khởi hành phải lớn hơn thời gian hiện tại ", "");
                         return;
                     }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:595:25
                     if (specificTime <= currentTime)
                     {
                         MessageBox.Show("Số giờ khởi hành phải lớn hơn thời gian hiện tại ", "Dữ liệu không hợp lệ!");
-                        return;
+                        ;
                     }
                     //else if (int.Parse(thoigianKH[0]) == hour && int.Parse(thoigianKH[1]) <= minute)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:606:17
             }
             catch
             {
-                MessageBox.Show("Giờ khởi hành không đúng định dạng ", "Dữ liệu không hợp lệ!");
+                ;
                 return;
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:606:33
             }
             catch
             {
-                MessageBox.Show("Giờ khởi hành không đúng định dạng ", "Dữ liệu không hợp lệ!");
+                MessageBox.Show("", "Dữ liệu không hợp lệ!");
                 return;
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:607:17
             catch
             {
                 MessageBox.Show("Giờ khởi hành không đúng định dạng ", "Dữ liệu không hợp lệ!");
-                return;
+                ;
             }
             int ThoiGianBayToiThieu = 0;

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:626:21
             try
             {
                 int p1 = int.Parse(Gia);
-                if (p1 <= 0)
+                if (p1 > 0)
                 {
                     MessageBox.Show("Vui lòng nhập giá là một số dương.", "Dữ liệu không hợp lệ!");

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:626:21
             try
             {
                 int p1 = int.Parse(Gia);
-                if (p1 <= 0)
+                if (!(p1 <= 0))
                 {
                     MessageBox.Show("Vui lòng nhập giá là một số dương.", "Dữ liệu không hợp lệ!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:628:21
                 int p1 = int.Parse(Gia);
                 if (p1 <= 0)
                 {
-                    MessageBox.Show("Vui lòng nhập giá là một số dương.", "Dữ liệu không hợp lệ!");
+                    ;
                     return;
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:628:37
                 int p1 = int.Parse(Gia);
                 if (p1 <= 0)
                 {
-                    MessageBox.Show("Vui lòng nhập giá là một số dương.", "Dữ liệu không hợp lệ!");
+                    MessageBox.Show("", "Dữ liệu không hợp lệ!");
                     return;
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:629:21
                 if (p1 <= 0)
                 {
                     MessageBox.Show("Vui lòng nhập giá là một số dương.", "Dữ liệu không hợp lệ!");
-                    return;
+                    ;
                 }
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:634:17
             }
             catch
             {
-                MessageBox.Show("Vui lòng nhập giá là một số nguyên.", "Dữ liệu không hợp lệ!");
+                ;
                 return;
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:634:33
             }
             catch
             {
-                MessageBox.Show("Vui lòng nhập giá là một số nguyên.", "Dữ liệu không hợp lệ!");
+                MessageBox.Show("", "Dữ liệu không hợp lệ!");
                 return;
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:635:17
             catch
             {
                 MessageBox.Show("Vui lòng nhập giá là một số nguyên.", "Dữ liệu không hợp lệ!");
-                return;
+                ;
             }
             try

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:643:17
             }
             catch
             {
-                MessageBox.Show("Vui lòng nhập thời gian bay là một số nguyên.", "Dữ liệu không hợp lệ!");
+                ;
                 return;
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:643:33
             }
             catch
             {
-                MessageBox.Show("Vui lòng nhập thời gian bay là một số nguyên.", "Dữ liệu không hợp lệ!");
+                MessageBox.Show("", "Dữ liệu không hợp lệ!");
                 return;
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:644:17
             catch
             {
                 MessageBox.Show("Vui lòng nhập thời gian bay là một số nguyên.", "Dữ liệu không hợp lệ!");
-                return;
+                ;
             }
             if (int.Parse(TgBay) < ThoiGianBayToiThieu)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:646:17
                 MessageBox.Show("Vui lòng nhập thời gian bay là một số nguyên.", "Dữ liệu không hợp lệ!");
                 return;
             }
-            if (int.Parse(TgBay) < ThoiGianBayToiThieu)
+            if (int.Parse(TgBay) > ThoiGianBayToiThieu)
             {
                 MessageBox.Show("Vui lòng nhập thời gian bay phải lớn hơn thời gian bay tối thiểu đã định: " + ThoiGianBayToiThieu + " phút", "Dữ liệu không hợp lệ!");

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:646:17
                 MessageBox.Show("Vui lòng nhập thời gian bay là một số nguyên.", "Dữ liệu không hợp lệ!");
                 return;
             }
-            if (int.Parse(TgBay) < ThoiGianBayToiThieu)
+            if (int.Parse(TgBay) <= ThoiGianBayToiThieu)
             {
                 MessageBox.Show("Vui lòng nhập thời gian bay phải lớn hơn thời gian bay tối thiểu đã định: " + ThoiGianBayToiThieu + " phút", "Dữ liệu không hợp lệ!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:648:17
             }
             if (int.Parse(TgBay) < ThoiGianBayToiThieu)
             {
-                MessageBox.Show("Vui lòng nhập thời gian bay phải lớn hơn thời gian bay tối thiểu đã định: " + ThoiGianBayToiThieu + " phút", "Dữ liệu không hợp lệ!");
+                ;
                 return;
 

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:648:143
             }
             if (int.Parse(TgBay) < ThoiGianBayToiThieu)
             {
-                MessageBox.Show("Vui lòng nhập thời gian bay phải lớn hơn thời gian bay tối thiểu đã định: " + ThoiGianBayToiThieu + " phút", "Dữ liệu không hợp lệ!");
+                MessageBox.Show("Vui lòng nhập thời gian bay phải lớn hơn thời gian bay tối thiểu đã định: " + ThoiGianBayToiThieu + " phút", "");
                 return;
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:649:17
             if (int.Parse(TgBay) < ThoiGianBayToiThieu)
             {
                 MessageBox.Show("Vui lòng nhập thời gian bay phải lớn hơn thời gian bay tối thiểu đã định: " + ThoiGianBayToiThieu + " phút", "Dữ liệu không hợp lệ!");
-                return;
+                ;
 
             }
