[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:652:17
                 return;
 
             }
-            if (Sanbaydi == Sanbayden)
+            if (Sanbaydi != Sanbayden)
             {
                 MessageBox.Show("Sân bay đi và sân bay đến không được trùng nhau.", "Dữ liệu không hợp lệ!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:654:17
             }
             if (Sanbaydi == Sanbayden)
             {
-                MessageBox.Show("Sân bay đi và sân bay đến không được trùng nhau.", "Dữ liệu không hợp lệ!");
+                ;
                 return;
 

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:654:33
             }
             if (Sanbaydi == Sanbayden)
             {
-                MessageBox.Show("Sân bay đi và sân bay đến không được trùng nhau.", "Dữ liệu không hợp lệ!");
+                MessageBox.Show("", "Dữ liệu không hợp lệ!");
                 return;
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:655:17
             if (Sanbaydi == Sanbayden)
             {
                 MessageBox.Show("Sân bay đi và sân bay đến không được trùng nhau.", "Dữ liệu không hợp lệ!");
-                return;
+                ;
 
             }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:660:21
             }
             if (thaotac == 0)
             {
-                if (qLHangVeClass.Count == 0)
+                if (qLHangVeClass.Count != 0)
                 {
                     MessageBox.Show("Vui lòng chọn hạng vé cho chuyến bay.", "Dữ liệu không hợp lệ!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:662:21
             {
                 if (qLHangVeClass.Count == 0)
                 {
-                    MessageBox.Show("Vui lòng chọn hạng vé cho chuyến bay.", "Dữ liệu không hợp lệ!");
+                    ;
                     return;
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:663:21
                 if (qLHangVeClass.Count == 0)
                 {
                     MessageBox.Show("Vui lòng chọn hạng vé cho chuyến bay.", "Dữ liệu không hợp lệ!");
-                    return;
+                    ;
                 }
                 else

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:669:29
                 {
                     for (int i = 0; i < qLHangVeClass.Count; i++)
                     {
-                        if (qLHangVeClass[i].Mahangve == null || qLHangVeClass[i].Soluong == null)
+                        if (!(qLHangVeClass[i].Mahangve == null || qLHangVeClass[i].Soluong == null))
                         {
                             MessageBox.Show("Vui lòng nhập thông tin đầy đủ cho hạng vé.", "Dữ liệu không hợp lệ!");

[NoCoverage] Logical mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:669:29
                 {
                     for (int i = 0; i < qLHangVeClass.Count; i++)
                     {
-                        if (qLHangVeClass[i].Mahangve == null || qLHangVeClass[i].Soluong == null)
+                        if (qLHangVeClass[i].Mahangve == null && qLHangVeClass[i].Soluong == null)
                         {
                             MessageBox.Show("Vui lòng nhập thông tin đầy đủ cho hạng vé.", "Dữ liệu không hợp lệ!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:671:29
                     {
                         if (qLHangVeClass[i].Mahangve == null || qLHangVeClass[i].Soluong == null)
                         {
-                            MessageBox.Show("Vui lòng nhập thông tin đầy đủ cho hạng vé.", "Dữ liệu không hợp lệ!");
+                            ;
                             return;
                         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:672:29
                         if (qLHangVeClass[i].Mahangve == null || qLHangVeClass[i].Soluong == null)
                         {
                             MessageBox.Show("Vui lòng nhập thông tin đầy đủ cho hạng vé.", "Dữ liệu không hợp lệ!");
-                            return;
+                            ;
                         }
                     }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:678:17
                 }
 
             }
-            if (thaotac == 1)
+            if (thaotac != 1)
             {
                 if (qLHangVeClass.Count > 0)

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:680:21
             }
             if (thaotac == 1)
             {
-                if (qLHangVeClass.Count > 0)
+                if (!(qLHangVeClass.Count > 0))
                 {
                     for (int i = 0; i < qLHangVeClass.Count; i++)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:680:21
             }
             if (thaotac == 1)
             {
-                if (qLHangVeClass.Count > 0)
+                if (qLHangVeClass.Count < 0)
                 {
                     for (int i = 0; i < qLHangVeClass.Count; i++)

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:682:62
             {
                 if (qLHangVeClass.Count > 0)
                 {
-                    for (int i = 0; i < qLHangVeClass.Count; i++)
+                    for (int i = 0; i < qLHangVeClass.Count; i--)
                     {
                         if (qLHangVeClass[i].Mahangve == null || qLHangVeClass[i].Soluong == null)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:684:29
                 {
                     for (int i = 0; i < qLHangVeClass.Count; i++)
                     {
-                        if (qLHangVeClass[i].Mahangve == null || qLHangVeClass[i].Soluong == null)
+                        if (qLHangVeClass[i].Mahangve != null || qLHangVeClass[i].Soluong == null)
                         {
                             MessageBox.Show("Vui lòng nhập thông tin đầy đủ cho hạng vé.", "Dữ liệu không hợp lệ!");

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:686:92
                     {
                         if (qLHangVeClass[i].Mahangve == null || qLHangVeClass[i].Soluong == null)
                         {
-                            MessageBox.Show("Vui lòng nhập thông tin đầy đủ cho hạng vé.", "Dữ liệu không hợp lệ!");
+                            MessageBox.Show("Vui lòng nhập thông tin đầy đủ cho hạng vé.", "");
                             return;
                         }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:693:17
                 }
             }
 
-            if (thaotac == 0)
+            if (thaotac != 0)
             {
                 for (int i = 0; i < qLHangVeClass.Count - 1; i++)

[NoCoverage] Arithmetic mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:695:37
 
             if (thaotac == 0)
             {
-                for (int i = 0; i < qLHangVeClass.Count - 1; i++)
+                for (int i = 0; i < qLHangVeClass.Count + 1; i++)
                 {
                     for (int j = i + 1; j < qLHangVeClass.Count; j++)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:695:33
 
             if (thaotac == 0)
             {
-                for (int i = 0; i < qLHangVeClass.Count - 1; i++)
+                for (int i = 0; i <= qLHangVeClass.Count - 1; i++)
                 {
                     for (int j = i + 1; j < qLHangVeClass.Count; j++)

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:697:66
             {
                 for (int i = 0; i < qLHangVeClass.Count - 1; i++)
                 {
-                    for (int j = i + 1; j < qLHangVeClass.Count; j++)
+                    for (int j = i + 1; j < qLHangVeClass.Count; j--)
                     {
                         if (qLHangVeClass[i].Mahangve == qLHangVeClass[j].Mahangve)

[NoCoverage] Arithmetic mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:697:34
             {
                 for (int i = 0; i < qLHangVeClass.Count - 1; i++)
                 {
-                    for (int j = i + 1; j < qLHangVeClass.Count; j++)
+                    for (int j = i - 1; j < qLHangVeClass.Count; j++)
                     {
                         if (qLHangVeClass[i].Mahangve == qLHangVeClass[j].Mahangve)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:699:29
                 {
                     for (int j = i + 1; j < qLHangVeClass.Count; j++)
                     {
-                        if (qLHangVeClass[i].Mahangve == qLHangVeClass[j].Mahangve)
+                        if (qLHangVeClass[i].Mahangve != qLHangVeClass[j].Mahangve)
                         {
                             MessageBox.Show("Xuất hiện tình trạng mã hạng vé trùng nhau. ", "Thông báo");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:701:29
                     {
                         if (qLHangVeClass[i].Mahangve == qLHangVeClass[j].Mahangve)
                         {
-                            MessageBox.Show("Xuất hiện tình trạng mã hạng vé trùng nhau. ", "Thông báo");
+                            ;
                             return;
                         }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:701:93
                     {
                         if (qLHangVeClass[i].Mahangve == qLHangVeClass[j].Mahangve)
                         {
-                            MessageBox.Show("Xuất hiện tình trạng mã hạng vé trùng nhau. ", "Thông báo");
+                            MessageBox.Show("Xuất hiện tình trạng mã hạng vé trùng nhau. ", "");
                             return;
                         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:702:29
                         if (qLHangVeClass[i].Mahangve == qLHangVeClass[j].Mahangve)
                         {
                             MessageBox.Show("Xuất hiện tình trạng mã hạng vé trùng nhau. ", "Thông báo");
-                            return;
+                            ;
                         }
                     }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:706:32
                         }
                     }
                 }
-                string query = "SELECT * From CHUYENBAY";
+                string query = "";
                 SqlParameter param1 = new SqlParameter("", "");
                 DataTable dt;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:707:60
                     }
                 }
                 string query = "SELECT * From CHUYENBAY";
-                SqlParameter param1 = new SqlParameter("", "");
+                SqlParameter param1 = new SqlParameter("", "Stryker was here!");
                 DataTable dt;
                 using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text, param1))

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:707:56
                     }
                 }
                 string query = "SELECT * From CHUYENBAY";
-                SqlParameter param1 = new SqlParameter("", "");
+                SqlParameter param1 = new SqlParameter("Stryker was here!", "");
                 DataTable dt;
                 using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text, param1))

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:722:38
                 cb.maCB = MaCB;
                 cb.SBdi = Sanbaydi;
                 cb.SBden = Sanbayden;
-                cb.datetime = Ngay + "-" + Gio;
+                cb.datetime = Ngay + "" + Gio;
                 cb.tgBay = TgBay;
                 cb.Gia = Gia;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:725:17
                 cb.datetime = Ngay + "-" + Gio;
                 cb.tgBay = TgBay;
                 cb.Gia = Gia;
-                chuyenbayTable.Items.Add(cb);
+                ;
                 SqlConnection con = DataProvider.sqlConnection;
                 if (con.State == ConnectionState.Closed)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:735:21
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();
                 con.Close();
-                if (qLHangVeClass.Count > 0)
+                if (qLHangVeClass.Count >= 0)
                     SaveHV_VE();
             }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:735:21
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();
                 con.Close();
-                if (qLHangVeClass.Count > 0)
+                if (qLHangVeClass.Count < 0)
                     SaveHV_VE();
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:736:21
                 cmd.ExecuteNonQuery();
                 con.Close();
                 if (qLHangVeClass.Count > 0)
-                    SaveHV_VE();
+                    ;
             }
             else

[NoCoverage] Linq method mutation (Concat() to Except())
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:740:50
             }
             else
             {
-                List<QLHangVeClass> mergedList = qLHangVeClass.Concat(qLHangVeClassexist).ToList();
+                List<QLHangVeClass> mergedList = qLHangVeClass.Except(qLHangVeClassexist).ToList();
                 for (int i = 0; i < mergedList.Count - 1; i++)
                 {

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:741:33
             else
             {
                 List<QLHangVeClass> mergedList = qLHangVeClass.Concat(qLHangVeClassexist).ToList();
-                for (int i = 0; i < mergedList.Count - 1; i++)
+                for (int i = 0; i <= mergedList.Count - 1; i++)
                 {
                     for (int j = i + 1; j < mergedList.Count; j++)

[NoCoverage] Arithmetic mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:741:37
             else
             {
                 List<QLHangVeClass> mergedList = qLHangVeClass.Concat(qLHangVeClassexist).ToList();
-                for (int i = 0; i < mergedList.Count - 1; i++)
+                for (int i = 0; i < mergedList.Count + 1; i++)
                 {
                     for (int j = i + 1; j < mergedList.Count; j++)

[NoCoverage] Arithmetic mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:743:34
                 List<QLHangVeClass> mergedList = qLHangVeClass.Concat(qLHangVeClassexist).ToList();
                 for (int i = 0; i < mergedList.Count - 1; i++)
                 {
-                    for (int j = i + 1; j < mergedList.Count; j++)
+                    for (int j = i - 1; j < mergedList.Count; j++)
                     {
                         if (mergedList[i].Mahangve == mergedList[j].Mahangve)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:743:41
                 List<QLHangVeClass> mergedList = qLHangVeClass.Concat(qLHangVeClassexist).ToList();
                 for (int i = 0; i < mergedList.Count - 1; i++)
                 {
-                    for (int j = i + 1; j < mergedList.Count; j++)
+                    for (int j = i + 1; j <= mergedList.Count; j++)
                     {
                         if (mergedList[i].Mahangve == mergedList[j].Mahangve)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:745:29
                 {
                     for (int j = i + 1; j < mergedList.Count; j++)
                     {
-                        if (mergedList[i].Mahangve == mergedList[j].Mahangve)
+                        if (mergedList[i].Mahangve != mergedList[j].Mahangve)
                         {
                             MessageBox.Show("Xuất hiện tình trạng mã hạng vé trùng nhau. ", "Thông báo");

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:764:21
                 //cmd1.CommandType = CommandType.Text;
                 //cmd1.ExecuteReader();
                 //con.Close();
-                if (con.State == ConnectionState.Closed)
+                if (con.State != ConnectionState.Closed)
                 {
                     con.Open();

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:772:21
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();
                 con.Close();
-                if (qLHangVeClass.Count > 0)
+                if (!(qLHangVeClass.Count > 0))
                     SaveHV_VE();
                 chuyenbayTable.Items.Clear();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:774:17
                 con.Close();
                 if (qLHangVeClass.Count > 0)
                     SaveHV_VE();
-                chuyenbayTable.Items.Clear();
+                ;
                 loadDatatoTable();
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:775:17
                 if (qLHangVeClass.Count > 0)
                     SaveHV_VE();
                 chuyenbayTable.Items.Clear();
-                loadDatatoTable();
+                ;
             }
             MessageBox.Show("Bạn đã lưu chuyến bay thành công. ", "Thông báo");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:777:13
                 chuyenbayTable.Items.Clear();
                 loadDatatoTable();
             }
-            MessageBox.Show("Bạn đã lưu chuyến bay thành công. ", "Thông báo");
+            ;
             isSave = true;
         }

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:778:22
                 loadDatatoTable();
             }
             MessageBox.Show("Bạn đã lưu chuyến bay thành công. ", "Thông báo");
-            isSave = true;
+            isSave = false;
         }
         private void Luu_Click(object sender, RoutedEventArgs e)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:782:13
         }
         private void Luu_Click(object sender, RoutedEventArgs e)
         {
-            SaveCB();
+            ;
         }
 

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:787:27
 
         private void Hoantat_Click(object sender, RoutedEventArgs e)
         {
-            if (isSave == false)
+            if (isSave == true)
             {
                 MessageBoxResult result = (MessageBoxResult)MessageBox.Show("Bạn có muốn lưu chuyến bay", "Xác nhận", MessageBoxButtons.YesNo);

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:787:17
 
         private void Hoantat_Click(object sender, RoutedEventArgs e)
         {
-            if (isSave == false)
+            if (isSave != false)
             {
                 MessageBoxResult result = (MessageBoxResult)MessageBox.Show("Bạn có muốn lưu chuyến bay", "Xác nhận", MessageBoxButtons.YesNo);

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:789:107
         {
             if (isSave == false)
             {
-                MessageBoxResult result = (MessageBoxResult)MessageBox.Show("Bạn có muốn lưu chuyến bay", "Xác nhận", MessageBoxButtons.YesNo);
+                MessageBoxResult result = (MessageBoxResult)MessageBox.Show("Bạn có muốn lưu chuyến bay", "", MessageBoxButtons.YesNo);
                 if (result == MessageBoxResult.Yes)
                 {

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:789:77
         {
             if (isSave == false)
             {
-                MessageBoxResult result = (MessageBoxResult)MessageBox.Show("Bạn có muốn lưu chuyến bay", "Xác nhận", MessageBoxButtons.YesNo);
+                MessageBoxResult result = (MessageBoxResult)MessageBox.Show("", "Xác nhận", MessageBoxButtons.YesNo);
                 if (result == MessageBoxResult.Yes)
                 {

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:790:21
             if (isSave == false)
             {
                 MessageBoxResult result = (MessageBoxResult)MessageBox.Show("Bạn có muốn lưu chuyến bay", "Xác nhận", MessageBoxButtons.YesNo);
-                if (result == MessageBoxResult.Yes)
+                if (result != MessageBoxResult.Yes)
                 {
                     SaveCB();

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:794:26
                 {
                     SaveCB();
                 }
-                else if (result == MessageBoxResult.No)
+                else if (result != MessageBoxResult.No)
                 {
                     this.Close();

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:801:26
             }
             else
             {
-                isSave = false;
+                isSave = true;
                 this.Close();
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:802:17
             else
             {
                 isSave = false;
-                this.Close();
+                ;
             }
 
