[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddHangMB.xaml.cs:35:17
             InitializeComponent();
             this.thaotac = thaotac;
             this.hangmbtable = dataGrid;
-            if (thaotac == 1)
+            if (thaotac != 1)
             {
                 headertxt.Text = "Sửa hãng bay";

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddHangMB.xaml.cs:39:39
             {
                 headertxt.Text = "Sửa hãng bay";
                 mahangTxb.Text = Hangmaybay.hangbaytofix.mahang;
-                mahangTxb.IsEnabled = false;
+                mahangTxb.IsEnabled = true;
                 tenhangTxb.Text = Hangmaybay.hangbaytofix.tenhang;
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddHangMB.xaml.cs:50:56
         public void loadDatatoHMB()
         {
             string query = "SELECT * FROM HANGMAYBAY";
-            SqlParameter param1 = new SqlParameter("", "");
+            SqlParameter param1 = new SqlParameter("", "Stryker was here!");
             DataTable dt;
             using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text, param1))

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddHangMB.xaml.cs:66:32
 
                 HangMBclass hb = new HangMBclass();
                 hb.STT = stt.ToString();
-                hb.mahang = dr["MaHang"].ToString();
+                hb.mahang = dr[""].ToString();
                 hb.tenhang = dr["TenHang"].ToString();
                 hangmbtable.Items.Add(hb);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddHangMB.xaml.cs:68:17
                 hb.STT = stt.ToString();
                 hb.mahang = dr["MaHang"].ToString();
                 hb.tenhang = dr["TenHang"].ToString();
-                hangmbtable.Items.Add(hb);
+                ;
                 stt++;
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddHangMB.xaml.cs:69:17
                 hb.mahang = dr["MaHang"].ToString();
                 hb.tenhang = dr["TenHang"].ToString();
                 hangmbtable.Items.Add(hb);
-                stt++;
+                ;
             }
         }

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddHangMB.xaml.cs:69:17
                 hb.mahang = dr["MaHang"].ToString();
                 hb.tenhang = dr["TenHang"].ToString();
                 hangmbtable.Items.Add(hb);
-                stt++;
+                stt--;
             }
         }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddHangMB.xaml.cs:77:17
         {
             mahang = mahangTxb.Text;
             tenhang = tenhangTxb.Text;
-            if (mahang == "" || tenhang == "")
+            if (mahang != "" || tenhang == "")
             {
                 MessageBox.Show("Vui lòng nhập đầy đủ thông tin!");

[NoCoverage] Logical mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddHangMB.xaml.cs:77:17
         {
             mahang = mahangTxb.Text;
             tenhang = tenhangTxb.Text;
-            if (mahang == "" || tenhang == "")
+            if (mahang == "" && tenhang == "")
             {
                 MessageBox.Show("Vui lòng nhập đầy đủ thông tin!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddHangMB.xaml.cs:90:25
                 {
                     if (reader.HasRows)
                     {
-                        MessageBox.Show("Mã hãng đã tồn tại. ", "Dữ liệu không hợp lệ!");
+                        ;
                         return;
                     }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddHangMB.xaml.cs:90:65
                 {
                     if (reader.HasRows)
                     {
-                        MessageBox.Show("Mã hãng đã tồn tại. ", "Dữ liệu không hợp lệ!");
+                        MessageBox.Show("Mã hãng đã tồn tại. ", "");
                         return;
                     }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddHangMB.xaml.cs:91:25
                     if (reader.HasRows)
                     {
                         MessageBox.Show("Mã hãng đã tồn tại. ", "Dữ liệu không hợp lệ!");
-                        return;
+                        ;
                     }
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddHangMB.xaml.cs:112:17
                 hb.STT = (dt.Rows.Count + 1).ToString();
                 hb.tenhang = tenhang;
                 hb.mahang = mahang;
-                hangmbtable.Items.Add(hb);
+                ;
                 SqlConnection con = DataProvider.sqlConnection;
                 if (con.State == ConnectionState.Closed)

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddHangMB.xaml.cs:118:114
                 {
                     con.Open();
                 }
-                SqlCommand cmd = new SqlCommand("Insert into HANGMAYBAY values(N'" + mahang + "',N'" + tenhang + "',N'" + "" + "')", con);
+                SqlCommand cmd = new SqlCommand("Insert into HANGMAYBAY values(N'" + mahang + "',N'" + tenhang + "" + "" + "')", con);
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddHangMB.xaml.cs:123:17
                 cmd.ExecuteNonQuery();
                 con.Close();
 
-                this.Close();
+                ;
             }
             else

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddHangMB.xaml.cs:132:49
                 {
                     con.Open();
                 }
-                SqlCommand cmd = new SqlCommand("Update [HANGMAYBAY] set MaHang=N'" + mahang + "',TenHang=N'" + tenhang + "' where MaHang=N'" + Hangmaybay.hangbaytofix.mahang + "'", con);
+                SqlCommand cmd = new SqlCommand("" + mahang + "',TenHang=N'" + tenhang + "' where MaHang=N'" + Hangmaybay.hangbaytofix.mahang + "'", con);
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddHangMB.xaml.cs:132:178
                 {
                     con.Open();
                 }
-                SqlCommand cmd = new SqlCommand("Update [HANGMAYBAY] set MaHang=N'" + mahang + "',TenHang=N'" + tenhang + "' where MaHang=N'" + Hangmaybay.hangbaytofix.mahang + "'", con);
+                SqlCommand cmd = new SqlCommand("Update [HANGMAYBAY] set MaHang=N'" + mahang + "',TenHang=N'" + tenhang + "' where MaHang=N'" + Hangmaybay.hangbaytofix.mahang + "", con);
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddHangMB.xaml.cs:136:17
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();
                 con.Close();
-                hangmbtable.Items.Clear();
+                ;
                 loadDatatoHMB();
                 this.Close();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddHangMB.xaml.cs:137:17
                 cmd.ExecuteNonQuery();
                 con.Close();
                 hangmbtable.Items.Clear();
-                loadDatatoHMB();
+                ;
                 this.Close();
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddHangMB.xaml.cs:138:17
                 con.Close();
                 hangmbtable.Items.Clear();
                 loadDatatoHMB();
-                this.Close();
+                ;
             }
         }
