[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:36:17
         public AddInforHK()
         {
             InitializeComponent();            
-            if (MainWindow.curAccount != null) {
+            if (MainWindow.curAccount == null) {
                 if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)
                 {

[NoCoverage] Logical mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:37:21
         {
             InitializeComponent();            
             if (MainWindow.curAccount != null) {
-                if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)
+                if (MainWindow.curAccount.type == 1 && MainWindow.curAccount.type == 2)
                 {
                     tbl_MaTK.Text = "Mã nhân viên: ";

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:37:21
         {
             InitializeComponent();            
             if (MainWindow.curAccount != null) {
-                if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)
+                if (!(MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2))
                 {
                     tbl_MaTK.Text = "Mã nhân viên: ";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:39:37
             if (MainWindow.curAccount != null) {
                 if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)
                 {
-                    tbl_MaTK.Text = "Mã nhân viên: ";
+                    tbl_MaTK.Text = "";
                     btnTTNgay.Content = "Đã thanh toán";
                     btnTTSau.Content = "Chưa thanh toán";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:40:41
                 if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)
                 {
                     tbl_MaTK.Text = "Mã nhân viên: ";
-                    btnTTNgay.Content = "Đã thanh toán";
+                    btnTTNgay.Content = "";
                     btnTTSau.Content = "Chưa thanh toán";
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:41:40
                 {
                     tbl_MaTK.Text = "Mã nhân viên: ";
                     btnTTNgay.Content = "Đã thanh toán";
-                    btnTTSau.Content = "Chưa thanh toán";
+                    btnTTSau.Content = "";
                 }
             }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:53:69
 
         private void btnXacNhanVe_Click(object sender, RoutedEventArgs e)
         {
-            if (tenHanhKhachTxt.Text == "" || cmndTxt.Text == "" || sdtTxt.Text == "")
+            if (tenHanhKhachTxt.Text == "" || cmndTxt.Text == "" || sdtTxt.Text != "")
             {
                 MessageBox.Show("Vui lòng nhập đầy đủ thông tin hành khách!");

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:53:17
 
         private void btnXacNhanVe_Click(object sender, RoutedEventArgs e)
         {
-            if (tenHanhKhachTxt.Text == "" || cmndTxt.Text == "" || sdtTxt.Text == "")
+            if (tenHanhKhachTxt.Text != "" || cmndTxt.Text == "" || sdtTxt.Text == "")
             {
                 MessageBox.Show("Vui lòng nhập đầy đủ thông tin hành khách!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:55:17
         {
             if (tenHanhKhachTxt.Text == "" || cmndTxt.Text == "" || sdtTxt.Text == "")
             {
-                MessageBox.Show("Vui lòng nhập đầy đủ thông tin hành khách!");
+                ;
             }
             else

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:59:21
             }
             else
             {
-                if (!CheckCMND())
+                if (CheckCMND())
                 {
                     MessageBox.Show("Thông tin hành khách không hợp lệ.\nCMND đã được đăng ký cho một vé khác\nVui lòng kiểm tra và sửa đổi thông tin hành khách!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:61:21
             {
                 if (!CheckCMND())
                 {
-                    MessageBox.Show("Thông tin hành khách không hợp lệ.\nCMND đã được đăng ký cho một vé khác\nVui lòng kiểm tra và sửa đổi thông tin hành khách!");
+                    ;
                 }
                 else

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:68:29
 
                     foreach (Ticket item in ve)
                     {
-                        if (item.TiketID == maVeBox.SelectedItem.ToString())
+                        if (item.TiketID != maVeBox.SelectedItem.ToString())
                         {
                             item.HkID = maHanhKhachText.Text;

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:69:25
                     foreach (Ticket item in ve)
                     {
                         if (item.TiketID == maVeBox.SelectedItem.ToString())
-                        {
-                            item.HkID = maHanhKhachText.Text;
-                            item.HkName = tenHanhKhachTxt.Text;
-                            item.CMND = cmndTxt.Text;
-                            item.PhoneNumber = sdtTxt.Text;
-                        }
+                        {}
                     }
                 }

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:82:26
 
         private bool CheckCMND()
         {
-            bool check = true;
+            bool check = false;
             DataProvider.sqlConnection.Open();
             SqlCommand sqlCommand = new SqlCommand(

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:83:13
         private bool CheckCMND()
         {
             bool check = true;
-            DataProvider.sqlConnection.Open();
+            ;
             SqlCommand sqlCommand = new SqlCommand(
                 "select [v].CMND from [VE] [v] where [v].CMND = @cmnd ", DataProvider.sqlConnection);

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:90:25
             SqlDataReader reader = sqlCommand.ExecuteReader();
             if (reader.HasRows)
             {
-                check = false;
+                check = true;
             }
             DataProvider.sqlConnection.Close();

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:96:21
             
             foreach(Ticket ticket in ve)
             {
-                if (ticket.CMND == cmndTxt.Text)
+                if (ticket.CMND != cmndTxt.Text)
                 {
                     check = false;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:112:21
                 DataProvider.sqlConnection.Open();
                 SqlCommand sqlCommand = new SqlCommand(
                     "select [c].Gia, [hv].TyLe from [CHUYENBAY] [c], [HANGVE] [hv], [VE] [v] where [c].MaChuyenBay = @macb " +
-                    "and [v].MaChuyenBay = [c].MaChuyenBay " +
+                    "" +
                     "and [hv].MaHangVe = [v].MaHangVe " +
                     "and [hv].TenHangVe=@tenHangVe",

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:113:21
                 SqlCommand sqlCommand = new SqlCommand(
                     "select [c].Gia, [hv].TyLe from [CHUYENBAY] [c], [HANGVE] [hv], [VE] [v] where [c].MaChuyenBay = @macb " +
                     "and [v].MaChuyenBay = [c].MaChuyenBay " +
-                    "and [hv].MaHangVe = [v].MaHangVe " +
+                    "" +
                     "and [hv].TenHangVe=@tenHangVe",
                     DataProvider.sqlConnection);

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:124:55
                 {
                     if (reader.Read())
                     {
-                        int dongia = int.Parse(reader["Gia"].ToString());
+                        int dongia = int.Parse(reader[""].ToString());
                         double TyLe = double.Parse(reader["TyLe"].ToString());
                         tien += (int)(dongia * TyLe / 100);

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:125:59
                     if (reader.Read())
                     {
                         int dongia = int.Parse(reader["Gia"].ToString());
-                        double TyLe = double.Parse(reader["TyLe"].ToString());
+                        double TyLe = double.Parse(reader[""].ToString());
                         tien += (int)(dongia * TyLe / 100);
                     }

[NoCoverage] Arithmetic mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:126:39
                     {
                         int dongia = int.Parse(reader["Gia"].ToString());
                         double TyLe = double.Parse(reader["TyLe"].ToString());
-                        tien += (int)(dongia * TyLe / 100);
+                        tien += (int)(dongia * TyLe * 100);
                     }
                 }

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:126:25
                     {
                         int dongia = int.Parse(reader["Gia"].ToString());
                         double TyLe = double.Parse(reader["TyLe"].ToString());
-                        tien += (int)(dongia * TyLe / 100);
+                        tien -= (int)(dongia * TyLe / 100);
                     }
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:135:13
         }
         private void maVeBox_SelectionChanged(object sender, SelectionChangedEventArgs e)
         {
-            tenHanhKhachTxt.Clear();
+            ;
             cmndTxt.Clear();
             sdtTxt.Clear();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:136:13
         private void maVeBox_SelectionChanged(object sender, SelectionChangedEventArgs e)
         {
             tenHanhKhachTxt.Clear();
-            cmndTxt.Clear();
+            ;
             sdtTxt.Clear();
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:137:13
         {
             tenHanhKhachTxt.Clear();
             cmndTxt.Clear();
-            sdtTxt.Clear();
+            ;
 
             foreach (Ticket item in ve)

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:142:17
             foreach (Ticket item in ve)
             {
                 if (item.TiketID == maVeBox.SelectedItem.ToString())
-                {
-                    tenHanhKhachTxt.Text = item.HkName;
-                    cmndTxt.Text = item.CMND;
-                    sdtTxt.Text = item.PhoneNumber;
-                    soGheTxt.Text = item.SeatNumber.ToString();
-                    hangVeTxt.Text = item.FlightClass;
-                    maHanhKhachText.Text = item.HkID;
-                }
+                {}
             }
         }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:156:52
         private void NewHD()
         {
             DataProvider.sqlConnection.Open();
-            SqlCommand sqlCommand = new SqlCommand("select [h].* from HOADON [h] order by NgayLap desc", DataProvider.sqlConnection);
+            SqlCommand sqlCommand = new SqlCommand("", DataProvider.sqlConnection);
             SqlDataReader reader = sqlCommand.ExecuteReader();
             if (reader.HasRows)

[NoCoverage] Arithmetic mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:162:32
             {
                 if (reader.Read())
                 {
-                    int mahd = int.Parse(reader["MaHD"].ToString()) + 1;
+                    int mahd = int.Parse(reader["MaHD"].ToString()) - 1;
                     maHoaDonTxt.Text = mahd.ToString();
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:167:13
                 }
             }
             else maHoaDonTxt.Text = "1";
-            DataProvider.sqlConnection.Close();
+            ;
                         
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:174:13
         private int NewHK_ID()
         {
             int newID = 1;
-            DataProvider.sqlConnection.Open();
+            ;
             SqlCommand sqlCommand = new SqlCommand("select [v].* from VE [v] order by CMND desc", DataProvider.sqlConnection);
             SqlDataReader reader = sqlCommand.ExecuteReader();

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:181:25
             {
                 if (reader.Read())
                 {
-                    if (reader["MaHK"].ToString() != "")
+                    if (reader["MaHK"].ToString() == "")
                     {
                         newID = int.Parse(reader["MaHK"].ToString()) + 1;

[NoCoverage] Arithmetic mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:183:33
                 {
                     if (reader["MaHK"].ToString() != "")
                     {
-                        newID = int.Parse(reader["MaHK"].ToString()) + 1;
+                        newID = int.Parse(reader["MaHK"].ToString()) - 1;
                     }
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:183:50
                 {
                     if (reader["MaHK"].ToString() != "")
                     {
-                        newID = int.Parse(reader["MaHK"].ToString()) + 1;
+                        newID = int.Parse(reader[""].ToString()) + 1;
                     }
                 }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:193:17
         private void veLV_SelectionChanged(object sender, SelectionChangedEventArgs e)
         {
             Ticket item = veLV.SelectedItem as Ticket;
-            if (item != null)
+            if (item == null)
             {
                 tenHanhKhachTxt.Text = item.HkName;

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:194:13
         {
             Ticket item = veLV.SelectedItem as Ticket;
             if (item != null)
-            {
-                tenHanhKhachTxt.Text = item.HkName;
-                cmndTxt.Text = item.CMND;
-                sdtTxt.Text = item.PhoneNumber;
-                soGheTxt.Text = item.SeatNumber.ToString();
-                hangVeTxt.Text = item.FlightClass;
-                maVeBox.SelectedItem = item.TiketID;
-                maHanhKhachText.Text = item.HkID;
-            }
+            {}
         }
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:207:13
 
         public void Show(string macb, List<string> list, string userID)
         {
-            NewHD();
+            ;
             int newHK = NewHK_ID();
             ngayHD = DateTime.Now;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:221:43
                 SqlCommand sqlCommand = new SqlCommand(
                     "select [v].*, [hv].TenHangVe from [VE] [v], [HANGVE] [hv] where [v].MaVe = @mave and [hv].MaHangVe = [v].MaHangVe",
                     DataProvider.sqlConnection);
-                sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = mave;
+                sqlCommand.Parameters.Add("", SqlDbType.NVarChar).Value = mave;
                 SqlDataReader reader = sqlCommand.ExecuteReader();
                 Ticket ticket = new Ticket();

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:224:21
                 sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = mave;
                 SqlDataReader reader = sqlCommand.ExecuteReader();
                 Ticket ticket = new Ticket();
-                if (reader.HasRows)
+                if (!(reader.HasRows))
                 {
                     if (reader.Read())

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:229:51
                     if (reader.Read())
                     {
                         string mv = reader["MaVe"].ToString();
-                        int sg = int.Parse(reader["SoGhe"].ToString());
+                        int sg = int.Parse(reader[""].ToString());
                         string mhv = reader["TenHangVe"].ToString();
                         string tt = reader["TinhTrang"].ToString();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:231:44
                         string mv = reader["MaVe"].ToString();
                         int sg = int.Parse(reader["SoGhe"].ToString());
                         string mhv = reader["TenHangVe"].ToString();
-                        string tt = reader["TinhTrang"].ToString();
+                        string tt = reader[""].ToString();
                         string thk = reader["TenHK"].ToString();
                         string cmnd = reader["CMND"].ToString();

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:238:21
                         ticket = new Ticket(mv, mhv, sg, tt, "", thk, cmnd, sdt);
                     }
                 }
-                if (ve.Count == 0)
+                if (ve.Count != 0)
                 {
                     ticket.HkID = newHK.ToString();

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:239:17
                     }
                 }
                 if (ve.Count == 0)
-                {
-                    ticket.HkID = newHK.ToString();
-                }
+                {}
                 else
                 {

[NoCoverage] PreIncrementExpression to PreDecrementExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:244:36
                 }
                 else
                 {
-                    ticket.HkID = (++newHK).ToString();
+                    ticket.HkID = (--newHK).ToString();
                 }
                 ve.Add(ticket);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:246:17
                 {
                     ticket.HkID = (++newHK).ToString();
                 }
-                ve.Add(ticket);
+                ;
                 DataProvider.sqlConnection.Close();
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:247:17
                     ticket.HkID = (++newHK).ToString();
                 }
                 ve.Add(ticket);
-                DataProvider.sqlConnection.Close();
+                ;
             }
             veLV.ItemsSource = ve;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:258:39
                 "from [CHUYENBAY] [c], [SANBAY] [s1], [SANBAY] [s2] " +
                 "where [c].MaChuyenBay = @macb and [s1].MaSanBay = [c].SanBayDi and [s2].MaSanBay = [c].SanBayDen",
                 DataProvider.sqlConnection);
-            sqlcommand.Parameters.Add("@macb", SqlDbType.NVarChar).Value = macb;
+            sqlcommand.Parameters.Add("", SqlDbType.NVarChar).Value = macb;
             SqlDataReader rd = sqlcommand.ExecuteReader();
             if (rd.HasRows)

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:260:17
                 DataProvider.sqlConnection);
             sqlcommand.Parameters.Add("@macb", SqlDbType.NVarChar).Value = macb;
             SqlDataReader rd = sqlcommand.ExecuteReader();
-            if (rd.HasRows)
+            if (!(rd.HasRows))
             {
                 if (rd.Read())

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:262:21
             SqlDataReader rd = sqlcommand.ExecuteReader();
             if (rd.HasRows)
             {
-                if (rd.Read())
+                if (!(rd.Read()))
                 {
                     tuTxt.Text = rd["sbDi"].ToString();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:266:80
                 {
                     tuTxt.Text = rd["sbDi"].ToString();
                     denTxt.Text = rd["sbDen"].ToString();
-                    ngayGiotxt.Text = rd["NgayKhoiHanh"].ToString() + " " + rd["ThoiGianXuatPhat"].ToString();
+                    ngayGiotxt.Text = rd["NgayKhoiHanh"].ToString() + " " + rd[""].ToString();
                 }
             }            

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:272:13
             DataProvider.sqlConnection.Close();
 
             maVeBox.SelectedIndex = 0;
-            TienVe();
+            ;
         }
 

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:276:9
         }
 
         private void cmndTxt_PreviewTextInput(object sender, TextCompositionEventArgs e)
-        {
-            Regex regex = new Regex("[^0-9]+");
-            e.Handled = regex.IsMatch(e.Text);
-        }
+        {}
 
         private void sdtTxt_PreviewTextInput(object sender, TextCompositionEventArgs e)

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:282:9
         }
 
         private void sdtTxt_PreviewTextInput(object sender, TextCompositionEventArgs e)
-        {
-            Regex regex = new Regex("[^0-9]+");
-            e.Handled = regex.IsMatch(e.Text);
-        }
+        {}
 
         private void tenHanhKhachTxt_PreviewTextInput(object sender, TextCompositionEventArgs e)

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:288:9
         }
 
         private void tenHanhKhachTxt_PreviewTextInput(object sender, TextCompositionEventArgs e)
-        {
-            Regex regex = new Regex("[^a-zA-Z]+");
-            e.Handled = regex.IsMatch(e.Text);
-        }
+        {}
 
         private bool CheckInfor()

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:297:21
         {
             foreach (Ticket item in ve)
             {
-                if (item.HkName == "")
+                if (item.HkName != "")
                     return false;
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:297:36
         {
             foreach (Ticket item in ve)
             {
-                if (item.HkName == "")
+                if (item.HkName == "Stryker was here!")
                     return false;
             }

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:298:28
             foreach (Ticket item in ve)
             {
                 if (item.HkName == "")
-                    return false;
+                    return true;
             }
             return true;

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:305:17
 
         private void btnTTSau_Click(object sender, RoutedEventArgs e)
         {
-            if (!CheckInfor())
+            if (CheckInfor())
             {
                 MessageBox.Show("Vui lòng nhập đầy đủ thông tin vé!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:307:17
         {
             if (!CheckInfor())
             {
-                MessageBox.Show("Vui lòng nhập đầy đủ thông tin vé!");
+                ;
             }
             else

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:307:33
         {
             if (!CheckInfor())
             {
-                MessageBox.Show("Vui lòng nhập đầy đủ thông tin vé!");
+                MessageBox.Show("");
             }
             else

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:314:13
                 //ko đặt vé nếu quá hạn chậm đặt vé
                 SqlCommand _sqlCommand = new SqlCommand(
             "select GiaTri from [BANGTHAMSO] " +
-            "where convert(varchar, TenThamSo)='ThoiGianChamNhatChoPhepDatVe'", DataProvider.sqlConnection);
+            "", DataProvider.sqlConnection);
                 SqlDataAdapter _adapter = new SqlDataAdapter(_sqlCommand);
                 DataSet _ds = new DataSet();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:317:17
             "where convert(varchar, TenThamSo)='ThoiGianChamNhatChoPhepDatVe'", DataProvider.sqlConnection);
                 SqlDataAdapter _adapter = new SqlDataAdapter(_sqlCommand);
                 DataSet _ds = new DataSet();
-                _adapter.Fill(_ds);
+                ;
                 string _tgChamNhatDatVe = _ds.Tables[0].Rows[0][0].ToString();
                 TimeSpan tgChamNhatDatVe = TimeSpan.FromHours(double.Parse(_tgChamNhatDatVe));

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:321:33
                 string _tgChamNhatDatVe = _ds.Tables[0].Rows[0][0].ToString();
                 TimeSpan tgChamNhatDatVe = TimeSpan.FromHours(double.Parse(_tgChamNhatDatVe));
                 CultureInfo provider = CultureInfo.InvariantCulture;
-                string format = "dd/MM/yyyy HH:mm";
+                string format = "";
                 DateTime dateTimeDeparture = DateTime.ParseExact(ngayGiotxt.Text, format, provider);
                 DateTime dateTimeNow = DateTime.Now;

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:324:21
                 string format = "dd/MM/yyyy HH:mm";
                 DateTime dateTimeDeparture = DateTime.ParseExact(ngayGiotxt.Text, format, provider);
                 DateTime dateTimeNow = DateTime.Now;
-                if (dateTimeDeparture - dateTimeNow - tgChamNhatDatVe > TimeSpan.Zero)
+                if (dateTimeDeparture - dateTimeNow - tgChamNhatDatVe < TimeSpan.Zero)
                 {
                     MessageBoxResult result = MessageBox.Show("Bạn có chắc chắn muốn đặt vé?", "", MessageBoxButton.YesNo);

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:324:21
                 string format = "dd/MM/yyyy HH:mm";
                 DateTime dateTimeDeparture = DateTime.ParseExact(ngayGiotxt.Text, format, provider);
                 DateTime dateTimeNow = DateTime.Now;
-                if (dateTimeDeparture - dateTimeNow - tgChamNhatDatVe > TimeSpan.Zero)
+                if (dateTimeDeparture - dateTimeNow - tgChamNhatDatVe >= TimeSpan.Zero)
                 {
                     MessageBoxResult result = MessageBox.Show("Bạn có chắc chắn muốn đặt vé?", "", MessageBoxButton.YesNo);

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:326:96
                 DateTime dateTimeNow = DateTime.Now;
                 if (dateTimeDeparture - dateTimeNow - tgChamNhatDatVe > TimeSpan.Zero)
                 {
-                    MessageBoxResult result = MessageBox.Show("Bạn có chắc chắn muốn đặt vé?", "", MessageBoxButton.YesNo);
+                    MessageBoxResult result = MessageBox.Show("Bạn có chắc chắn muốn đặt vé?", "Stryker was here!", MessageBoxButton.YesNo);
                     if (result == MessageBoxResult.Yes)
                     {

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:327:25
                 if (dateTimeDeparture - dateTimeNow - tgChamNhatDatVe > TimeSpan.Zero)
                 {
                     MessageBoxResult result = MessageBox.Show("Bạn có chắc chắn muốn đặt vé?", "", MessageBoxButton.YesNo);
-                    if (result == MessageBoxResult.Yes)
+                    if (result != MessageBoxResult.Yes)
                     {
                         DataProvider.sqlConnection.Open();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:336:51
                         sqlCommand.Parameters.Add("@mahd", SqlDbType.NVarChar).Value = maHoaDonTxt.Text;
                         sqlCommand.Parameters.Add("@ngay", SqlDbType.DateTime).Value = ngayHD;
                         sqlCommand.Parameters.Add("@tien", SqlDbType.Int).Value = int.Parse(tienTxt.Text.ToString());
-                        sqlCommand.Parameters.Add("@matk", SqlDbType.NVarChar).Value = maTKTTTxt.Text;
+                        sqlCommand.Parameters.Add("", SqlDbType.NVarChar).Value = maTKTTTxt.Text;
                         sqlCommand.ExecuteNonQuery();
                         DataProvider.sqlConnection.Close();
