[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:337:25
                         sqlCommand.Parameters.Add("@ngay", SqlDbType.DateTime).Value = ngayHD;
                         sqlCommand.Parameters.Add("@tien", SqlDbType.Int).Value = int.Parse(tienTxt.Text.ToString());
                         sqlCommand.Parameters.Add("@matk", SqlDbType.NVarChar).Value = maTKTTTxt.Text;
-                        sqlCommand.ExecuteNonQuery();
+                        ;
                         DataProvider.sqlConnection.Close();
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:338:25
                         sqlCommand.Parameters.Add("@tien", SqlDbType.Int).Value = int.Parse(tienTxt.Text.ToString());
                         sqlCommand.Parameters.Add("@matk", SqlDbType.NVarChar).Value = maTKTTTxt.Text;
                         sqlCommand.ExecuteNonQuery();
-                        DataProvider.sqlConnection.Close();
+                        ;
 
                         SaveVe("BOOKED");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:340:25
                         sqlCommand.ExecuteNonQuery();
                         DataProvider.sqlConnection.Close();
 
-                        SaveVe("BOOKED");
+                        ;
                         SaveCTHD();
                         //go to home screen in MainWindow

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:341:25
                         DataProvider.sqlConnection.Close();
 
                         SaveVe("BOOKED");
-                        SaveCTHD();
+                        ;
                         //go to home screen in MainWindow
                         if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:343:29
                         SaveVe("BOOKED");
                         SaveCTHD();
                         //go to home screen in MainWindow
-                        if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)
+                        if (MainWindow.curAccount.type != 1 || MainWindow.curAccount.type == 2)
                         {
                             result = MessageBox.Show("Đặt vé thành công! \nVui lòng nhắc nhở hành khách thanh toán hóa đơn trước khi chuyến bay xuất phát! \n" +

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:343:64
                         SaveVe("BOOKED");
                         SaveCTHD();
                         //go to home screen in MainWindow
-                        if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)
+                        if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type != 2)
                         {
                             result = MessageBox.Show("Đặt vé thành công! \nVui lòng nhắc nhở hành khách thanh toán hóa đơn trước khi chuyến bay xuất phát! \n" +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:346:29
                         if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)
                         {
                             result = MessageBox.Show("Đặt vé thành công! \nVui lòng nhắc nhở hành khách thanh toán hóa đơn trước khi chuyến bay xuất phát! \n" +
-                            "Phiếu đặt chỗ sẽ bị hủy nếu không được thanh toán trước giờ bay!");
+                            "");
                         }
                         else

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:353:29
                             result = MessageBox.Show("Đặt vé thành công! \nVui lòng thanh toán hóa đơn trước khi chuyến bay xuất phát! \n" +
                             "Phiếu đặt chỗ sẽ bị hủy nếu không được thanh toán trước giờ bay!");
                         }
-                        if (result == MessageBoxResult.OK)
+                        if (result != MessageBoxResult.OK)
                         {
                             GoToHomeScreen?.Invoke(this, new RoutedEventArgs());

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:355:29
                         }
                         if (result == MessageBoxResult.OK)
                         {
-                            GoToHomeScreen?.Invoke(this, new RoutedEventArgs());
+                            ;
                             this.Close();
                         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:356:29
                         if (result == MessageBoxResult.OK)
                         {
                             GoToHomeScreen?.Invoke(this, new RoutedEventArgs());
-                            this.Close();
+                            ;
                         }
                     }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:362:21
                 }
                 else
                 {
-                    MessageBox.Show("Vé phải được đặt chậm nhất trước giờ khởi hành là: " + _tgChamNhatDatVe + " giờ");
+                    ;
 
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:362:37
                 }
                 else
                 {
-                    MessageBox.Show("Vé phải được đặt chậm nhất trước giờ khởi hành là: " + _tgChamNhatDatVe + " giờ");
+                    MessageBox.Show("" + _tgChamNhatDatVe + " giờ");
 
                 }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:381:21
                 string format = "dd/MM/yyyy HH:mm";
                 DateTime dateTimeDeparture = DateTime.ParseExact(ngayGiotxt.Text, format, provider);
                 DateTime dateTimeNow = DateTime.Now;
-                if (dateTimeDeparture - dateTimeNow > TimeSpan.Zero)
+                if (dateTimeDeparture - dateTimeNow >= TimeSpan.Zero)
                 {
 

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:381:21
                 string format = "dd/MM/yyyy HH:mm";
                 DateTime dateTimeDeparture = DateTime.ParseExact(ngayGiotxt.Text, format, provider);
                 DateTime dateTimeNow = DateTime.Now;
-                if (dateTimeDeparture - dateTimeNow > TimeSpan.Zero)
+                if (dateTimeDeparture - dateTimeNow < TimeSpan.Zero)
                 {
 

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:384:108
                 if (dateTimeDeparture - dateTimeNow > TimeSpan.Zero)
                 {
 
-                    MessageBoxResult result = MessageBox.Show("Bạn có chắc chắn muốn thanh toán hóa đơn?", "", MessageBoxButton.YesNo);
+                    MessageBoxResult result = MessageBox.Show("Bạn có chắc chắn muốn thanh toán hóa đơn?", "Stryker was here!", MessageBoxButton.YesNo);
                     if (result == MessageBoxResult.Yes)
                     {

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:385:25
                 {
 
                     MessageBoxResult result = MessageBox.Show("Bạn có chắc chắn muốn thanh toán hóa đơn?", "", MessageBoxButton.YesNo);
-                    if (result == MessageBoxResult.Yes)
+                    if (result != MessageBoxResult.Yes)
                     {
                         DataProvider.sqlConnection.Open();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:391:51
                         SqlDataAdapter adapter = new SqlDataAdapter();
                         SqlCommand sqlCommand = new SqlCommand(
                             "insert into [HOADON] values (@mahd, @ngay, @tien, 'PAID', @matk)", DataProvider.sqlConnection);
-                        sqlCommand.Parameters.Add("@mahd", SqlDbType.NVarChar).Value = maHoaDonTxt.Text;
+                        sqlCommand.Parameters.Add("", SqlDbType.NVarChar).Value = maHoaDonTxt.Text;
                         sqlCommand.Parameters.Add("@ngay", SqlDbType.DateTime).Value = ngayHD;
                         sqlCommand.Parameters.Add("@tien", SqlDbType.Int).Value = int.Parse(tienTxt.Text.ToString());

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:392:51
                         SqlCommand sqlCommand = new SqlCommand(
                             "insert into [HOADON] values (@mahd, @ngay, @tien, 'PAID', @matk)", DataProvider.sqlConnection);
                         sqlCommand.Parameters.Add("@mahd", SqlDbType.NVarChar).Value = maHoaDonTxt.Text;
-                        sqlCommand.Parameters.Add("@ngay", SqlDbType.DateTime).Value = ngayHD;
+                        sqlCommand.Parameters.Add("", SqlDbType.DateTime).Value = ngayHD;
                         sqlCommand.Parameters.Add("@tien", SqlDbType.Int).Value = int.Parse(tienTxt.Text.ToString());
                         sqlCommand.Parameters.Add("@matk", SqlDbType.NVarChar).Value = maTKTTTxt.Text;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:393:51
                             "insert into [HOADON] values (@mahd, @ngay, @tien, 'PAID', @matk)", DataProvider.sqlConnection);
                         sqlCommand.Parameters.Add("@mahd", SqlDbType.NVarChar).Value = maHoaDonTxt.Text;
                         sqlCommand.Parameters.Add("@ngay", SqlDbType.DateTime).Value = ngayHD;
-                        sqlCommand.Parameters.Add("@tien", SqlDbType.Int).Value = int.Parse(tienTxt.Text.ToString());
+                        sqlCommand.Parameters.Add("", SqlDbType.Int).Value = int.Parse(tienTxt.Text.ToString());
                         sqlCommand.Parameters.Add("@matk", SqlDbType.NVarChar).Value = maTKTTTxt.Text;
                         sqlCommand.ExecuteNonQuery();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:397:25
                         sqlCommand.Parameters.Add("@matk", SqlDbType.NVarChar).Value = maTKTTTxt.Text;
                         sqlCommand.ExecuteNonQuery();
                         DataProvider.sqlConnection.Close();
-                        SaveVe("SOLD");
+                        ;
                         SaveCTHD();
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:398:25
                         sqlCommand.ExecuteNonQuery();
                         DataProvider.sqlConnection.Close();
                         SaveVe("SOLD");
-                        SaveCTHD();
+                        ;
 
                         if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:400:29
                         SaveVe("SOLD");
                         SaveCTHD();
 
-                        if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)
+                        if (!(MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2))
                         {
                             result = MessageBox.Show("Vui lòng thông báo đến hành khách vé đã được thanh toán thành công!");

[NoCoverage] Logical mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:400:29
                         SaveVe("SOLD");
                         SaveCTHD();
 
-                        if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)
+                        if (MainWindow.curAccount.type == 1 && MainWindow.curAccount.type == 2)
                         {
                             result = MessageBox.Show("Vui lòng thông báo đến hành khách vé đã được thanh toán thành công!");

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:402:54
 
                         if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)
                         {
-                            result = MessageBox.Show("Vui lòng thông báo đến hành khách vé đã được thanh toán thành công!");
+                            result = MessageBox.Show("");
                         }
                         else

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:409:29
                             result = MessageBox.Show("Thanh toán vé thành công!");
                         }
                         //go to home screen in MainWindow
-                        if (result == MessageBoxResult.OK)
+                        if (result != MessageBoxResult.OK)
                         {
                             GoToHomeScreen?.Invoke(this, new RoutedEventArgs());

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:418:21
                 }
                 else
                 {
-                    MessageBox.Show("Đã quá hạn mua vé");
+                    ;
                 }
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:430:21
                 DataProvider.sqlConnection.Open();
                 SqlDataAdapter adapter = new SqlDataAdapter();
                 SqlCommand sqlCommand = new SqlCommand(
-                    "update [VE] set MaHK = @mahk, TenHK = @tenhk, CMND = @cmnd, SDT = @sdt, TinhTrang = @tinhtrang " +
+                    "" +
                     "where MaVe = @mave", DataProvider.sqlConnection);
                 sqlCommand.Parameters.Add("@mahk", SqlDbType.NVarChar).Value = item.HkID;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:433:43
                     "update [VE] set MaHK = @mahk, TenHK = @tenhk, CMND = @cmnd, SDT = @sdt, TinhTrang = @tinhtrang " +
                     "where MaVe = @mave", DataProvider.sqlConnection);
                 sqlCommand.Parameters.Add("@mahk", SqlDbType.NVarChar).Value = item.HkID;
-                sqlCommand.Parameters.Add("@tenhk", SqlDbType.NVarChar).Value = item.HkName;
+                sqlCommand.Parameters.Add("", SqlDbType.NVarChar).Value = item.HkName;
                 sqlCommand.Parameters.Add("@cmnd", SqlDbType.NVarChar).Value = item.CMND;
                 sqlCommand.Parameters.Add("@sdt", SqlDbType.NVarChar).Value = item.PhoneNumber;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:434:43
                     "where MaVe = @mave", DataProvider.sqlConnection);
                 sqlCommand.Parameters.Add("@mahk", SqlDbType.NVarChar).Value = item.HkID;
                 sqlCommand.Parameters.Add("@tenhk", SqlDbType.NVarChar).Value = item.HkName;
-                sqlCommand.Parameters.Add("@cmnd", SqlDbType.NVarChar).Value = item.CMND;
+                sqlCommand.Parameters.Add("", SqlDbType.NVarChar).Value = item.CMND;
                 sqlCommand.Parameters.Add("@sdt", SqlDbType.NVarChar).Value = item.PhoneNumber;
                 sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = item.TiketID;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:435:43
                 sqlCommand.Parameters.Add("@mahk", SqlDbType.NVarChar).Value = item.HkID;
                 sqlCommand.Parameters.Add("@tenhk", SqlDbType.NVarChar).Value = item.HkName;
                 sqlCommand.Parameters.Add("@cmnd", SqlDbType.NVarChar).Value = item.CMND;
-                sqlCommand.Parameters.Add("@sdt", SqlDbType.NVarChar).Value = item.PhoneNumber;
+                sqlCommand.Parameters.Add("", SqlDbType.NVarChar).Value = item.PhoneNumber;
                 sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = item.TiketID;
                 sqlCommand.Parameters.Add("@tinhtrang", SqlDbType.NVarChar).Value = tinhtrang;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:438:17
                 sqlCommand.Parameters.Add("@sdt", SqlDbType.NVarChar).Value = item.PhoneNumber;
                 sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = item.TiketID;
                 sqlCommand.Parameters.Add("@tinhtrang", SqlDbType.NVarChar).Value = tinhtrang;
-                sqlCommand.ExecuteNonQuery();
+                ;
                 DataProvider.sqlConnection.Close();
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:445:13
         private void SaveCTHD()
         {
            int count = 1;
-            DataProvider.sqlConnection.Open();
+            ;
             SqlCommand sqlCommand = new SqlCommand("select count(*) SL from [CTHD]", DataProvider.sqlConnection);
             SqlDataReader rd = sqlCommand.ExecuteReader();

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:448:17
             DataProvider.sqlConnection.Open();
             SqlCommand sqlCommand = new SqlCommand("select count(*) SL from [CTHD]", DataProvider.sqlConnection);
             SqlDataReader rd = sqlCommand.ExecuteReader();
-            if (rd.HasRows)
+            if (!(rd.HasRows))
             {
                 if (rd.Read())

[NoCoverage] Arithmetic mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:452:29
             {
                 if (rd.Read())
                 {
-                    count = int.Parse(rd["SL"].ToString()) + 1;
+                    count = int.Parse(rd["SL"].ToString()) - 1;
                 }
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:452:42
             {
                 if (rd.Read())
                 {
-                    count = int.Parse(rd["SL"].ToString()) + 1;
+                    count = int.Parse(rd[""].ToString()) + 1;
                 }
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:456:13
                 }
             }
           
-            DataProvider.sqlConnection.Close();
+            ;
 
             // SqlCommand _sqlCommand = new SqlCommand(

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:476:17
                 sqlCommand.Parameters.Add("@macthd", SqlDbType.NVarChar).Value = ID.ToString() + item.TiketID;
                 sqlCommand.Parameters.Add("@mahd", SqlDbType.NVarChar).Value = maHoaDonTxt.Text;
                 sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = item.TiketID;
-                sqlCommand.ExecuteNonQuery();
+                ;
                 DataProvider.sqlConnection.Close();
                 i++;

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:478:17
                 sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = item.TiketID;
                 sqlCommand.ExecuteNonQuery();
                 DataProvider.sqlConnection.Close();
-                i++;
+                i--;
             }
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:478:17
                 sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = item.TiketID;
                 sqlCommand.ExecuteNonQuery();
                 DataProvider.sqlConnection.Close();
-                i++;
+                ;
             }
         }
