[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSanBay.xaml.cs:36:17
             InitializeComponent();
             SanbayDataGrid = sanbayDataGrid;
             this.thaotac = thaotac;
-            if (thaotac == 1)
+            if (thaotac != 1)
             {
                 headertxt.Text = "Sửa sân bay";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSanBay.xaml.cs:53:52
         public void loadDatatoTable()
         {
             string query = "SELECT * FROM SANBAY";
-            SqlParameter param1 = new SqlParameter("", "");
+            SqlParameter param1 = new SqlParameter("Stryker was here!", "");
             DataTable dt;
             using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text, param1))

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSanBay.xaml.cs:70:31
                 sanbayclass sb = new sanbayclass();
                 sb.STT = stt.ToString();
                 sb.maSB = dr["MaSanBay"].ToString();
-                sb.tenSB = dr["TenSanBay"].ToString();
+                sb.tenSB = dr[""].ToString();
                 sb.tinh = dr["Tinh"].ToString();
                 SanbayDataGrid.Items.Add(sb);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSanBay.xaml.cs:72:17
                 sb.maSB = dr["MaSanBay"].ToString();
                 sb.tenSB = dr["TenSanBay"].ToString();
                 sb.tinh = dr["Tinh"].ToString();
-                SanbayDataGrid.Items.Add(sb);
+                ;
                 stt++;
             }

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSanBay.xaml.cs:73:17
                 sb.tenSB = dr["TenSanBay"].ToString();
                 sb.tinh = dr["Tinh"].ToString();
                 SanbayDataGrid.Items.Add(sb);
-                stt++;
+                stt--;
             }
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSanBay.xaml.cs:73:17
                 sb.tenSB = dr["TenSanBay"].ToString();
                 sb.tinh = dr["Tinh"].ToString();
                 SanbayDataGrid.Items.Add(sb);
-                stt++;
+                ;
             }
         }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSanBay.xaml.cs:81:31
             MaSB = masanbayTxb.Text;
             TenSB = tensanbayTxb.Text;
             Tinh = tinhTxb.Text;
-            if (MaSB == "" || TenSB == "" || Tinh == "")
+            if (MaSB == "" || TenSB != "" || Tinh == "")
             {
                 MessageBox.Show("Vui lòng nhập đầy đủ thông tin!");

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSanBay.xaml.cs:81:17
             MaSB = masanbayTxb.Text;
             TenSB = tensanbayTxb.Text;
             Tinh = tinhTxb.Text;
-            if (MaSB == "" || TenSB == "" || Tinh == "")
+            if (!(MaSB == "" || TenSB == "" || Tinh == ""))
             {
                 MessageBox.Show("Vui lòng nhập đầy đủ thông tin!");

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSanBay.xaml.cs:89:51
             if (thaotac == 0)
             {
                 string s = "SELECT * From SANBAY WHERE MaSanBay = @ma";
-                SqlParameter p = new SqlParameter("@ma", MaSB);
+                SqlParameter p = new SqlParameter("", MaSB);
                 using (SqlDataReader reader = DataProvider.ExecuteReader(s, CommandType.Text, p))
                 {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSanBay.xaml.cs:94:25
                 {
                     if (reader.HasRows)
                     {
-                        MessageBox.Show("Mã sân bay đã tồn tại. ", "Dữ liệu không hợp lệ!");
+                        ;
                         return;
                     }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSanBay.xaml.cs:95:25
                     if (reader.HasRows)
                     {
                         MessageBox.Show("Mã sân bay đã tồn tại. ", "Dữ liệu không hợp lệ!");
-                        return;
+                        ;
                     }
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSanBay.xaml.cs:117:17
                 sb.maSB = MaSB;
                 sb.tenSB = TenSB;
                 sb.tinh = Tinh;
-                SanbayDataGrid.Items.Add(sb);
+                ;
 
                 SqlConnection con = DataProvider.sqlConnection;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSanBay.xaml.cs:124:91
                 {
                     con.Open();
                 }
-                SqlCommand cmd = new SqlCommand("Insert into [SANBAY] values(N'" + MaSB + "',N'" + TenSB + "', N'" + Tinh + "')", con);
+                SqlCommand cmd = new SqlCommand("Insert into [SANBAY] values(N'" + MaSB + "" + TenSB + "', N'" + Tinh + "')", con);
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSanBay.xaml.cs:143:17
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();
                 con.Close();
-                SanbayDataGrid.Items.Clear();
+                ;
                 loadDatatoTable();
                 this.Close();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSanBay.xaml.cs:144:17
                 cmd.ExecuteNonQuery();
                 con.Close();
                 SanbayDataGrid.Items.Clear();
-                loadDatatoTable();
+                ;
                 this.Close();
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSanBay.xaml.cs:145:17
                 con.Close();
                 SanbayDataGrid.Items.Clear();
                 loadDatatoTable();
-                this.Close();
+                ;
             }
 
