[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:50:17
             }
             foreach (DataRow dr in dt.Rows)
             {
-                SBTGcBox.Items.Add(dr["TenSanBay"].ToString());
+                ;
             }
             SBTGcBox.SelectedIndex = 0;

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:53:17
                 SBTGcBox.Items.Add(dr["TenSanBay"].ToString());
             }
             SBTGcBox.SelectedIndex = 0;
-            if (thaotac == 1)
+            if (thaotac != 1)
             {
                 headertxt.Text = "Sửa sân bay";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:79:52
         public void loadDatatoSBTG()
         {
             string query = "SELECT * FROM SANBAYTRUNGGIAN WHERE MaChuyenBay=@macb";
-            SqlParameter param1 = new SqlParameter("@macb", maCB);
+            SqlParameter param1 = new SqlParameter("", maCB);
             DataTable dt;
             using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text, param1))

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:101:71
                 {
                     if (reader.Read())
                     {
-                        sb.tenSB = reader.GetString(reader.GetOrdinal("TenSanBay"));
+                        sb.tenSB = reader.GetString(reader.GetOrdinal(""));
                     }
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:106:32
                 }
                 //sb.tenSB = dr["SanBayTrungGian"].ToString();
                 sb.TGdung = dr["ThoiGianDung"].ToString();
-                sb.ghichu = dr["GhiChu"].ToString();
+                sb.ghichu = dr[""].ToString();
                 SanBayTG.Items.Add(sb);
                 stt++;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:107:17
                 //sb.tenSB = dr["SanBayTrungGian"].ToString();
                 sb.TGdung = dr["ThoiGianDung"].ToString();
                 sb.ghichu = dr["GhiChu"].ToString();
-                SanBayTG.Items.Add(sb);
+                ;
                 stt++;
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:108:17
                 sb.TGdung = dr["ThoiGianDung"].ToString();
                 sb.ghichu = dr["GhiChu"].ToString();
                 SanBayTG.Items.Add(sb);
-                stt++;
+                ;
             }
         }

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:108:17
                 sb.TGdung = dr["ThoiGianDung"].ToString();
                 sb.ghichu = dr["GhiChu"].ToString();
                 SanBayTG.Items.Add(sb);
-                stt++;
+                stt--;
             }
         }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:113:24
         }
         private void Add_Click(object sender, RoutedEventArgs e)
         {
-            string s = "SELECT * From SANBAY WHERE TenSanBay = @ten";
+            string s = "";
             SqlParameter p = new SqlParameter("@ten", SBTGcBox.Text);
             using (SqlDataReader reader = DataProvider.ExecuteReader(s, CommandType.Text, p))

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:114:47
         private void Add_Click(object sender, RoutedEventArgs e)
         {
             string s = "SELECT * From SANBAY WHERE TenSanBay = @ten";
-            SqlParameter p = new SqlParameter("@ten", SBTGcBox.Text);
+            SqlParameter p = new SqlParameter("", SBTGcBox.Text);
             using (SqlDataReader reader = DataProvider.ExecuteReader(s, CommandType.Text, p))
             {

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:125:17
             // tenSB = SBTGcBox.Text;
             tgDung = thoigiandungTxb.Text;
             GhiChu = ghichuTxb.Text;
-            if (tenSB == "" || tgDung == "" || GhiChu == "")
+            if (tenSB != "" || tgDung == "" || GhiChu == "")
             {
                 MessageBox.Show("Vui lòng nhập đầy đủ thông tin!");

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:125:32
             // tenSB = SBTGcBox.Text;
             tgDung = thoigiandungTxb.Text;
             GhiChu = ghichuTxb.Text;
-            if (tenSB == "" || tgDung == "" || GhiChu == "")
+            if (tenSB == "" || tgDung != "" || GhiChu == "")
             {
                 MessageBox.Show("Vui lòng nhập đầy đủ thông tin!");

[NoCoverage] Logical mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:130:17
                 MessageBox.Show("Vui lòng nhập đầy đủ thông tin!");
                 return;
             }
-            if (SBTGcBox.Text == AddChuyenbay.tenSBdi || tenSB == AddChuyenbay.tenSBden)
+            if (SBTGcBox.Text == AddChuyenbay.tenSBdi && tenSB == AddChuyenbay.tenSBden)
             {
                 MessageBox.Show("Sân bay trung gian không được trùng với sân bay đi và sân bay đến.", "Dữ liệu không hợp lệ!");

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:130:58
                 MessageBox.Show("Vui lòng nhập đầy đủ thông tin!");
                 return;
             }
-            if (SBTGcBox.Text == AddChuyenbay.tenSBdi || tenSB == AddChuyenbay.tenSBden)
+            if (SBTGcBox.Text == AddChuyenbay.tenSBdi || tenSB != AddChuyenbay.tenSBden)
             {
                 MessageBox.Show("Sân bay trung gian không được trùng với sân bay đi và sân bay đến.", "Dữ liệu không hợp lệ!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:132:17
             }
             if (SBTGcBox.Text == AddChuyenbay.tenSBdi || tenSB == AddChuyenbay.tenSBden)
             {
-                MessageBox.Show("Sân bay trung gian không được trùng với sân bay đi và sân bay đến.", "Dữ liệu không hợp lệ!");
+                ;
                 return;
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:132:33
             }
             if (SBTGcBox.Text == AddChuyenbay.tenSBdi || tenSB == AddChuyenbay.tenSBden)
             {
-                MessageBox.Show("Sân bay trung gian không được trùng với sân bay đi và sân bay đến.", "Dữ liệu không hợp lệ!");
+                MessageBox.Show("", "Dữ liệu không hợp lệ!");
                 return;
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:133:17
             if (SBTGcBox.Text == AddChuyenbay.tenSBdi || tenSB == AddChuyenbay.tenSBden)
             {
                 MessageBox.Show("Sân bay trung gian không được trùng với sân bay đi và sân bay đến.", "Dữ liệu không hợp lệ!");
-                return;
+                ;
             }
             if (thaotac == 0)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:148:33
                         table.Load(reader);
                         foreach (DataRow dr in table.Rows)
                         {
-                            if (dr["SanBayTrungGian"].ToString() == tenSB)
+                            if (dr["SanBayTrungGian"].ToString() != tenSB)
                             {
                                 MessageBox.Show("Sân bay trung gian đã có trong chuyến bay này.", "Dữ liệu không hợp lệ!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:150:33
                         {
                             if (dr["SanBayTrungGian"].ToString() == tenSB)
                             {
-                                MessageBox.Show("Sân bay trung gian đã có trong chuyến bay này.", "Dữ liệu không hợp lệ!");
+                                ;
                                 return;
                             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:150:49
                         {
                             if (dr["SanBayTrungGian"].ToString() == tenSB)
                             {
-                                MessageBox.Show("Sân bay trung gian đã có trong chuyến bay này.", "Dữ liệu không hợp lệ!");
+                                MessageBox.Show("", "Dữ liệu không hợp lệ!");
                                 return;
                             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:151:33
                             if (dr["SanBayTrungGian"].ToString() == tenSB)
                             {
                                 MessageBox.Show("Sân bay trung gian đã có trong chuyến bay này.", "Dữ liệu không hợp lệ!");
-                                return;
+                                ;
                             }
                         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:165:17
             }
             catch
             {
-                MessageBox.Show("Vui lòng nhập thời gian dừng là một số nguyên.", "Dữ liệu không hợp lệ!");
+                ;
                 return;
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:165:83
             }
             catch
             {
-                MessageBox.Show("Vui lòng nhập thời gian dừng là một số nguyên.", "Dữ liệu không hợp lệ!");
+                MessageBox.Show("Vui lòng nhập thời gian dừng là một số nguyên.", "");
                 return;
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:166:17
             catch
             {
                 MessageBox.Show("Vui lòng nhập thời gian dừng là một số nguyên.", "Dữ liệu không hợp lệ!");
-                return;
+                ;
             }
             int TGdungtoithieu = 0;

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:184:55
                     TGdungtoida = dr.Field<int>(1);
                 }
             }
-            if (int.Parse(tgDung) < TGdungtoithieu || int.Parse(tgDung) > TGdungtoida)
+            if (int.Parse(tgDung) < TGdungtoithieu || int.Parse(tgDung) < TGdungtoida)
             {
                 string tb = TGdungtoithieu + " phút" + " - " + TGdungtoida + " phút";

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:184:17
                     TGdungtoida = dr.Field<int>(1);
                 }
             }
-            if (int.Parse(tgDung) < TGdungtoithieu || int.Parse(tgDung) > TGdungtoida)
+            if (int.Parse(tgDung) <= TGdungtoithieu || int.Parse(tgDung) > TGdungtoida)
             {
                 string tb = TGdungtoithieu + " phút" + " - " + TGdungtoida + " phút";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:186:56
             }
             if (int.Parse(tgDung) < TGdungtoithieu || int.Parse(tgDung) > TGdungtoida)
             {
-                string tb = TGdungtoithieu + " phút" + " - " + TGdungtoida + " phút";
+                string tb = TGdungtoithieu + " phút" + "" + TGdungtoida + " phút";
                 MessageBox.Show("Vui lòng nhập thời gian dừng phải phù hợp với thời gian dừng tối thiểu và tối đa đã định: " + tb, "Dữ liệu không hợp lệ!");
                 return;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:186:78
             }
             if (int.Parse(tgDung) < TGdungtoithieu || int.Parse(tgDung) > TGdungtoida)
             {
-                string tb = TGdungtoithieu + " phút" + " - " + TGdungtoida + " phút";
+                string tb = TGdungtoithieu + " phút" + " - " + TGdungtoida + "";
                 MessageBox.Show("Vui lòng nhập thời gian dừng phải phù hợp với thời gian dừng tối thiểu và tối đa đã định: " + tb, "Dữ liệu không hợp lệ!");
                 return;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:187:17
             if (int.Parse(tgDung) < TGdungtoithieu || int.Parse(tgDung) > TGdungtoida)
             {
                 string tb = TGdungtoithieu + " phút" + " - " + TGdungtoida + " phút";
-                MessageBox.Show("Vui lòng nhập thời gian dừng phải phù hợp với thời gian dừng tối thiểu và tối đa đã định: " + tb, "Dữ liệu không hợp lệ!");
+                ;
                 return;
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:187:33
             if (int.Parse(tgDung) < TGdungtoithieu || int.Parse(tgDung) > TGdungtoida)
             {
                 string tb = TGdungtoithieu + " phút" + " - " + TGdungtoida + " phút";
-                MessageBox.Show("Vui lòng nhập thời gian dừng phải phù hợp với thời gian dừng tối thiểu và tối đa đã định: " + tb, "Dữ liệu không hợp lệ!");
+                MessageBox.Show("" + tb, "Dữ liệu không hợp lệ!");
                 return;
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:188:17
             {
                 string tb = TGdungtoithieu + " phút" + " - " + TGdungtoida + " phút";
                 MessageBox.Show("Vui lòng nhập thời gian dừng phải phù hợp với thời gian dừng tối thiểu và tối đa đã định: " + tb, "Dữ liệu không hợp lệ!");
-                return;
+                ;
             }
             if (int.Parse(tgDung) >= int.Parse(AddChuyenbay.thoigianbayDC))

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:190:17
                 MessageBox.Show("Vui lòng nhập thời gian dừng phải phù hợp với thời gian dừng tối thiểu và tối đa đã định: " + tb, "Dữ liệu không hợp lệ!");
                 return;
             }
-            if (int.Parse(tgDung) >= int.Parse(AddChuyenbay.thoigianbayDC))
+            if (int.Parse(tgDung) < int.Parse(AddChuyenbay.thoigianbayDC))
             {
                 MessageBox.Show("Vui lòng nhập thời gian dừng phải bé hơn thời gian bay của chuyến bay: " + AddChuyenbay.thoigianbayDC + " phút", "Dữ liệu không hợp lệ!");

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:190:17
                 MessageBox.Show("Vui lòng nhập thời gian dừng phải phù hợp với thời gian dừng tối thiểu và tối đa đã định: " + tb, "Dữ liệu không hợp lệ!");
                 return;
             }
-            if (int.Parse(tgDung) >= int.Parse(AddChuyenbay.thoigianbayDC))
+            if (int.Parse(tgDung) > int.Parse(AddChuyenbay.thoigianbayDC))
             {
                 MessageBox.Show("Vui lòng nhập thời gian dừng phải bé hơn thời gian bay của chuyến bay: " + AddChuyenbay.thoigianbayDC + " phút", "Dữ liệu không hợp lệ!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:192:17
             }
             if (int.Parse(tgDung) >= int.Parse(AddChuyenbay.thoigianbayDC))
             {
-                MessageBox.Show("Vui lòng nhập thời gian dừng phải bé hơn thời gian bay của chuyến bay: " + AddChuyenbay.thoigianbayDC + " phút", "Dữ liệu không hợp lệ!");
+                ;
                 return;
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:193:17
             if (int.Parse(tgDung) >= int.Parse(AddChuyenbay.thoigianbayDC))
             {
                 MessageBox.Show("Vui lòng nhập thời gian dừng phải bé hơn thời gian bay của chuyến bay: " + AddChuyenbay.thoigianbayDC + " phút", "Dữ liệu không hợp lệ!");
-                return;
+                ;
             }
             int tongTG = 0;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:197:52
             }
             int tongTG = 0;
             string query9 = "SELECT * FROM SANBAYTRUNGGIAN where MaChuyenBay = @ma";
-            SqlParameter param9 = new SqlParameter("@ma", maCB);
+            SqlParameter param9 = new SqlParameter("", maCB);
             DataTable dt9;
             using (SqlDataReader reader = DataProvider.ExecuteReader(query9, CommandType.Text, param9))

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:202:21
             using (SqlDataReader reader = DataProvider.ExecuteReader(query9, CommandType.Text, param9))
             {
                 dt9 = new DataTable();
-                if (reader.HasRows)
+                if (!(reader.HasRows))
                 {
                     dt9.Load(reader);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:204:21
                 dt9 = new DataTable();
                 if (reader.HasRows)
                 {
-                    dt9.Load(reader);
+                    ;
                 }
                 foreach(DataRow dr in dt9.Rows)

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:208:21
                 }
                 foreach(DataRow dr in dt9.Rows)
                 {
-                    tongTG += int.Parse(dr["ThoiGianDung"].ToString());
+                    tongTG -= int.Parse(dr["ThoiGianDung"].ToString());
                 }
             }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:211:17
                     tongTG += int.Parse(dr["ThoiGianDung"].ToString());
                 }
             }
-            if (int.Parse(tgDung) + tongTG >= int.Parse(AddChuyenbay.thoigianbayDC) && thaotac==0)
+            if (int.Parse(tgDung) + tongTG < int.Parse(AddChuyenbay.thoigianbayDC) && thaotac==0)
             {
                 MessageBox.Show("Tổng thời gian dừng không được lớn hơn hoặc bằng thời gian bay: " + AddChuyenbay.thoigianbayDC + " phút", "Dữ liệu không hợp lệ!");

[NoCoverage] Arithmetic mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:211:17
                     tongTG += int.Parse(dr["ThoiGianDung"].ToString());
                 }
             }
-            if (int.Parse(tgDung) + tongTG >= int.Parse(AddChuyenbay.thoigianbayDC) && thaotac==0)
+            if (int.Parse(tgDung) - tongTG >= int.Parse(AddChuyenbay.thoigianbayDC) && thaotac==0)
             {
                 MessageBox.Show("Tổng thời gian dừng không được lớn hơn hoặc bằng thời gian bay: " + AddChuyenbay.thoigianbayDC + " phút", "Dữ liệu không hợp lệ!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:213:17
             }
             if (int.Parse(tgDung) + tongTG >= int.Parse(AddChuyenbay.thoigianbayDC) && thaotac==0)
             {
-                MessageBox.Show("Tổng thời gian dừng không được lớn hơn hoặc bằng thời gian bay: " + AddChuyenbay.thoigianbayDC + " phút", "Dữ liệu không hợp lệ!");
+                ;
                 return;
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:214:17
             if (int.Parse(tgDung) + tongTG >= int.Parse(AddChuyenbay.thoigianbayDC) && thaotac==0)
             {
                 MessageBox.Show("Tổng thời gian dừng không được lớn hơn hoặc bằng thời gian bay: " + AddChuyenbay.thoigianbayDC + " phút", "Dữ liệu không hợp lệ!");
-                return;
+                ;
             }
            

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:220:32
 
             if (thaotac == 0)
             {
-                string query = "SELECT * FROM SANBAYTRUNGGIAN where MaChuyenBay = @ma";
+                string query = "";
                 SqlParameter param1 = new SqlParameter("@ma", maCB);
                 DataTable dt;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:245:17
                 // sb.tenSB = tenSB;
                 sb.TGdung = tgDung;
                 sb.ghichu = GhiChu;
-                SanBayTG.Items.Add(sb);
+                ;
                 SqlConnection con = DataProvider.sqlConnection;
                 if (con.State == ConnectionState.Closed)

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:251:151
                 {
                     con.Open();
                 }
-                SqlCommand cmd = new SqlCommand("Insert into SANBAYTRUNGGIAN values(N'" + tenSB + "',N'" + maCB + "',N'" + tgDung + "',N'" + GhiChu + "')", con);
+                SqlCommand cmd = new SqlCommand("Insert into SANBAYTRUNGGIAN values(N'" + tenSB + "',N'" + maCB + "',N'" + tgDung + "',N'" + GhiChu + "", con);
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:262:38
             {
                 string MaSBTGtofix = "";
                 s = "SELECT * From SANBAY WHERE TenSanBay = @ten";
-                p = new SqlParameter("@ten", AddChuyenbay.infotofix.tenSB);
+                p = new SqlParameter("", AddChuyenbay.infotofix.tenSB);
                 using (SqlDataReader reader = DataProvider.ExecuteReader(s, CommandType.Text, p))
                 {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:279:17
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();
                 con.Close();
-                SanBayTG.Items.Clear();
+                ;
                 loadDatatoSBTG();
                 this.Close();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:280:17
                 cmd.ExecuteNonQuery();
                 con.Close();
                 SanBayTG.Items.Clear();
-                loadDatatoSBTG();
+                ;
                 this.Close();
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:281:17
                 con.Close();
                 SanBayTG.Items.Clear();
                 loadDatatoSBTG();
-                this.Close();
+                ;
             }
 
