[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:44:17
             tuyenTxt.Text = maCB;
             ngayGioTxt.Text = giobay;
 
-            if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)
+            if (MainWindow.curAccount.type != 1 || MainWindow.curAccount.type == 2)
             {
                 btnPay.Content = "Đã thanh toán";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:51:17
 
             DataProvider.sqlConnection.Open();
             SqlCommand sqlCommand = new SqlCommand(
-                "select [v].MaVe, [hv].TenHangVe, [v].SoGhe, [v].TenHK " +
+                "" +
                 "from [VE] [v], [HANGVE] [hv], [CTHD] [ct] " +
                 "where [hv].MaHangVe = [v].MaHangVe and [ct].MaHD = @maHD and [v].MaVe = [ct].MaVe"

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:52:17
             DataProvider.sqlConnection.Open();
             SqlCommand sqlCommand = new SqlCommand(
                 "select [v].MaVe, [hv].TenHangVe, [v].SoGhe, [v].TenHK " +
-                "from [VE] [v], [HANGVE] [hv], [CTHD] [ct] " +
+                "" +
                 "where [hv].MaHangVe = [v].MaHangVe and [ct].MaHD = @maHD and [v].MaVe = [ct].MaVe"
                 , DataProvider.sqlConnection);

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:53:17
             SqlCommand sqlCommand = new SqlCommand(
                 "select [v].MaVe, [hv].TenHangVe, [v].SoGhe, [v].TenHK " +
                 "from [VE] [v], [HANGVE] [hv], [CTHD] [ct] " +
-                "where [hv].MaHangVe = [v].MaHangVe and [ct].MaHD = @maHD and [v].MaVe = [ct].MaVe"
+                ""
                 , DataProvider.sqlConnection);
             sqlCommand.Parameters.Add("@maHD", SqlDbType.NVarChar).Value = maHD;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:65:44
                 {
                     string mave = reader["MaVe"].ToString();
                     string soghe = reader["SoGhe"].ToString();
-                    string hangve = reader["TenHangVe"].ToString();
+                    string hangve = reader[""].ToString();
                     string tenHK = reader["TenHK"].ToString();
                     list_ticker.Add(new SymbolTicket(mave, soghe, hangve, tenHK));

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:66:43
                     string mave = reader["MaVe"].ToString();
                     string soghe = reader["SoGhe"].ToString();
                     string hangve = reader["TenHangVe"].ToString();
-                    string tenHK = reader["TenHK"].ToString();
+                    string tenHK = reader[""].ToString();
                     list_ticker.Add(new SymbolTicket(mave, soghe, hangve, tenHK));
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:67:21
                     string soghe = reader["SoGhe"].ToString();
                     string hangve = reader["TenHangVe"].ToString();
                     string tenHK = reader["TenHK"].ToString();
-                    list_ticker.Add(new SymbolTicket(mave, soghe, hangve, tenHK));
+                    ;
                 }
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:76:55
 
         private void btnHuy_Click(object sender, RoutedEventArgs e)
         {
-            MessageBoxResult result = MessageBox.Show("Bạn có chắc chắn muốn hủy thanh toán?","",MessageBoxButton.YesNo);
+            MessageBoxResult result = MessageBox.Show("","",MessageBoxButton.YesNo);
             if (result == MessageBoxResult.Yes)
             {

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:77:17
         private void btnHuy_Click(object sender, RoutedEventArgs e)
         {
             MessageBoxResult result = MessageBox.Show("Bạn có chắc chắn muốn hủy thanh toán?","",MessageBoxButton.YesNo);
-            if (result == MessageBoxResult.Yes)
+            if (result != MessageBoxResult.Yes)
             {
                 this.Close();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:85:55
 
         private void btnPay_Click(object sender, RoutedEventArgs e)
         {
-            MessageBoxResult result = MessageBox.Show("Bạn có chắc chắn muốn thanh toán?", "", MessageBoxButton.YesNo);
+            MessageBoxResult result = MessageBox.Show("", "", MessageBoxButton.YesNo);
             if (result == MessageBoxResult.Yes)
             {

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:85:92
 
         private void btnPay_Click(object sender, RoutedEventArgs e)
         {
-            MessageBoxResult result = MessageBox.Show("Bạn có chắc chắn muốn thanh toán?", "", MessageBoxButton.YesNo);
+            MessageBoxResult result = MessageBox.Show("Bạn có chắc chắn muốn thanh toán?", "Stryker was here!", MessageBoxButton.YesNo);
             if (result == MessageBoxResult.Yes)
             {

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:86:17
         private void btnPay_Click(object sender, RoutedEventArgs e)
         {
             MessageBoxResult result = MessageBox.Show("Bạn có chắc chắn muốn thanh toán?", "", MessageBoxButton.YesNo);
-            if (result == MessageBoxResult.Yes)
+            if (result != MessageBoxResult.Yes)
             {
                 DataProvider.sqlConnection.Open();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:92:41
                 SqlCommand sqlCommand = new SqlCommand(
                     "update [VE] set TinhTrang = 'SOLD' " +
                     "where MaVe in ( select [v].MaVe from [CTHD] [ct], [VE] [v] " +
-                                        "where [v].MaVe = [ct].MaVe and [ct].MaHD = @mahd)", DataProvider.sqlConnection);
+                                        "", DataProvider.sqlConnection);
                 sqlCommand.Parameters.Add("@mahd", SqlDbType.NVarChar).Value = MaHD;
                 sqlCommand.ExecuteNonQuery();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:94:17
                     "where MaVe in ( select [v].MaVe from [CTHD] [ct], [VE] [v] " +
                                         "where [v].MaVe = [ct].MaVe and [ct].MaHD = @mahd)", DataProvider.sqlConnection);
                 sqlCommand.Parameters.Add("@mahd", SqlDbType.NVarChar).Value = MaHD;
-                sqlCommand.ExecuteNonQuery();
+                ;
                 DataProvider.sqlConnection.Close();
 

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:101:43
                 sqlCommand = new SqlCommand(
                     "update [HOADON] set TinhTrang = 'PAID' " +
                     "where MaHD = @mahd", DataProvider.sqlConnection);
-                sqlCommand.Parameters.Add("@mahd", SqlDbType.NVarChar).Value = MaHD;
+                sqlCommand.Parameters.Add("", SqlDbType.NVarChar).Value = MaHD;
                 sqlCommand.ExecuteNonQuery();
                 DataProvider.sqlConnection.Close();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:105:17
                 sqlCommand.ExecuteNonQuery();
                 DataProvider.sqlConnection.Close();
 
-                MessageBox.Show("Vui lòng thông báo đến hành khách hóa đơn đã được thanh toán thành công!");
+                ;
 
                 ReturnBookings?.Invoke(this, new RoutedEventArgs());

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:107:17
 
                 MessageBox.Show("Vui lòng thông báo đến hành khách hóa đơn đã được thanh toán thành công!");
 
-                ReturnBookings?.Invoke(this, new RoutedEventArgs());
+                ;
                 this.Close();
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:108:17
                 MessageBox.Show("Vui lòng thông báo đến hành khách hóa đơn đã được thanh toán thành công!");
 
                 ReturnBookings?.Invoke(this, new RoutedEventArgs());
-                this.Close();
+                ;
             }
         }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:114:17
         private void btnDelete_Click(object sender, RoutedEventArgs e)
         {
             MessageBoxResult result = MessageBox.Show("Hủy hóa đơn đồng nghĩa với hủy tất cả vé đã đặt trong hóa đơn.\nBạn có chắc chắn muốn hủy hóa đơn?", "Thông báo", MessageBoxButton.YesNo);
-            if (result == MessageBoxResult.Yes)
+            if (result != MessageBoxResult.Yes)
             {
                 RemoveCTHD();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:116:17
             MessageBoxResult result = MessageBox.Show("Hủy hóa đơn đồng nghĩa với hủy tất cả vé đã đặt trong hóa đơn.\nBạn có chắc chắn muốn hủy hóa đơn?", "Thông báo", MessageBoxButton.YesNo);
             if (result == MessageBoxResult.Yes)
             {
-                RemoveCTHD();
+                ;
                 RemoveHD();
                 RemoveVe();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:117:17
             if (result == MessageBoxResult.Yes)
             {
                 RemoveCTHD();
-                RemoveHD();
+                ;
                 RemoveVe();
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:118:17
             {
                 RemoveCTHD();
                 RemoveHD();
-                RemoveVe();
+                ;
 
                 if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:120:56
                 RemoveHD();
                 RemoveVe();
 
-                if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)
+                if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type != 2)
                 {
                     MessageBox.Show("Vui lòng thông báo đến hành khách hủy hóa đơn thành công!", "Thông báo");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:122:21
 
                 if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)
                 {
-                    MessageBox.Show("Vui lòng thông báo đến hành khách hủy hóa đơn thành công!", "Thông báo");
+                    ;
                 }
                 else

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:122:37
 
                 if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)
                 {
-                    MessageBox.Show("Vui lòng thông báo đến hành khách hủy hóa đơn thành công!", "Thông báo");
+                    MessageBox.Show("", "Thông báo");
                 }
                 else

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:126:21
                 }
                 else
                 {
-                    MessageBox.Show("Hủy hóa đơn thành công!", "Thông báo");
+                    ;
 
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:129:17
                     MessageBox.Show("Hủy hóa đơn thành công!", "Thông báo");
 
                 }
-                Return?.Invoke(this, new RoutedEventArgs());
+                ;
                 this.Close();
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:130:17
 
                 }
                 Return?.Invoke(this, new RoutedEventArgs());
-                this.Close();
+                ;
             }
         }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:148:17
         {
             DataProvider.sqlConnection.Open();
             SqlCommand sqlCommand = new SqlCommand(
-                "delete from [CTHD] where MaHD = @mahd", DataProvider.sqlConnection);
+                "", DataProvider.sqlConnection);
             sqlCommand.Parameters.Add("@mahd", SqlDbType.NVarChar).Value = MaHD;
             sqlCommand.ExecuteNonQuery();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:160:21
             {
                 DataProvider.sqlConnection.Open();
                 SqlCommand sqlCommand = new SqlCommand(
-                    "update [VE] set TinhTrang = 'TRONG', TenHK = NULL, CMND = NULL, SDT = NULL, MaHK = NULL" +
+                    "" +
                     " where MaVe = @mave ", DataProvider.sqlConnection);
                 sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = ticket.MaVe;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsPay.xaml.cs:163:17
                     "update [VE] set TinhTrang = 'TRONG', TenHK = NULL, CMND = NULL, SDT = NULL, MaHK = NULL" +
                     " where MaVe = @mave ", DataProvider.sqlConnection);
                 sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = ticket.MaVe;
-                sqlCommand.ExecuteNonQuery();
+                ;
                 DataProvider.sqlConnection.Close();
             }
