[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsUpdate.xaml.cs:33:9
             InitializeComponent();
         }
         private void NumberTxt_PreviewTextInput(object sender, TextCompositionEventArgs e)
-        {
-            Regex regex = new Regex("[^0-9]+");
-            e.Handled = regex.IsMatch(e.Text);
-        }
+        {}
         private void tenHanhKhachTxt_PreviewTextInput(object sender, TextCompositionEventArgs e)
         {

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsUpdate.xaml.cs:45:13
         public void ShowInforHK(string mave)
         {
             maVe = mave;
-            DataProvider.sqlConnection.Open();
+            ;
             SqlCommand sqlCommand = new SqlCommand(
                 "select [v].TenHK, [v].CMND, [v].SDT from [VE] [v] where [v].MaVe = @mave"

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsUpdate.xaml.cs:49:39
             SqlCommand sqlCommand = new SqlCommand(
                 "select [v].TenHK, [v].CMND, [v].SDT from [VE] [v] where [v].MaVe = @mave"
                 , DataProvider.sqlConnection);
-            sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = mave;
+            sqlCommand.Parameters.Add("", SqlDbType.NVarChar).Value = mave;
             SqlDataReader reader = sqlCommand.ExecuteReader();
 

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsUpdate.xaml.cs:56:51
             {
                 while (reader.Read())
                 {
-                    tenHanhKhachTxt.Text = reader["TenHK"].ToString();
+                    tenHanhKhachTxt.Text = reader[""].ToString();
                     cmndTxt.Text = reader["CMND"].ToString();
                     sdtTxt.Text = reader["SDT"].ToString();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsUpdate.xaml.cs:68:17
             bool check = true;
             DataProvider.sqlConnection.Open();
             SqlCommand sqlCommand = new SqlCommand(
-                "select [v].CMND, [v].MaVe from [VE] [v] where [v].CMND = @cmnd ", DataProvider.sqlConnection);
+                "", DataProvider.sqlConnection);
             sqlCommand.Parameters.Add("@cmnd", SqlDbType.NVarChar).Value = cmndTxt.Text;
             SqlDataReader reader = sqlCommand.ExecuteReader();

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsUpdate.xaml.cs:76:47
                 if (reader.Read())
                 {
                     string mv = reader["MaVe"].ToString();
-                    if (mv != maVe) { check = false; }
+                    if (mv != maVe) { check = true; }
                 }
             }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsUpdate.xaml.cs:76:25
                 if (reader.Read())
                 {
                     string mv = reader["MaVe"].ToString();
-                    if (mv != maVe) { check = false; }
+                    if (mv == maVe) { check = false; }
                 }
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsUpdate.xaml.cs:86:17
         {
             if (!CheckCMND())
             {
-                MessageBox.Show("Thông tin hành khách không hợp lệ.\nCMND đã được đăng ký cho một vé khác.\nVui lòng kiểm tra và sửa đổi thông tin hành khách!");
+                ;
             }
             else

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsUpdate.xaml.cs:86:33
         {
             if (!CheckCMND())
             {
-                MessageBox.Show("Thông tin hành khách không hợp lệ.\nCMND đã được đăng ký cho một vé khác.\nVui lòng kiểm tra và sửa đổi thông tin hành khách!");
+                MessageBox.Show("");
             }
             else

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsUpdate.xaml.cs:96:43
                     "where MaVe = @mave", DataProvider.sqlConnection);
                 sqlCommand.Parameters.Add("@tenhk", SqlDbType.NVarChar).Value = tenHanhKhachTxt.Text;
                 sqlCommand.Parameters.Add("@cmnd", SqlDbType.NVarChar).Value = cmndTxt.Text;
-                sqlCommand.Parameters.Add("@sdt", SqlDbType.NVarChar).Value = sdtTxt.Text;
+                sqlCommand.Parameters.Add("", SqlDbType.NVarChar).Value = sdtTxt.Text;
                 sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = maVe;
                 sqlCommand.ExecuteNonQuery();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsUpdate.xaml.cs:98:17
                 sqlCommand.Parameters.Add("@cmnd", SqlDbType.NVarChar).Value = cmndTxt.Text;
                 sqlCommand.Parameters.Add("@sdt", SqlDbType.NVarChar).Value = sdtTxt.Text;
                 sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = maVe;
-                sqlCommand.ExecuteNonQuery();
+                ;
                 DataProvider.sqlConnection.Close();
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsUpdate.xaml.cs:103:21
 
                 if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)
                 {
-                    MessageBox.Show("Vui lòng thông báo đến hành khách cập nhật thông tin hành khách thành công!", "Thông báo");
+                    ;
                 }
                 else

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsUpdate.xaml.cs:107:21
                 }
                 else
                 {
-                    MessageBox.Show("Cập nhật thông tin hành khách thành công!", "Thông báo");
+                    ;
                 }
 

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsUpdate.xaml.cs:107:37
                 }
                 else
                 {
-                    MessageBox.Show("Cập nhật thông tin hành khách thành công!", "Thông báo");
+                    MessageBox.Show("", "Thông báo");
                 }
 

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsUpdate.xaml.cs:118:55
         private void tbnCancle_Click(object sender, RoutedEventArgs e)
         {
 
-            MessageBoxResult result = MessageBox.Show("Bạn có chắc chắn muốn hủy cập nhật thông tin hành khách?", "Thông báo", MessageBoxButton.YesNo);
+            MessageBoxResult result = MessageBox.Show("", "Thông báo", MessageBoxButton.YesNo);
             if (result == MessageBoxResult.Yes)
             {

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsUpdate.xaml.cs:118:115
         private void tbnCancle_Click(object sender, RoutedEventArgs e)
         {
 
-            MessageBoxResult result = MessageBox.Show("Bạn có chắc chắn muốn hủy cập nhật thông tin hành khách?", "Thông báo", MessageBoxButton.YesNo);
+            MessageBoxResult result = MessageBox.Show("Bạn có chắc chắn muốn hủy cập nhật thông tin hành khách?", "", MessageBoxButton.YesNo);
             if (result == MessageBoxResult.Yes)
             {

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/BookingsUpdate.xaml.cs:119:17
         {
 
             MessageBoxResult result = MessageBox.Show("Bạn có chắc chắn muốn hủy cập nhật thông tin hành khách?", "Thông báo", MessageBoxButton.YesNo);
-            if (result == MessageBoxResult.Yes)
+            if (result != MessageBoxResult.Yes)
             {
                 this.Close();
