[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:29:31
     /// </summary>
     public partial class FareClassForm : Window
     {
-        public bool isSaved = false;
+        public bool isSaved = true;
         public FareClassForm()
         {

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:37:23
 
         private void BtnSave_click(object sender, RoutedEventArgs e)
         {
-            isSaved = true;
+            isSaved = false;
             if (Name.Text == "" || Percentage.Text == "" )
             {

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:38:17
         private void BtnSave_click(object sender, RoutedEventArgs e)
         {
             isSaved = true;
-            if (Name.Text == "" || Percentage.Text == "" )
+            if (Name.Text != "" || Percentage.Text == "" )
             {
                 txblError.Text = "Vui lòng nhập đầy đủ thông tin!";

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:38:36
         private void BtnSave_click(object sender, RoutedEventArgs e)
         {
             isSaved = true;
-            if (Name.Text == "" || Percentage.Text == "" )
+            if (Name.Text == "" || Percentage.Text != "" )
             {
                 txblError.Text = "Vui lòng nhập đầy đủ thông tin!";

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:41:17
             if (Name.Text == "" || Percentage.Text == "" )
             {
                 txblError.Text = "Vui lòng nhập đầy đủ thông tin!";
-                return;
+                ;
             }
             try

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:46:21
             try
             {
                 int p = int.Parse(Percentage.Text);
-                if (p <= 0)
+                if (p > 0)
                 {
                     MessageBox.Show("Vui lòng nhập tỷ lệ phần trăm là một số nguyên dương.", "Dữ liệu không hợp lệ!");

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:46:21
             try
             {
                 int p = int.Parse(Percentage.Text);
-                if (p <= 0)
+                if (p < 0)
                 {
                     MessageBox.Show("Vui lòng nhập tỷ lệ phần trăm là một số nguyên dương.", "Dữ liệu không hợp lệ!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:48:21
                 int p = int.Parse(Percentage.Text);
                 if (p <= 0)
                 {
-                    MessageBox.Show("Vui lòng nhập tỷ lệ phần trăm là một số nguyên dương.", "Dữ liệu không hợp lệ!");
+                    ;
                     return;
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:48:94
                 int p = int.Parse(Percentage.Text);
                 if (p <= 0)
                 {
-                    MessageBox.Show("Vui lòng nhập tỷ lệ phần trăm là một số nguyên dương.", "Dữ liệu không hợp lệ!");
+                    MessageBox.Show("Vui lòng nhập tỷ lệ phần trăm là một số nguyên dương.", "");
                     return;
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:49:21
                 if (p <= 0)
                 {
                     MessageBox.Show("Vui lòng nhập tỷ lệ phần trăm là một số nguyên dương.", "Dữ liệu không hợp lệ!");
-                    return;
+                    ;
                 }
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:54:17
             }
             catch (Exception ex)
             {
-                MessageBox.Show("Vui lòng nhập tỷ lệ phần trăm là một số nguyên.", "Dữ liệu không hợp lệ!");
+                ;
                 return;
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:55:17
             catch (Exception ex)
             {
                 MessageBox.Show("Vui lòng nhập tỷ lệ phần trăm là một số nguyên.", "Dữ liệu không hợp lệ!");
-                return;
+                ;
             }
             SqlConnection sqlCon = DataProvider.sqlConnection;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:63:36
                 if (sqlCon.State == ConnectionState.Closed)
                 {
                     sqlCon.Open();
-                    String query = "SELECT COUNT(1) FROM [HANGVE] WHERE TenHangVe=@name";
+                    String query = "";
                     SqlCommand sqlCmd = new SqlCommand(query, sqlCon);
                     sqlCmd.CommandType = CommandType.Text;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:66:21
                     String query = "SELECT COUNT(1) FROM [HANGVE] WHERE TenHangVe=@name";
                     SqlCommand sqlCmd = new SqlCommand(query, sqlCon);
                     sqlCmd.CommandType = CommandType.Text;
-                    sqlCmd.Parameters.AddWithValue("@name", Name.Text);
+                    ;
                     int count = Convert.ToInt32(sqlCmd.ExecuteScalar());
                     if (count > 0)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:68:25
                     sqlCmd.CommandType = CommandType.Text;
                     sqlCmd.Parameters.AddWithValue("@name", Name.Text);
                     int count = Convert.ToInt32(sqlCmd.ExecuteScalar());
-                    if (count > 0)
+                    if (count >= 0)
                     {
                         txblError.Text = "Hạng vé này đã tồn tại!";

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:71:25
                     if (count > 0)
                     {
                         txblError.Text = "Hạng vé này đã tồn tại!";
-                        return;
+                        ;
                     }
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:82:95
             try
             {
                 sqlCon.Open();
-                SqlCommand cmd = new SqlCommand("Insert into [HANGVE] values('" + "HV" + ID + "',N'" + Name.Text + "','" + Percentage.Text + "')", sqlCon);
+                SqlCommand cmd = new SqlCommand("Insert into [HANGVE] values('" + "HV" + ID + "" + Name.Text + "','" + Percentage.Text + "')", sqlCon);
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:82:83
             try
             {
                 sqlCon.Open();
-                SqlCommand cmd = new SqlCommand("Insert into [HANGVE] values('" + "HV" + ID + "',N'" + Name.Text + "','" + Percentage.Text + "')", sqlCon);
+                SqlCommand cmd = new SqlCommand("Insert into [HANGVE] values('" + "" + ID + "',N'" + Name.Text + "','" + Percentage.Text + "')", sqlCon);
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:86:17
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();
                 sqlCon.Close();
-                this.Close();
+                ;
                 MessageBox.Show("Thêm hạng vé thành công!", "Success");
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:87:17
                 cmd.ExecuteNonQuery();
                 sqlCon.Close();
                 this.Close();
-                MessageBox.Show("Thêm hạng vé thành công!", "Success");
+                ;
             }
             catch (Exception ex){ Console.WriteLine(ex); }                      

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:87:61
                 cmd.ExecuteNonQuery();
                 sqlCon.Close();
                 this.Close();
-                MessageBox.Show("Thêm hạng vé thành công!", "Success");
+                MessageBox.Show("Thêm hạng vé thành công!", "");
             }
             catch (Exception ex){ Console.WriteLine(ex); }                      
