[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/SendCodeForm.xaml.cs:36:17
         public static string to;
         private void SendCode_Click(object sender, RoutedEventArgs e)
         {
-            if (!Regex.IsMatch(txbEmail.Text, @"^[a-zA-Z][\w\.-]*[a-zA-Z0-9]@[a-zA-Z0-9][\w\.-]*[a-zA-Z0-9]\.[a-zA-Z][a-zA-Z\.]*[a-zA-Z]$"))
+            if (Regex.IsMatch(txbEmail.Text, @"^[a-zA-Z][\w\.-]*[a-zA-Z0-9]@[a-zA-Z0-9][\w\.-]*[a-zA-Z0-9]\.[a-zA-Z][a-zA-Z\.]*[a-zA-Z]$"))
             {
                 Errortxt.Text = "Email không hợp lệ!";

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/SendCodeForm.xaml.cs:39:17
             if (!Regex.IsMatch(txbEmail.Text, @"^[a-zA-Z][\w\.-]*[a-zA-Z0-9]@[a-zA-Z0-9][\w\.-]*[a-zA-Z0-9]\.[a-zA-Z][a-zA-Z\.]*[a-zA-Z]$"))
             {
                 Errortxt.Text = "Email không hợp lệ!";
-                txbEmail.Focus();
+                ;
                 return;
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/SendCodeForm.xaml.cs:40:17
             {
                 Errortxt.Text = "Email không hợp lệ!";
                 txbEmail.Focus();
-                return;
+                ;
             }
             SqlConnection sqlCon = DataProvider.sqlConnection;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/SendCodeForm.xaml.cs:51:21
                     String query = "SELECT COUNT(1) FROM [TaiKhoan] WHERE Email=@email";
                     SqlCommand sqlCmd = new SqlCommand(query, sqlCon);
                     sqlCmd.CommandType = CommandType.Text;
-                    sqlCmd.Parameters.AddWithValue("@email", txbEmail.Text);
+                    ;
                     int count = Convert.ToInt32(sqlCmd.ExecuteScalar());
                     if (count < 1)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/SendCodeForm.xaml.cs:53:25
                     sqlCmd.CommandType = CommandType.Text;
                     sqlCmd.Parameters.AddWithValue("@email", txbEmail.Text);
                     int count = Convert.ToInt32(sqlCmd.ExecuteScalar());
-                    if (count < 1)
+                    if (count <= 1)
                     {
                         Errortxt.Text = "Email này không tồn tại trong danh sách tài khoản!";

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/SendCodeForm.xaml.cs:53:25
                     sqlCmd.CommandType = CommandType.Text;
                     sqlCmd.Parameters.AddWithValue("@email", txbEmail.Text);
                     int count = Convert.ToInt32(sqlCmd.ExecuteScalar());
-                    if (count < 1)
+                    if (!(count < 1))
                     {
                         Errortxt.Text = "Email này không tồn tại trong danh sách tài khoản!";

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/SendCodeForm.xaml.cs:56:25
                     if (count < 1)
                     {
                         Errortxt.Text = "Email này không tồn tại trong danh sách tài khoản!";
-                        return;
+                        ;
                     }
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/SendCodeForm.xaml.cs:69:23
             to = txbEmail.Text;
             from = "zincat510@gmail.com";
             pass = "jywghiutqphlbaun";
-            message = "Mã xác thực tài khoản ứng dụng Quản Lý Bán Vé Máy Bay của bạn là: " + randomCode;
+            message = "" + randomCode;
             mailMessage.To.Add(to);
             mailMessage.From = new MailAddress(from);

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/SendCodeForm.xaml.cs:70:13
             from = "zincat510@gmail.com";
             pass = "jywghiutqphlbaun";
             message = "Mã xác thực tài khoản ứng dụng Quản Lý Bán Vé Máy Bay của bạn là: " + randomCode;
-            mailMessage.To.Add(to);
+            ;
             mailMessage.From = new MailAddress(from);
             mailMessage.Body = message;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/SendCodeForm.xaml.cs:74:52
             mailMessage.From = new MailAddress(from);
             mailMessage.Body = message;
             mailMessage.Subject = "Mã xác thực";
-            SmtpClient smtpClient = new SmtpClient("smtp.gmail.com");
+            SmtpClient smtpClient = new SmtpClient("");
             smtpClient.EnableSsl = true;
             smtpClient.Port = 587;

[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/SendCodeForm.xaml.cs:75:36
             mailMessage.Body = message;
             mailMessage.Subject = "Mã xác thực";
             SmtpClient smtpClient = new SmtpClient("smtp.gmail.com");
-            smtpClient.EnableSsl = true;
+            smtpClient.EnableSsl = false;
             smtpClient.Port = 587;
             smtpClient.DeliveryMethod = SmtpDeliveryMethod.Network;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/SendCodeForm.xaml.cs:81:17
             smtpClient.Credentials = new NetworkCredential(from, pass);
             try
             {
-                smtpClient.Send(mailMessage);
+                ;
                 MessageBox.Show("Đã gửi mã xác thực vào email!");
                 email.Visibility = Visibility.Hidden;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/SendCodeForm.xaml.cs:82:17
             try
             {
                 smtpClient.Send(mailMessage);
-                MessageBox.Show("Đã gửi mã xác thực vào email!");
+                ;
                 email.Visibility = Visibility.Hidden;
                 verifyCode.Visibility = Visibility.Visible;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/SendCodeForm.xaml.cs:82:33
             try
             {
                 smtpClient.Send(mailMessage);
-                MessageBox.Show("Đã gửi mã xác thực vào email!");
+                MessageBox.Show("");
                 email.Visibility = Visibility.Hidden;
                 verifyCode.Visibility = Visibility.Visible;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/SendCodeForm.xaml.cs:88:36
                 btnsendcode.Visibility = Visibility.Hidden;
                 btnverifycode.Visibility = Visibility.Visible;
             }
-            catch (Exception ex) { MessageBox.Show(ex.Message); }
+            catch (Exception ex) { ; }
         }
 

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/SendCodeForm.xaml.cs:93:17
 
         private void VerifyCode_Click(object sender, RoutedEventArgs e)
         {
-            if (randomCode == txbCode.Text)
+            if (randomCode != txbCode.Text)
             {
                 this.Hide();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/SendCodeForm.xaml.cs:95:17
         {
             if (randomCode == txbCode.Text)
             {
-                this.Hide();
+                ;
                 ChangePassword changePasswordwd = new ChangePassword();
                 changePasswordwd.ShowDialog();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/SendCodeForm.xaml.cs:97:17
             {
                 this.Hide();
                 ChangePassword changePasswordwd = new ChangePassword();
-                changePasswordwd.ShowDialog();
+                ;
                 this.Close();
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/SendCodeForm.xaml.cs:98:17
                 this.Hide();
                 ChangePassword changePasswordwd = new ChangePassword();
                 changePasswordwd.ShowDialog();
-                this.Close();
+                ;
             }
             else

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/SendCodeForm.xaml.cs:112:17
         }
         private void Grid_MouseDown(object sender, MouseButtonEventArgs e)
         {
-            if (e.ChangedButton == MouseButton.Left)
+            if (e.ChangedButton != MouseButton.Left)
             {
                 this.DragMove();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/SendCodeForm.xaml.cs:114:17
         {
             if (e.ChangedButton == MouseButton.Left)
             {
-                this.DragMove();
+                ;
             }
         }
