[NoCoverage] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/UserForm.xaml.cs:28:31
     public partial class UserForm : Window
     {
         int action;
-        public bool isSaved = false;
+        public bool isSaved = true;
         string userId;
         public UserForm(int action)

[NoCoverage] Arithmetic mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/UserForm.xaml.cs:47:36
             Username.Text = account.username;
             Email.Text = account.email;
             PasswordBox1.Password = PasswordBox2.Password = account.password;
-            cbRBAC.SelectedIndex = account.type - 1;
+            cbRBAC.SelectedIndex = account.type + 1;
         }
 

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/UserForm.xaml.cs:53:37
         private void BtnSave_click(object sender, RoutedEventArgs e)
         {
             isSaved= true;
-            if (Email.Text == "" || Displayname.Text == "" || Username.Text == "" || PasswordBox1.Password == "" || PasswordBox2.Password == "" || cbRBAC.SelectedIndex == -1)
+            if (Email.Text == "" || Displayname.Text != "" || Username.Text == "" || PasswordBox1.Password == "" || PasswordBox2.Password == "" || cbRBAC.SelectedIndex == -1)
             {
                 txblError.Text = "Vui lòng nhập đầy đủ thông tin!";

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/UserForm.xaml.cs:53:17
         private void BtnSave_click(object sender, RoutedEventArgs e)
         {
             isSaved= true;
-            if (Email.Text == "" || Displayname.Text == "" || Username.Text == "" || PasswordBox1.Password == "" || PasswordBox2.Password == "" || cbRBAC.SelectedIndex == -1)
+            if (!(Email.Text == "" || Displayname.Text == "" || Username.Text == "" || PasswordBox1.Password == "" || PasswordBox2.Password == "" || cbRBAC.SelectedIndex == -1))
             {
                 txblError.Text = "Vui lòng nhập đầy đủ thông tin!";

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/UserForm.xaml.cs:59:17
                 Email.Focus();
                 return;
             }
-            if (PasswordBox1.Password != PasswordBox2.Password)
+            if (PasswordBox1.Password == PasswordBox2.Password)
             {
                 txblError.Text = "Mật khẩu không trùng nhau!";

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/UserForm.xaml.cs:63:17
             {
                 txblError.Text = "Mật khẩu không trùng nhau!";
                 PasswordBox1.Focus();
-                return;
+                ;
             }
             if (!Regex.IsMatch(Email.Text, @"^[a-zA-Z][\w\.-]*[a-zA-Z0-9]@[a-zA-Z0-9][\w\.-]*[a-zA-Z0-9]\.[a-zA-Z][a-zA-Z\.]*[a-zA-Z]$"))

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/UserForm.xaml.cs:65:17
                 PasswordBox1.Focus();
                 return;
             }
-            if (!Regex.IsMatch(Email.Text, @"^[a-zA-Z][\w\.-]*[a-zA-Z0-9]@[a-zA-Z0-9][\w\.-]*[a-zA-Z0-9]\.[a-zA-Z][a-zA-Z\.]*[a-zA-Z]$"))
+            if (Regex.IsMatch(Email.Text, @"^[a-zA-Z][\w\.-]*[a-zA-Z0-9]@[a-zA-Z0-9][\w\.-]*[a-zA-Z0-9]\.[a-zA-Z][a-zA-Z\.]*[a-zA-Z]$"))
             {
                 txblError.Text = "Email không hợp lệ!";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/UserForm.xaml.cs:65:44
                 PasswordBox1.Focus();
                 return;
             }
-            if (!Regex.IsMatch(Email.Text, @"^[a-zA-Z][\w\.-]*[a-zA-Z0-9]@[a-zA-Z0-9][\w\.-]*[a-zA-Z0-9]\.[a-zA-Z][a-zA-Z\.]*[a-zA-Z]$"))
+            if (!Regex.IsMatch(Email.Text, ""))
             {
                 txblError.Text = "Email không hợp lệ!";

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/UserForm.xaml.cs:72:17
                 return;
             }
 
-            if (action == 0) {
+            if (action != 0) {
                 SqlConnection sqlCon = DataProvider.sqlConnection;
                 try

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/UserForm.xaml.cs:82:56
                         String query = "SELECT COUNT(1) FROM [TAIKHOAN] WHERE TenDangNhap=@Username";
                         SqlCommand sqlCmd = new SqlCommand(query, sqlCon);
                         sqlCmd.CommandType = CommandType.Text;
-                        sqlCmd.Parameters.AddWithValue("@Username", Username.Text);
+                        sqlCmd.Parameters.AddWithValue("", Username.Text);
                         int count = Convert.ToInt32(sqlCmd.ExecuteScalar());
                         if (count > 0)

[NoCoverage] Arithmetic mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/UserForm.xaml.cs:98:32
                 try
                 {
                     sqlCon.Open();
-                    int type = cbRBAC.SelectedIndex + 1;
+                    int type = cbRBAC.SelectedIndex - 1;
                     cmd.CommandType = CommandType.Text;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/UserForm.xaml.cs:104:21
                     cmd.ExecuteNonQuery();
                     sqlCon.Close();
                     this.Close();
-                    MessageBox.Show("Thêm tài khoản thành công!", "Success");
+                    ;
                 } catch (Exception ex) { Console.WriteLine(ex); }
         }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/UserForm.xaml.cs:104:67
                     cmd.ExecuteNonQuery();
                     sqlCon.Close();
                     this.Close();
-                    MessageBox.Show("Thêm tài khoản thành công!", "Success");
+                    MessageBox.Show("Thêm tài khoản thành công!", "");
                 } catch (Exception ex) { Console.WriteLine(ex); }
         }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/UserForm.xaml.cs:105:42
                     sqlCon.Close();
                     this.Close();
                     MessageBox.Show("Thêm tài khoản thành công!", "Success");
-                } catch (Exception ex) { Console.WriteLine(ex); }
+                } catch (Exception ex) { ; }
         }
             else if(action == 1) {

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/UserForm.xaml.cs:107:21
                     MessageBox.Show("Thêm tài khoản thành công!", "Success");
                 } catch (Exception ex) { Console.WriteLine(ex); }
         }
-            else if(action == 1) {
+            else if(action != 1) {
                 SqlConnection sqlCon = DataProvider.sqlConnection;
                 try

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/UserForm.xaml.cs:114:40
                     if (sqlCon.State == ConnectionState.Closed)
                     {
                         sqlCon.Open();
-                        String query = "SELECT COUNT(1) FROM [TAIKHOAN] WHERE TenDangNhap=@Username AND MaTk<>@UserId";
+                        String query = "";
                         SqlCommand sqlCmd = new SqlCommand(query, sqlCon);
                         sqlCmd.CommandType = CommandType.Text;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/UserForm.xaml.cs:118:25
                         SqlCommand sqlCmd = new SqlCommand(query, sqlCon);
                         sqlCmd.CommandType = CommandType.Text;
                         sqlCmd.Parameters.AddWithValue("@Username", Username.Text);
-                        sqlCmd.Parameters.AddWithValue("@UserId", userId);
+                        ;
                         int count = Convert.ToInt32(sqlCmd.ExecuteScalar());
                         if (count > 0)

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/UserForm.xaml.cs:118:56
                         SqlCommand sqlCmd = new SqlCommand(query, sqlCon);
                         sqlCmd.CommandType = CommandType.Text;
                         sqlCmd.Parameters.AddWithValue("@Username", Username.Text);
-                        sqlCmd.Parameters.AddWithValue("@UserId", userId);
+                        sqlCmd.Parameters.AddWithValue("", userId);
                         int count = Convert.ToInt32(sqlCmd.ExecuteScalar());
                         if (count > 0)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/UserForm.xaml.cs:138:21
                     cmd.ExecuteNonQuery();
                     sqlCon.Close();
                     this.Close();
-                    MessageBox.Show("Sửa thông tin tài khoản thành công!", "Success");
+                    ;
                 }
                 catch (Exception ex) { Console.WriteLine(ex); }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/UserForm.xaml.cs:138:76
                     cmd.ExecuteNonQuery();
                     sqlCon.Close();
                     this.Close();
-                    MessageBox.Show("Sửa thông tin tài khoản thành công!", "Success");
+                    MessageBox.Show("Sửa thông tin tài khoản thành công!", "");
                 }
                 catch (Exception ex) { Console.WriteLine(ex); }
