[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Data/BANGTHAMSO.cs:20:13
         public static int ThoiGianBayToiThieu
         {
             get
-            {
-                return thoiGianBayToiThieu;
-            }
+            {}
             set
             {

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Data/BANGTHAMSO.cs:24:13
                 return thoiGianBayToiThieu;
             }
             set
-            {
-                thoiGianBayToiThieu = value;
-            }
+            {}
         }
         public static int ThoiGianBayToiDa

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Data/BANGTHAMSO.cs:31:13
         public static int ThoiGianBayToiDa
         {
             get
-            {
-                return thoiGianBayToiDa;
-            }
+            {}
             set
             {

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Data/BANGTHAMSO.cs:35:13
                 return thoiGianBayToiDa;
             }
             set
-            {
-                thoiGianBayToiDa = value;
-            }
+            {}
         }
         public static int ThoiGianDungToiThieu

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Data/BANGTHAMSO.cs:42:13
         public static int ThoiGianDungToiThieu
         {
             get
-            {
-                return thoiGianDungToiThieu;
-            }
+            {}
             set
             {

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Data/BANGTHAMSO.cs:46:13
                 return thoiGianDungToiThieu;
             }
             set
-            {
-                thoiGianDungToiThieu = value;
-            }
+            {}
         }
         public static int ThoiGianDungToiDa

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Data/BANGTHAMSO.cs:53:13
         public static int ThoiGianDungToiDa
         {
             get
-            {
-                return thoiGianDungToiDa;
-            }
+            {}
             set
             {

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Data/BANGTHAMSO.cs:57:13
                 return thoiGianDungToiDa;
             }
             set
-            {
-                thoiGianDungToiDa = value;
-            }
+            {}
         }
         public static int SoGioTruocKhoiHanhChoPhepDatVe

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Data/BANGTHAMSO.cs:64:13
         public static int SoGioTruocKhoiHanhChoPhepDatVe
         {
             get
-            {
-                return soGioTruocKhoiHanhChoPhepDatVe;
-            }
+            {}
             set
             {

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Data/BANGTHAMSO.cs:68:13
                 return soGioTruocKhoiHanhChoPhepDatVe;
             }
             set
-            {
-                soGioTruocKhoiHanhChoPhepDatVe = value;
-            }
+            {}
         }
         public static int SoGioTruocKhoiHanhHuyPhieuDat

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Data/BANGTHAMSO.cs:76:13
         {
 
             get
-            {
-                return soGioTruocKhoiHanhHuyPhieuDat;
-            }
+            {}
             set
             {

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Data/BANGTHAMSO.cs:80:13
                 return soGioTruocKhoiHanhHuyPhieuDat;
             }
             set
-            {
-                soGioTruocKhoiHanhHuyPhieuDat = value;
-            }
+            {}
         }
     }
