[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:43:13
         {
             InitializeComponent();
             //hủy vé tự động
-            dispatcherTimer.Tick += DispatcherTimer_Tick;
+            dispatcherTimer.Tick -= DispatcherTimer_Tick;
             dispatcherTimer.Interval = new TimeSpan(0, 0, 5);
             dispatcherTimer.Start();

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:45:13
             //hủy vé tự động
             dispatcherTimer.Tick += DispatcherTimer_Tick;
             dispatcherTimer.Interval = new TimeSpan(0, 0, 5);
-            dispatcherTimer.Start();
+            ;
 
             //main code

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:52:13
             allFlight = new AllFlight();
             addInforHK = new AddInforHK();
             flightDetail = new FlightDetail();
-            home.Search += Home_Search;
+            home.Search -= Home_Search;
 
             flights = new FlightsList();

[NoCoverage] Block removal mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:59:9
         }
 
         private void Flights_Return(object sender, RoutedEventArgs e)
-        {
-            fContainer.Content = home;
-        }
+        {}
 
         private void DispatcherTimer_Tick(object sender, EventArgs e)

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:68:17
             try
             {
                 TimeSpan Timeout = TimeSpan.Zero;
-                DataProvider.sqlConnection.Open();
+                ;
                 SqlCommand sqlcommand = new SqlCommand(
                     "select [t].GiaTri from [BANGTHAMSO] [t] " +

[NoCoverage] String mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:71:21
                 DataProvider.sqlConnection.Open();
                 SqlCommand sqlcommand = new SqlCommand(
                     "select [t].GiaTri from [BANGTHAMSO] [t] " +
-                    "where convert(varchar,[t].TenThamSo) = 'ThoiGianChamNhatChoPhepHuyVe'"
+                    ""
                     , DataProvider.sqlConnection);
                 SqlDataReader rd = sqlcommand.ExecuteReader();

[NoCoverage] Equality mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:100:30
                         DateTime flighttime = DateTime.ParseExact(strtime, "dd/MM/yyyy HH:mm", CultureInfo.InvariantCulture);
                         TimeSpan time = flighttime - DateTime.Now;
 
-                        if ( time - Timeout <= TimeSpan.Zero )
+                        if ( time - Timeout > TimeSpan.Zero )
                         {
                             ticket_des.Add(reader["MaVe"].ToString());

[NoCoverage] Equality mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:100:30
                         DateTime flighttime = DateTime.ParseExact(strtime, "dd/MM/yyyy HH:mm", CultureInfo.InvariantCulture);
                         TimeSpan time = flighttime - DateTime.Now;
 
-                        if ( time - Timeout <= TimeSpan.Zero )
+                        if ( time - Timeout < TimeSpan.Zero )
                         {
                             ticket_des.Add(reader["MaVe"].ToString());

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:102:29
 
                         if ( time - Timeout <= TimeSpan.Zero )
                         {
-                            ticket_des.Add(reader["MaVe"].ToString());
+                            ;
                         }
                     }

[NoCoverage] String mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:102:51
 
                         if ( time - Timeout <= TimeSpan.Zero )
                         {
-                            ticket_des.Add(reader["MaVe"].ToString());
+                            ticket_des.Add(reader[""].ToString());
                         }
                     }

[NoCoverage] Equality mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:108:21
                 }
                 DataProvider.sqlConnection.Close();
 
-                if (ticket_des.Count > 0)
+                if (ticket_des.Count < 0)
                 {
                     //List<string> bookings = new List<string>();

[NoCoverage] Equality mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:108:21
                 }
                 DataProvider.sqlConnection.Close();
 
-                if (ticket_des.Count > 0)
+                if (ticket_des.Count >= 0)
                 {
                     //List<string> bookings = new List<string>();

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:151:25
                             "update [VE] set TinhTrang = 'TRONG', TenHK = NULL, CMND = NULL, SDT = NULL, MaHK = NULL" +
                             " where MaVe = @mave ", DataProvider.sqlConnection);
                         sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = ticket;
-                        sqlCommand.ExecuteNonQuery();
+                        ;
                         DataProvider.sqlConnection.Close();
                     }

[NoCoverage] Equality mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:155:25
                         DataProvider.sqlConnection.Close();
                     }
                                         
-                    if (fContainer.Content == flightDetail)
+                    if (fContainer.Content != flightDetail)
                     {
                         string flightID = flightDetail.flight_ID.Text;

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:164:25
                         DateTime timedepar = (DateTime)flightDetail.sp_timeDeparture.DataContext;
 
                         flightDetail = new FlightDetail();
-                        flightDetail.Show(flightID,airlineLogo,time, timedes, timedepar, false);
+                        ;
                         flightDetail.Return += FlightDetail_Return;
                         flightDetail.Continue += FlightDetail_Continue;

[NoCoverage] Boolean mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:164:90
                         DateTime timedepar = (DateTime)flightDetail.sp_timeDeparture.DataContext;
 
                         flightDetail = new FlightDetail();
-                        flightDetail.Show(flightID,airlineLogo,time, timedes, timedepar, false);
+                        flightDetail.Show(flightID,airlineLogo,time, timedes, timedepar, true);
                         flightDetail.Return += FlightDetail_Return;
                         flightDetail.Continue += FlightDetail_Continue;

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:165:25
 
                         flightDetail = new FlightDetail();
                         flightDetail.Show(flightID,airlineLogo,time, timedes, timedepar, false);
-                        flightDetail.Return += FlightDetail_Return;
+                        flightDetail.Return -= FlightDetail_Return;
                         flightDetail.Continue += FlightDetail_Continue;
                         fContainer.Content = flightDetail;

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:166:25
                         flightDetail = new FlightDetail();
                         flightDetail.Show(flightID,airlineLogo,time, timedes, timedepar, false);
                         flightDetail.Return += FlightDetail_Return;
-                        flightDetail.Continue += FlightDetail_Continue;
+                        flightDetail.Continue -= FlightDetail_Continue;
                         fContainer.Content = flightDetail;
                     }

[NoCoverage] Equality mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:169:30
                         flightDetail.Continue += FlightDetail_Continue;
                         fContainer.Content = flightDetail;
                     }
-                    else if (fContainer.Content == myBookings)
+                    else if (fContainer.Content != myBookings)
                     {
                         myBookings = new MyBookings();

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:172:25
                     else if (fContainer.Content == myBookings)
                     {
                         myBookings = new MyBookings();
-                        myBookings.MyTicket(curAccount.id);
+                        ;
                         fContainer.Content = myBookings;
                     }

[NoCoverage] Equality mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:175:30
                         myBookings.MyTicket(curAccount.id);
                         fContainer.Content = myBookings;
                     }
-                    else if (fContainer.Content == allFlight)
+                    else if (fContainer.Content != allFlight)
                     {
                         allFlight = new AllFlight();

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:179:25
                     {
                         allFlight = new AllFlight();
                         fContainer.Content = allFlight;
-                        allFlight.ShowDetail += AllFlight_ShowDetail;
+                        allFlight.ShowDetail -= AllFlight_ShowDetail;
                     }
 

[NoCoverage] Negate expression
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:191:29
                             "where [ct].MaVe = @mave and [ct].MaHD = [hd].MaHD", DataProvider.sqlConnection);
                         sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = ticket;
                         reader = sqlCommand.ExecuteReader();
-                        if (reader.HasRows)
+                        if (!(reader.HasRows))
                         {
                             if (reader.Read())

[NoCoverage] String mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:195:45
                         {
                             if (reader.Read())
                             {
-                                id = reader["MaTK"].ToString();                                
+                                id = reader[""].ToString();                                
                             }
                         }

[NoCoverage] Equality mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:200:29
                         }
                         DataProvider.sqlConnection.Close();
 
-                        if (id == curAccount.id)
+                        if (id != curAccount.id)
                         {
                             MessageBox.Show("Một số vé của bạn đã bị hủy do không thanh toán đúng hạn!");

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:202:29
 
                         if (id == curAccount.id)
                         {
-                            MessageBox.Show("Một số vé của bạn đã bị hủy do không thanh toán đúng hạn!");
+                            ;
                             break;
                         }

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:203:29
                         if (id == curAccount.id)
                         {
                             MessageBox.Show("Một số vé của bạn đã bị hủy do không thanh toán đúng hạn!");
-                            break;
+                            ;
                         }
                     }

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:216:13
         {
             home = new Home();
             fContainer.Content = home;
-            home.Search += Home_Search;
+            home.Search -= Home_Search;
         }
 

[NoCoverage] Boolean mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:221:44
 
         private void FlightDetail_Return(object sender, RoutedEventArgs e)
         {
-            if(flightDetail.isAllFlight == true)
+            if(flightDetail.isAllFlight == false)
             {
                 btnAllFlight_Click(sender, e);

[NoCoverage] Equality mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:221:16
 
         private void FlightDetail_Return(object sender, RoutedEventArgs e)
         {
-            if(flightDetail.isAllFlight == true)
+            if(flightDetail.isAllFlight != true)
             {
                 btnAllFlight_Click(sender, e);

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:223:17
         {
             if(flightDetail.isAllFlight == true)
             {
-                btnAllFlight_Click(sender, e);
+                ;
             }
             else {

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:226:17
                 btnAllFlight_Click(sender, e);
             }
             else {
-                Home_Search(sender, e);
+                ;
             }
         }

[NoCoverage] Equality mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:232:17
 
         private void FlightDetail_Continue(object sender, RoutedEventArgs e)
         {
-            if (curAccount != null)
+            if (curAccount == null)
             {
                 if (addInforHK == null)

[NoCoverage] Equality mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:234:21
         {
             if (curAccount != null)
             {
-                if (addInforHK == null)
+                if (addInforHK != null)
                 {
                     addInforHK = new AddInforHK();

[NoCoverage] Block removal mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:235:17
             if (curAccount != null)
             {
                 if (addInforHK == null)
-                {
-                    addInforHK = new AddInforHK();
-                }
+                {}
                 else
                 {

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:240:21
                 }
                 else
                 {
-                    addInforHK.Close();
+                    ;
                     addInforHK = new AddInforHK();
                 }

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:243:17
                     addInforHK.Close();
                     addInforHK = new AddInforHK();
                 }
-                addInforHK.GoToHomeScreen += AddInforHK_GoToHomeScreen;
+                addInforHK.GoToHomeScreen -= AddInforHK_GoToHomeScreen;
                 addInforHK.Show(flightDetail.flightID, flightDetail.TicketID_Chosen, curAccount.id);
                 addInforHK.Show();

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:244:17
                     addInforHK = new AddInforHK();
                 }
                 addInforHK.GoToHomeScreen += AddInforHK_GoToHomeScreen;
-                addInforHK.Show(flightDetail.flightID, flightDetail.TicketID_Chosen, curAccount.id);
+                ;
                 addInforHK.Show();
             }

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:245:17
                 }
                 addInforHK.GoToHomeScreen += AddInforHK_GoToHomeScreen;
                 addInforHK.Show(flightDetail.flightID, flightDetail.TicketID_Chosen, curAccount.id);
-                addInforHK.Show();
+                ;
             }
             else

[NoCoverage] Equality mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:250:21
             else
             {
                 MessageBoxResult result = MessageBox.Show("Vui lòng đăng nhập trước khi đặt vé!");
-                if (result == MessageBoxResult.OK)
+                if (result != MessageBoxResult.OK)
                 {
                     Login login = new Login();

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:253:21
                 if (result == MessageBoxResult.OK)
                 {
                     Login login = new Login();
-                    login.redirectSignup += Login_redirectSignup;
+                    login.redirectSignup -= Login_redirectSignup;
                     login.loginSuccess += Login_loginSuccess;
                     fContainer.Content = login;

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:254:21
                 {
                     Login login = new Login();
                     login.redirectSignup += Login_redirectSignup;
-                    login.loginSuccess += Login_loginSuccess;
+                    login.loginSuccess -= Login_loginSuccess;
                     fContainer.Content = login;
                 }

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:263:13
         private void btnHome_Click(object sender, RoutedEventArgs e)
         {
             home = new Home();
-            home.Search += Home_Search;
+            home.Search -= Home_Search;
             fContainer.Content = home;
         }

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:270:13
         private void Home_Search(object sender, RoutedEventArgs e)
         {
             flights = new FlightsList();
-            flights.Return += Flights_Return;
+            flights.Return -= Flights_Return;
             flights.Search += Flights_Return;
             flights.ShowDetail += Flight_ShowDetail;

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:271:13
         {
             flights = new FlightsList();
             flights.Return += Flights_Return;
-            flights.Search += Flights_Return;
+            flights.Search -= Flights_Return;
             flights.ShowDetail += Flight_ShowDetail;
             flights.FlightSearched(home.Departure, home.Destination, home.Date, home.Quantity, home.FlightClass);

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:272:13
             flights = new FlightsList();
             flights.Return += Flights_Return;
             flights.Search += Flights_Return;
-            flights.ShowDetail += Flight_ShowDetail;
+            flights.ShowDetail -= Flight_ShowDetail;
             flights.FlightSearched(home.Departure, home.Destination, home.Date, home.Quantity, home.FlightClass);
             fContainer.Content = flights;

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:273:13
             flights.Return += Flights_Return;
             flights.Search += Flights_Return;
             flights.ShowDetail += Flight_ShowDetail;
-            flights.FlightSearched(home.Departure, home.Destination, home.Date, home.Quantity, home.FlightClass);
+            ;
             fContainer.Content = flights;
 

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:281:13
         private void Flight_ShowDetail(object sender, RoutedEventArgs e)
         {
             flightDetail = new FlightDetail();
-            flightDetail.Show(flights.flightID, flights.airlineLogo, flights.time, flights.dateTimeDestination, flights.dateTimeDeparture, false);
+            ;
             flightDetail.Return += FlightDetail_Return;
             flightDetail.Continue += FlightDetail_Continue;

[NoCoverage] Boolean mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:281:140
         private void Flight_ShowDetail(object sender, RoutedEventArgs e)
         {
             flightDetail = new FlightDetail();
-            flightDetail.Show(flights.flightID, flights.airlineLogo, flights.time, flights.dateTimeDestination, flights.dateTimeDeparture, false);
+            flightDetail.Show(flights.flightID, flights.airlineLogo, flights.time, flights.dateTimeDestination, flights.dateTimeDeparture, true);
             flightDetail.Return += FlightDetail_Return;
             flightDetail.Continue += FlightDetail_Continue;

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:282:13
         {
             flightDetail = new FlightDetail();
             flightDetail.Show(flights.flightID, flights.airlineLogo, flights.time, flights.dateTimeDestination, flights.dateTimeDeparture, false);
-            flightDetail.Return += FlightDetail_Return;
+            flightDetail.Return -= FlightDetail_Return;
             flightDetail.Continue += FlightDetail_Continue;
             fContainer.Content = flightDetail;

[NoCoverage] Block removal mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:287:9
             fContainer.Content = flightDetail;
         }
         private void AdminAccessBtn(object sender, RoutedEventArgs e)
-        {
-            AdminRight adminRight = new AdminRight();
-            fContainer.Content = adminRight;
-        }
+        {}
 
         private void loginBtn_Click(object sender, RoutedEventArgs e)

[NoCoverage] Equality mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:294:17
 
         private void loginBtn_Click(object sender, RoutedEventArgs e)
         {
-            if (MainWindow.curAccount == null)
+            if (MainWindow.curAccount != null)
             {
                 Login login = new Login();

[NoCoverage] Equality mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:303:21
             }
             else
             {
-                if (MessageBox.Show("Bạn có chắc muốn đăng xuất khỏi tài khoản này?", "Đăng xuất", MessageBoxButton.YesNo, MessageBoxImage.Question) == MessageBoxResult.Yes)
+                if (MessageBox.Show("Bạn có chắc muốn đăng xuất khỏi tài khoản này?", "Đăng xuất", MessageBoxButton.YesNo, MessageBoxImage.Question) != MessageBoxResult.Yes)
                 {
                     MainWindow.curAccount = null;

[NoCoverage] String mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:303:37
             }
             else
             {
-                if (MessageBox.Show("Bạn có chắc muốn đăng xuất khỏi tài khoản này?", "Đăng xuất", MessageBoxButton.YesNo, MessageBoxImage.Question) == MessageBoxResult.Yes)
+                if (MessageBox.Show("", "Đăng xuất", MessageBoxButton.YesNo, MessageBoxImage.Question) == MessageBoxResult.Yes)
                 {
                     MainWindow.curAccount = null;

[NoCoverage] String mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:306:37
                 if (MessageBox.Show("Bạn có chắc muốn đăng xuất khỏi tài khoản này?", "Đăng xuất", MessageBoxButton.YesNo, MessageBoxImage.Question) == MessageBoxResult.Yes)
                 {
                     MainWindow.curAccount = null;
-                    tblLogin.Text = "Đăng nhập";
+                    tblLogin.Text = "";
                     BitmapImage bitmap = new BitmapImage(new Uri("/Images/login.png", UriKind.Relative));
                     imgLogin.Source = bitmap;

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:314:21
                     btn_ChangeRule.Visibility = Visibility.Collapsed;
                     btn_setting.Visibility = Visibility.Collapsed;
                     btnMyBookings.Visibility = Visibility.Collapsed;
-                    btnHome_Click(sender, e);
+                    ;
                 }
             }

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:321:13
 
         private void Login_loginSuccess(object sender, RoutedEventArgs e)
         {
-            btnHome_Click(sender, e);
+            ;
             tblLogin.Text = "Đăng xuất";
             BitmapImage bitmap = new BitmapImage(new Uri("/Images/logout.png", UriKind.Relative));

[NoCoverage] String mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:322:29
         private void Login_loginSuccess(object sender, RoutedEventArgs e)
         {
             btnHome_Click(sender, e);
-            tblLogin.Text = "Đăng xuất";
+            tblLogin.Text = "";
             BitmapImage bitmap = new BitmapImage(new Uri("/Images/logout.png", UriKind.Relative));
             imgLogin.Source = bitmap;

[NoCoverage] Equality mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:325:17
             tblLogin.Text = "Đăng xuất";
             BitmapImage bitmap = new BitmapImage(new Uri("/Images/logout.png", UriKind.Relative));
             imgLogin.Source = bitmap;
-            if (MainWindow.curAccount.type == 1)
+            if (MainWindow.curAccount.type != 1)
             {
                 btn_UserManagement.Visibility = Visibility.Visible;

[NoCoverage] Block removal mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:326:13
             BitmapImage bitmap = new BitmapImage(new Uri("/Images/logout.png", UriKind.Relative));
             imgLogin.Source = bitmap;
             if (MainWindow.curAccount.type == 1)
-            {
-                btn_UserManagement.Visibility = Visibility.Visible;
-                btn_SalesmanRight.Visibility = Visibility.Visible;
-                btn_ChangeRule.Visibility = Visibility.Visible;
-            }
+            {}
             if (MainWindow.curAccount.type == 2)
             {

[NoCoverage] Equality mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:331:17
                 btn_SalesmanRight.Visibility = Visibility.Visible;
                 btn_ChangeRule.Visibility = Visibility.Visible;
             }
-            if (MainWindow.curAccount.type == 2)
+            if (MainWindow.curAccount.type != 2)
             {
                 btn_SalesmanRight.Visibility = Visibility.Visible;

[NoCoverage] Block removal mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:332:13
                 btn_ChangeRule.Visibility = Visibility.Visible;
             }
             if (MainWindow.curAccount.type == 2)
-            {
-                btn_SalesmanRight.Visibility = Visibility.Visible;
-            }
+            {}
             btn_setting.Visibility = Visibility.Visible;
             btnMyBookings.Visibility = Visibility.Visible;

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:342:13
         private void Login_redirectSignup(object sender, RoutedEventArgs e)
         {
             Register register = new Register();
-            register.redirectLogin += Register_redirectLogin;
+            register.redirectLogin -= Register_redirectLogin;
             fContainer.Content = register;
         }

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:348:13
 
         private void Register_redirectLogin(object sender, RoutedEventArgs e)
         {
-            loginBtn_Click(sender, e);
+            ;
         }
 

[NoCoverage] Block removal mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:352:9
         }
 
         private void userManagement_Click(object sender, RoutedEventArgs e)
-        {
-            UserManagement userManagement = new UserManagement();
-            fContainer.Content = userManagement;
-        }
+        {}
 
         private void btnAllFlight_Click(object sender, RoutedEventArgs e)

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:367:13
         private void AllFlight_ShowDetail(object sender, RoutedEventArgs e)
         {
             flightDetail = new FlightDetail();
-            flightDetail.Return += FlightDetail_Return;
+            flightDetail.Return -= FlightDetail_Return;
             flightDetail.Continue += FlightDetail_Continue;
             flightDetail.Show(allFlight.flightID, allFlight.airlineLogo, allFlight.time, allFlight.dateTimeDestination, allFlight.dateTimeDeparture, true);

[NoCoverage] Boolean mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:369:150
             flightDetail = new FlightDetail();
             flightDetail.Return += FlightDetail_Return;
             flightDetail.Continue += FlightDetail_Continue;
-            flightDetail.Show(allFlight.flightID, allFlight.airlineLogo, allFlight.time, allFlight.dateTimeDestination, allFlight.dateTimeDeparture, true);
+            flightDetail.Show(allFlight.flightID, allFlight.airlineLogo, allFlight.time, allFlight.dateTimeDestination, allFlight.dateTimeDeparture, false);
             fContainer.Content = flightDetail;
         }

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:369:13
             flightDetail = new FlightDetail();
             flightDetail.Return += FlightDetail_Return;
             flightDetail.Continue += FlightDetail_Continue;
-            flightDetail.Show(allFlight.flightID, allFlight.airlineLogo, allFlight.time, allFlight.dateTimeDestination, allFlight.dateTimeDeparture, true);
+            ;
             fContainer.Content = flightDetail;
         }
