[NoCoverage] Block removal mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:375:13
         private void setting_click(object sender, RoutedEventArgs e)
         {
             if (curAccount != null)
-            {
-                Setting setting = new Setting();
-                fContainer.Content = setting;
-            }
+            {}
         }
         private void contactsUs_click(object sender, RoutedEventArgs e)

[NoCoverage] Block removal mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:381:9
             }
         }
         private void contactsUs_click(object sender, RoutedEventArgs e)
-        {
-            ContactUs contactUs = new ContactUs();
-            fContainer.Content = contactUs;
-        }
+        {}
         private void Reload_Mybookings(object sender, RoutedEventArgs e)
         {

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:388:13
         private void Reload_Mybookings(object sender, RoutedEventArgs e)
         {
             myBookings = new MyBookings();
-            myBookings.Return += Reload_Mybookings;
+            myBookings.Return -= Reload_Mybookings;
             myBookings.MyTicket(curAccount.id);
             fContainer.Content = myBookings;

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:389:13
         {
             myBookings = new MyBookings();
             myBookings.Return += Reload_Mybookings;
-            myBookings.MyTicket(curAccount.id);
+            ;
             fContainer.Content = myBookings;
         }

[NoCoverage] Equality mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:397:17
         {
             myBookings = new MyBookings();
             myBookings.Return += Reload_Mybookings;
-            if (curAccount == null)
+            if (curAccount != null)
             {
                 myBookings.NoLogin();

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:399:17
             myBookings.Return += Reload_Mybookings;
             if (curAccount == null)
             {
-                myBookings.NoLogin();
+                ;
             }
             else

[NoCoverage] Statement mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:403:17
             }
             else
             {
-                myBookings.MyTicket(curAccount.id);
+                ;
             }
             fContainer.Content = myBookings;

[NoCoverage] Block removal mutation
D:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:409:9
         }
 
         private void changeRule_Click(object sender, RoutedEventArgs e)
-        {
-            RuleChange ruleChange = new RuleChange();
-            fContainer.Content = ruleChange;
-        }
+        {}
     }
 }
