[Killed] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Converter/DurationConverter.cs:16:17
         public object Convert(object value, Type targetType, object parameter, CultureInfo culture)
         {
             TimeSpan duration = (TimeSpan)value;
-            if (duration.TotalMinutes < 60)
+            if (duration.TotalMinutes <= 60)
             {
                 return duration.TotalMinutes.ToString() + "'";
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.ConvertTest.DurationConvertTest

[Killed] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Converter/DurationConverter.cs:16:17
         public object Convert(object value, Type targetType, object parameter, CultureInfo culture)
         {
             TimeSpan duration = (TimeSpan)value;
-            if (duration.TotalMinutes < 60)
+            if (duration.TotalMinutes > 60)
             {
                 return duration.TotalMinutes.ToString() + "'";
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.ConvertTest.DurationConvertTest
