[Killed] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:39:21
             try
             {
                 int p1 = int.Parse(input);
-                if (p1 <= 0)
+                if (!(p1 <= 0))
                 {
                     return false;
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.isPositiveIntgerTest

[Killed] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:39:21
             try
             {
                 int p1 = int.Parse(input);
-                if (p1 <= 0)
+                if (p1 > 0)
                 {
                     return false;
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.isPositiveIntgerTest
