[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:623:17
                 }
             }
 
-            if (!DataProvider.isPositiveInteger(TgBay))
+            if (DataProvider.isPositiveInteger(TgBay))
             {
                 MessageBox.Show("Vui lòng nhập thời gian bay là một số nguyên dương", "Dữ liệu không hợp lệ!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:625:17
 
             if (!DataProvider.isPositiveInteger(TgBay))
             {
-                MessageBox.Show("Vui lòng nhập thời gian bay là một số nguyên dương", "Dữ liệu không hợp lệ!");
+                ;
                 return;
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:626:17
             if (!DataProvider.isPositiveInteger(TgBay))
             {
                 MessageBox.Show("Vui lòng nhập thời gian bay là một số nguyên dương", "Dữ liệu không hợp lệ!");
-                return;
+                ;
             }
             if (!DataProvider.isPositiveInteger(Gia))

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:628:17
                 MessageBox.Show("Vui lòng nhập thời gian bay là một số nguyên dương", "Dữ liệu không hợp lệ!");
                 return;
             }
-            if (!DataProvider.isPositiveInteger(Gia))
+            if (DataProvider.isPositiveInteger(Gia))
             {
                 MessageBox.Show("Vui lòng nhập giá là một số nguyên dương", "Dữ liệu không hợp lệ!");

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:630:17
             }
             if (!DataProvider.isPositiveInteger(Gia))
             {
-                MessageBox.Show("Vui lòng nhập giá là một số nguyên dương", "Dữ liệu không hợp lệ!");
+                ;
                 return;
             }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:631:17
             if (!DataProvider.isPositiveInteger(Gia))
             {
                 MessageBox.Show("Vui lòng nhập giá là một số nguyên dương", "Dữ liệu không hợp lệ!");
-                return;
+                ;
             }
             try

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:642:17
                 MessageBox.Show("Vui lòng nhập thời gian bay là một số nguyên.", "Dữ liệu không hợp lệ!");
                 return;
             }
-            if (int.Parse(TgBay) < ThoiGianBayToiThieu)
+            if (!(int.Parse(TgBay) < ThoiGianBayToiThieu))
             {
                 MessageBox.Show("Vui lòng nhập thời gian bay phải lớn hơn thời gian bay tối thiểu đã định: " + ThoiGianBayToiThieu + " phút", "Dữ liệu không hợp lệ!");

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:665:66
                 {
                     for (int i = 0; i < qLHangVeClass.Count; i++)
                     {
-                        if (qLHangVeClass[i].Mahangve == null || qLHangVeClass[i].Soluong == null)
+                        if (qLHangVeClass[i].Mahangve == null || qLHangVeClass[i].Soluong != null)
                         {
                             MessageBox.Show("Vui lòng nhập thông tin đầy đủ cho hạng vé.", "Dữ liệu không hợp lệ!");

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:676:21
             }
             if (thaotac == 1)
             {
-                if (qLHangVeClass.Count > 0)
+                if (qLHangVeClass.Count >= 0)
                 {
                     for (int i = 0; i < qLHangVeClass.Count; i++)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:691:33
 
             if (thaotac == 0)
             {
-                for (int i = 0; i < qLHangVeClass.Count - 1; i++)
+                for (int i = 0; i > qLHangVeClass.Count - 1; i++)
                 {
                     for (int j = i + 1; j < qLHangVeClass.Count; j++)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:693:41
             {
                 for (int i = 0; i < qLHangVeClass.Count - 1; i++)
                 {
-                    for (int j = i + 1; j < qLHangVeClass.Count; j++)
+                    for (int j = i + 1; j <= qLHangVeClass.Count; j++)
                     {
                         if (qLHangVeClass[i].Mahangve == qLHangVeClass[j].Mahangve)

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:737:59
             else
             {
                 List<QLHangVeClass> mergedList = qLHangVeClass.Concat(qLHangVeClassexist).ToList();
-                for (int i = 0; i < mergedList.Count - 1; i++)
+                for (int i = 0; i < mergedList.Count - 1; i--)
                 {
                     for (int j = i + 1; j < mergedList.Count; j++)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:739:41
                 List<QLHangVeClass> mergedList = qLHangVeClass.Concat(qLHangVeClassexist).ToList();
                 for (int i = 0; i < mergedList.Count - 1; i++)
                 {
-                    for (int j = i + 1; j < mergedList.Count; j++)
+                    for (int j = i + 1; j > mergedList.Count; j++)
                     {
                         if (mergedList[i].Mahangve == mergedList[j].Mahangve)

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:773:29
                 chuyenbayTable.Items.Clear();
                 loadDatatoTable();
             }
-            MessageBox.Show("Bạn đã lưu chuyến bay thành công. ", "Thông báo");
+            MessageBox.Show("", "Thông báo");
             isSave = true;
         }
