[Survived] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:36:113
         //public static SqlConnection sqlConnection = new SqlConnection(@"Data Source=(local);Initial Catalog=QuanLyBanVeMayBay;Integrated Security=True");
         public static SqlConnection sqlConnection = new SqlConnection(@"Data Source=.\SQLEXPRESS;Initial Catalog=QuanLyBanVeMayBay;Integrated Security=True");
 
-        public static List<string> colorList = new List<string>() { "#C8D70C", "#CB1D1D", "#459DF2", "#459DF2", "#F44EEE", "#ECA65D", "#ECA65D", "#C0F081" };
+        public static List<string> colorList = new List<string>() { "#C8D70C", "#CB1D1D", "#459DF2", "#459DF2", "", "#ECA65D", "#ECA65D", "#C0F081" };
         public static bool isPositiveInteger(string input)
         {

[Survived] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:36:69
         //public static SqlConnection sqlConnection = new SqlConnection(@"Data Source=(local);Initial Catalog=QuanLyBanVeMayBay;Integrated Security=True");
         public static SqlConnection sqlConnection = new SqlConnection(@"Data Source=.\SQLEXPRESS;Initial Catalog=QuanLyBanVeMayBay;Integrated Security=True");
 
-        public static List<string> colorList = new List<string>() { "#C8D70C", "#CB1D1D", "#459DF2", "#459DF2", "#F44EEE", "#ECA65D", "#ECA65D", "#C0F081" };
+        public static List<string> colorList = new List<string>() { "", "#CB1D1D", "#459DF2", "#459DF2", "#F44EEE", "#ECA65D", "#ECA65D", "#C0F081" };
         public static bool isPositiveInteger(string input)
         {

[Killed] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:42:21
             try
             {
                 int p1 = int.Parse(input);
-                if (p1 <= 0)
+                if (p1 < 0)
                 {
                     return false;
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.isPositiveIntgerTest

[Killed] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:55:16
         }
         public static int checkListHangVe(List<QLHangVeClass> qLHangVeClass)
         {
-            if(qLHangVeClass.Count <= 0)
+            if(qLHangVeClass.Count < 0)
                 return 0;
             for (int i = 0; i < qLHangVeClass.Count; i++)
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.checkListHangVeTest

[Killed] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:55:16
         }
         public static int checkListHangVe(List<QLHangVeClass> qLHangVeClass)
         {
-            if(qLHangVeClass.Count <= 0)
+            if(!(qLHangVeClass.Count <= 0))
                 return 0;
             for (int i = 0; i < qLHangVeClass.Count; i++)
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.checkListHangVeTest

[Killed] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:57:29
         {
             if(qLHangVeClass.Count <= 0)
                 return 0;
-            for (int i = 0; i < qLHangVeClass.Count; i++)
+            for (int i = 0; i <= qLHangVeClass.Count; i++)
             {
                 if (qLHangVeClass[i].Mahangve == null || qLHangVeClass[i].Soluong == null)
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.checkListHangVeTest

[Killed] PostIncrementExpression to PostDecrementExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:57:54
         {
             if(qLHangVeClass.Count <= 0)
                 return 0;
-            for (int i = 0; i < qLHangVeClass.Count; i++)
+            for (int i = 0; i < qLHangVeClass.Count; i--)
             {
                 if (qLHangVeClass[i].Mahangve == null || qLHangVeClass[i].Soluong == null)
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.checkListHangVeTest

[Killed] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:67:29
         public static bool isDuplicateValue(List<QLHangVeClass> qLHangVeClass)
         {
             var tempArr = new List<string>();
-            for (int i = 0; i < qLHangVeClass.Count; i++)
+            for (int i = 0; i <= qLHangVeClass.Count; i++)
             {
                 if (tempArr.Contains(qLHangVeClass[i].Mahangve))
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.isDuplicateValueTest

[Killed] PostIncrementExpression to PostDecrementExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:67:54
         public static bool isDuplicateValue(List<QLHangVeClass> qLHangVeClass)
         {
             var tempArr = new List<string>();
-            for (int i = 0; i < qLHangVeClass.Count; i++)
+            for (int i = 0; i < qLHangVeClass.Count; i--)
             {
                 if (tempArr.Contains(qLHangVeClass[i].Mahangve))
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.isDuplicateValueTest

[Killed] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:69:21
             var tempArr = new List<string>();
             for (int i = 0; i < qLHangVeClass.Count; i++)
             {
-                if (tempArr.Contains(qLHangVeClass[i].Mahangve))
+                if (!(tempArr.Contains(qLHangVeClass[i].Mahangve)))
                     return true;
                 else
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.isDuplicateValueTest

[Killed] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:70:28
             for (int i = 0; i < qLHangVeClass.Count; i++)
             {
                 if (tempArr.Contains(qLHangVeClass[i].Mahangve))
-                    return true;
+                    return false;
                 else
                 {
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.isDuplicateValueTest

[Killed] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:73:21
                     return true;
                 else
                 {
-                    tempArr.Add(qLHangVeClass[i].Mahangve); 
+                    ; 
                 }
             }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.isDuplicateValueTest

[Killed] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:80:28
         }
         public static bool checkInfor(List<Ticket>ve)
         {
-            for(int i = 0; i < ve.Count; i++)
+            for(int i = 0; i > ve.Count; i++)
             {
                 if (ve[i].HkName == "")
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.checkInforTest

[Killed] PostIncrementExpression to PostDecrementExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:80:42
         }
         public static bool checkInfor(List<Ticket>ve)
         {
-            for(int i = 0; i < ve.Count; i++)
+            for(int i = 0; i < ve.Count; i--)
             {
                 if (ve[i].HkName == "")
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.checkInforTest

[Killed] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:82:21
         {
             for(int i = 0; i < ve.Count; i++)
             {
-                if (ve[i].HkName == "")
+                if (ve[i].HkName != "")
                     return false;
             }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.checkInforTest

[Killed] Boolean mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:83:28
             for(int i = 0; i < ve.Count; i++)
             {
                 if (ve[i].HkName == "")
-                    return false;
+                    return true;
             }
             return true;
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.checkInforTest

[Killed] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:89:28
         }
         public static bool checkCMNDInArr(List<Ticket>ve, bool check, string compare)
         {
-            for(int i = 0; i < ve.Count; i++)
+            for(int i = 0; i <= ve.Count; i++)
             {
                 if (ve[i].CMND == compare)
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.checkCMNDInArrTest

[Killed] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:91:21
         {
             for(int i = 0; i < ve.Count; i++)
             {
-                if (ve[i].CMND == compare)
+                if (ve[i].CMND != compare)
                 {
                     return false;
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.checkCMNDInArrTest

[Killed] PostIncrementExpression to PostDecrementExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:101:48
         public static List<Ticket> addDataToSeat(List<Ticket>tickets, int reminder) 
         { 
             List<Ticket> tempArr = new List<Ticket>();
-            for (int i = 0; i < tickets.Count; i++)
+            for (int i = 0; i < tickets.Count; i--)
             {
                 if (tickets[i].SeatNumber % 6 == reminder) {
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.addDataToSeatTest

[Killed] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:101:29
         public static List<Ticket> addDataToSeat(List<Ticket>tickets, int reminder) 
         { 
             List<Ticket> tempArr = new List<Ticket>();
-            for (int i = 0; i < tickets.Count; i++)
+            for (int i = 0; i <= tickets.Count; i++)
             {
                 if (tickets[i].SeatNumber % 6 == reminder) {
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.addDataToSeatTest

[Killed] Arithmetic mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:103:21
             List<Ticket> tempArr = new List<Ticket>();
             for (int i = 0; i < tickets.Count; i++)
             {
-                if (tickets[i].SeatNumber % 6 == reminder) {
+                if (tickets[i].SeatNumber * 6 == reminder) {
                     tempArr.Add((Ticket)tickets[i]);    
                 }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.addDataToSeatTest

[Killed] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:103:21
             List<Ticket> tempArr = new List<Ticket>();
             for (int i = 0; i < tickets.Count; i++)
             {
-                if (tickets[i].SeatNumber % 6 == reminder) {
+                if (tickets[i].SeatNumber % 6 != reminder) {
                     tempArr.Add((Ticket)tickets[i]);    
                 }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.addDataToSeatTest

[Killed] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:104:21
             for (int i = 0; i < tickets.Count; i++)
             {
                 if (tickets[i].SeatNumber % 6 == reminder) {
-                    tempArr.Add((Ticket)tickets[i]);    
+                    ;    
                 }
             }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.addDataToSeatTest

[Killed] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:109:52
             }
             return tempArr;
         }
-        public static string selectedAirlineName = "Vietjet Air";
+        public static string selectedAirlineName = "";
         public static bool airlineNameFilter(object item)
         {
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.airlineNameFilterTest

[Killed] Logical mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:128:17
         }
         public static bool nightToMorning_Destination_Filter(object item)
         {
-            if (((item as Flight).TimeDestination.CompareTo("00:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("05:59")) <= 0)
+            if (((item as Flight).TimeDestination.CompareTo("00:00")) >= 0 || ((item as Flight).TimeDestination.CompareTo("05:59")) <= 0)
             {
                 return true;
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.nightToMorning_FilterTest

[Killed] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:128:79
         }
         public static bool nightToMorning_Destination_Filter(object item)
         {
-            if (((item as Flight).TimeDestination.CompareTo("00:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("05:59")) <= 0)
+            if (((item as Flight).TimeDestination.CompareTo("00:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("05:59")) > 0)
             {
                 return true;
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.nightToMorning_FilterTest

[Killed] Logical mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:136:17
         }
         public static bool morningToNoon_Destination_Filter(object item)
         {
-            if (((item as Flight).TimeDestination.CompareTo("06:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("11:59")) <= 0)
+            if (((item as Flight).TimeDestination.CompareTo("06:00")) >= 0 || ((item as Flight).TimeDestination.CompareTo("11:59")) <= 0)
             {
                 return true;
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.morningToNoon_FilterTest

[Killed] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:144:79
         }
         public static bool noonToEvening_Destination_Filter(object item)
         {
-            if (((item as Flight).TimeDestination.CompareTo("12:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("17:59")) <= 0)
+            if (((item as Flight).TimeDestination.CompareTo("12:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("17:59")) < 0)
             {
                 return true;
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.noonToEvening_FilterTest

[Killed] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:144:17
         }
         public static bool noonToEvening_Destination_Filter(object item)
         {
-            if (((item as Flight).TimeDestination.CompareTo("12:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("17:59")) <= 0)
+            if (!(((item as Flight).TimeDestination.CompareTo("12:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("17:59")) <= 0))
             {
                 return true;
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.noonToEvening_FilterTest

[Killed] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:152:79
         }
         public static bool eveningToNight_Destination_Filter(object item)//test
         {
-            if (((item as Flight).TimeDestination.CompareTo("18:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("23:59")) <= 0)
+            if (((item as Flight).TimeDestination.CompareTo("18:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("23:59")) > 0)
             {
                 return true;
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.eveningToNight_FilterTest

[Killed] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:161:77
 
         public static bool nightToMorning_Departure_Filter(object item)
         {
-            if (((item as Flight).TimeDeparture.CompareTo("00:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("05:59")) <= 0)
+            if (((item as Flight).TimeDeparture.CompareTo("00:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("05:59")) < 0)
             {
                 return true;
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.nightToMorning_FilterTest

[Killed] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:169:77
         }
         public static bool morningToNoon_Departure_Filter(object item)//test
         {
-            if (((item as Flight).TimeDeparture.CompareTo("06:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("11:59")) <= 0)
+            if (((item as Flight).TimeDeparture.CompareTo("06:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("11:59")) > 0)
             {
                 return true;
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.morningToNoon_FilterTest

[Killed] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:177:17
         }
         public static bool noonToEvening_Departure_Filter(object item)//test
         {
-            if (((item as Flight).TimeDeparture.CompareTo("12:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("17:59")) <= 0)
+            if (!(((item as Flight).TimeDeparture.CompareTo("12:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("17:59")) <= 0))
             {
                 return true;
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.noonToEvening_FilterTest

[Killed] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:177:77
         }
         public static bool noonToEvening_Departure_Filter(object item)//test
         {
-            if (((item as Flight).TimeDeparture.CompareTo("12:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("17:59")) <= 0)
+            if (((item as Flight).TimeDeparture.CompareTo("12:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("17:59")) < 0)
             {
                 return true;
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.noonToEvening_FilterTest

[Killed] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Model/DataProvider.cs:185:17
         }
         public static bool eveningToNight_Departure_Filter(object item)//test
         {
-            if (((item as Flight).TimeDeparture.CompareTo("18:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("23:59")) <= 0)
+            if (!(((item as Flight).TimeDeparture.CompareTo("18:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("23:59")) <= 0))
             {
                 return true;
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.DataProviderTest.eveningToNight_FilterTest
