[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:73:122
         //set up flightList Screen
         public void FlightSearched(string departure, string destination, string date, int quantity, string flightClass)
         {
-            infoSearch.Text = departure + " -> " + destination + " | " + date + " | " + flightClass + " | " + quantity + " người";
+            infoSearch.Text = departure + " -> " + destination + " | " + date + " | " + flightClass + " | " + quantity + "";
            
             DataProvider.sqlConnection.Open();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:73:66
         //set up flightList Screen
         public void FlightSearched(string departure, string destination, string date, int quantity, string flightClass)
         {
-            infoSearch.Text = departure + " -> " + destination + " | " + date + " | " + flightClass + " | " + quantity + " người";
+            infoSearch.Text = departure + " -> " + destination + "" + date + " | " + flightClass + " | " + quantity + " người";
            
             DataProvider.sqlConnection.Open();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:98:18
             {
                 sqlCommand = new SqlCommand(
-                 "where NgayKhoiHanh=@date " +
+                 "" +
                  "and [c].SanBayDi=[s1].MaSanBay " +
                  "and [c].SanBayDen=[s2].MaSanBay " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:101:18
                  "where NgayKhoiHanh=@date " +
                  "and [c].SanBayDi=[s1].MaSanBay " +
                  "and [c].SanBayDen=[s2].MaSanBay " +
-                 "and [c].MaHangMayBay=[hmb].MaHang " +
+                 "" +
                  "and [s1].Tinh=@departure " +
                  "and [s2].Tinh=@destination " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:105:40
                  "and [s1].Tinh=@departure " +
                  "and [s2].Tinh=@destination " +
                  "and MaChuyenBay in (select MaChuyenBay from [VE] [v] " +
-                                       " where TinhTrang = N'TRONG' " +
+                                       "" +
                                        "group by MaChuyenBay " +
                                        "having count(MaVe)>=@quantity)",

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:111:39
                 DataProvider.sqlConnection);
             }
             sqlCommand.Parameters.Add("@date", SqlDbType.NVarChar).Value = date;
-            sqlCommand.Parameters.Add("@departure", SqlDbType.NVarChar).Value = departure;
+            sqlCommand.Parameters.Add("", SqlDbType.NVarChar).Value = departure;
             sqlCommand.Parameters.Add("@destination", SqlDbType.NVarChar).Value = destination;
             sqlCommand.Parameters.Add("@flightClass", SqlDbType.NVarChar).Value = flightClass;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:112:39
             }
             sqlCommand.Parameters.Add("@date", SqlDbType.NVarChar).Value = date;
             sqlCommand.Parameters.Add("@departure", SqlDbType.NVarChar).Value = departure;
-            sqlCommand.Parameters.Add("@destination", SqlDbType.NVarChar).Value = destination;
+            sqlCommand.Parameters.Add("", SqlDbType.NVarChar).Value = destination;
             sqlCommand.Parameters.Add("@flightClass", SqlDbType.NVarChar).Value = flightClass;
             sqlCommand.Parameters.Add("@quantity", SqlDbType.Int).Value = quantity; 

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:122:49
                 while (reader.Read())
                 {
                     string flightID = reader["MaChuyenBay"].ToString();
-                    string airlineLogo = reader["Logo"].ToString();
+                    string airlineLogo = reader[""].ToString();
                     string airlineName = reader["TenHang"].ToString();
                     string airportDepartureName = reader["SanBayDi"].ToString();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:124:58
                     string flightID = reader["MaChuyenBay"].ToString();
                     string airlineLogo = reader["Logo"].ToString();
                     string airlineName = reader["TenHang"].ToString();
-                    string airportDepartureName = reader["SanBayDi"].ToString();
+                    string airportDepartureName = reader[""].ToString();
                     string airportDestinationName = reader["SanBayDen"].ToString();
                     string ngayGioXuatPhat = reader["NgayKhoiHanh"].ToString() + " " + reader["ThoiGianXuatPhat"].ToString();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:147:13
 
             lvFlight.ItemsSource = flight_list;
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
-            setIsHavingData(view);
+            ;
         }
 

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:200:59
         {
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.SortDescriptions.Clear();
-            view.SortDescriptions.Add(new SortDescription("TimeDestination", ListSortDirection.Ascending));
+            view.SortDescriptions.Add(new SortDescription("", ListSortDirection.Ascending));
         }
 

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:207:59
         {
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.SortDescriptions.Clear();
-            view.SortDescriptions.Add(new SortDescription("TimeDestination", ListSortDirection.Descending));
+            view.SortDescriptions.Add(new SortDescription("", ListSortDirection.Descending));
         }
         private void sortTimeDepartureAsc_Click(object sender, RoutedEventArgs e)

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:213:59
         {
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.SortDescriptions.Clear();
-            view.SortDescriptions.Add(new SortDescription("TimeDeparture", ListSortDirection.Ascending));
+            view.SortDescriptions.Add(new SortDescription("", ListSortDirection.Ascending));
         }
 

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:220:59
         {
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.SortDescriptions.Clear();
-            view.SortDescriptions.Add(new SortDescription("TimeDeparture", ListSortDirection.Descending));
+            view.SortDescriptions.Add(new SortDescription("", ListSortDirection.Descending));
         }
         private bool nightToMorning_Destination_Filter(object item)

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:224:79
         }
         private bool nightToMorning_Destination_Filter(object item)
         {
-            if (((item as Flight).TimeDestination.CompareTo("00:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("05:59")) <= 0)
+            if (((item as Flight).TimeDestination.CompareTo("00:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("05:59")) < 0)
             {
                 return true;

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:240:17
         }
         private bool noonToEvening_Destination_Filter(object item)
         {
-            if (((item as Flight).TimeDestination.CompareTo("12:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("17:59")) <= 0)
+            if (((item as Flight).TimeDestination.CompareTo("12:00")) < 0 && ((item as Flight).TimeDestination.CompareTo("17:59")) <= 0)
             {
                 return true;

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:248:17
         }
         private bool eveningToNight_Destination_Filter(object item)//test
         {
-            if (((item as Flight).TimeDestination.CompareTo("18:00")) >= 0 && ((item as Flight).TimeDestination.CompareTo("23:59")) <= 0)
+            if (((item as Flight).TimeDestination.CompareTo("18:00")) > 0 && ((item as Flight).TimeDestination.CompareTo("23:59")) <= 0)
             {
                 return true;

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:257:77
 
         private bool nightToMorning_Departure_Filter(object item)
         {
-            if (((item as Flight).TimeDeparture.CompareTo("00:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("05:59")) <= 0)
+            if (((item as Flight).TimeDeparture.CompareTo("00:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("05:59")) > 0)
             {
                 return true;

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:281:17
         }
         private bool eveningToNight_Departure_Filter(object item)//test
         {
-            if (((item as Flight).TimeDeparture.CompareTo("18:00")) >= 0 && ((item as Flight).TimeDeparture.CompareTo("23:59")) <= 0)
+            if (((item as Flight).TimeDeparture.CompareTo("18:00")) < 0 && ((item as Flight).TimeDeparture.CompareTo("23:59")) <= 0)
             {
                 return true;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:292:13
             CollectionViewSource.GetDefaultView(lvFlight.ItemsSource).Refresh();
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.Filter = DataProvider.noStopFilter;
-            setIsHavingData(view);
+            ;
         }
 

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:307:13
             CollectionViewSource.GetDefaultView(lvFlight.ItemsSource).Refresh();
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.Filter = DataProvider.oneStopFilter;
-            setIsHavingData(view);
+            ;
         }
         private void moreTwoStopFilter_Click(object sender, RoutedEventArgs e)

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:314:13
             CollectionViewSource.GetDefaultView(lvFlight.ItemsSource).Refresh();
             CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
             view.Filter = DataProvider.moreTwoStopFilter;
-            setIsHavingData(view);
+            ;
         }
         //filter destination

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:380:17
         private void lvAirline_SelectionChanged(object sender, SelectionChangedEventArgs e)
         {
             DataProvider.selectedAirlineName = lvAirline.SelectedItem as string;
-            if (DataProvider.selectedAirlineName != null)
+            if (DataProvider.selectedAirlineName == null)
             {
                 CollectionViewSource.GetDefaultView(lvFlight.ItemsSource).Refresh();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightsList.xaml.cs:385:17
                 CollectionViewSource.GetDefaultView(lvFlight.ItemsSource).Refresh();
                 CollectionView view = (CollectionView)CollectionViewSource.GetDefaultView(lvFlight.ItemsSource);
                 view.Filter = DataProvider.airlineNameFilter;
-                setIsHavingData(view);
+                ;
             }
             lvAirline.SelectedIndex = -1;
