[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:156:29
         {
             tickets = new List<Ticket>();
             TicketID_Chosen = new List<string>();
-            for (int i = 1; i < flight_classes.Count; i++)
+            for (int i = 1; i > flight_classes.Count; i++)
             {
                 DataProvider.sqlConnection.Open();

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:156:29
         {
             tickets = new List<Ticket>();
             TicketID_Chosen = new List<string>();
-            for (int i = 1; i < flight_classes.Count; i++)
+            for (int i = 1; i <= flight_classes.Count; i++)
             {
                 DataProvider.sqlConnection.Open();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:161:18
                 DataProvider.sqlConnection.Open();
                 SqlCommand sqlCommand = new SqlCommand(
                  "select [v].MaVe, [v].MaHangVe, [v].SoGhe, [v].TinhTrang from [VE] [v], [HANGVE] [hv]" +
-                 "where [v].MaChuyenBay=@flightID " +
+                 "" +
                  "and [v].MaHangVe = [hv].MaHangVe " +
                  "and [hv].MaHangVe=@flightClassID " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:162:18
                 SqlCommand sqlCommand = new SqlCommand(
                  "select [v].MaVe, [v].MaHangVe, [v].SoGhe, [v].TinhTrang from [VE] [v], [HANGVE] [hv]" +
                  "where [v].MaChuyenBay=@flightID " +
-                 "and [v].MaHangVe = [hv].MaHangVe " +
+                 "" +
                  "and [hv].MaHangVe=@flightClassID " +
                  "order by cast(SoGhe as int) asc",

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:166:43
                  "and [hv].MaHangVe=@flightClassID " +
                  "order by cast(SoGhe as int) asc",
                 DataProvider.sqlConnection);
-                sqlCommand.Parameters.Add("@flightID", SqlDbType.NVarChar).Value = flightID;
+                sqlCommand.Parameters.Add("", SqlDbType.NVarChar).Value = flightID;
                 sqlCommand.Parameters.Add("@flightClassID", SqlDbType.NVarChar).Value = flight_classes[i].ClassId;
                 SqlDataReader reader = sqlCommand.ExecuteReader();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:167:43
                  "order by cast(SoGhe as int) asc",
                 DataProvider.sqlConnection);
                 sqlCommand.Parameters.Add("@flightID", SqlDbType.NVarChar).Value = flightID;
-                sqlCommand.Parameters.Add("@flightClassID", SqlDbType.NVarChar).Value = flight_classes[i].ClassId;
+                sqlCommand.Parameters.Add("", SqlDbType.NVarChar).Value = flight_classes[i].ClassId;
                 SqlDataReader reader = sqlCommand.ExecuteReader();
                 if (reader.HasRows)

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:173:50
                 {
                     while (reader.Read())
                     {
-                        string ticketID = reader["MaVe"].ToString();
+                        string ticketID = reader[""].ToString();
                         string flightClass = reader["MaHangVe"].ToString();
                         int seatNumber = int.Parse(reader["SoGhe"].ToString());

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:176:48
                         string ticketID = reader["MaVe"].ToString();
                         string flightClass = reader["MaHangVe"].ToString();
                         int seatNumber = int.Parse(reader["SoGhe"].ToString());
-                        string status = reader["TinhTrang"].ToString();
+                        string status = reader[""].ToString();
                         string color;
                         if (status == "TRONG")

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:214:21
                 if (button.Background != Brushes.Green)
                 {
                     button.Background = Brushes.Green;
-                    TicketID_Chosen.Add(ticket.TicketID);
+                    ;
                 }
                 else

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/FlightDetail.xaml.cs:218:21
                 }
                 else
                 {
-                    TicketID_Chosen.Remove(ticket.TicketID);
+                    ;
                     button.Background = (SolidColorBrush)new BrushConverter().ConvertFromString(ticket.Color);
                     button.Background = (SolidColorBrush)new BrushConverter().ConvertFromString(ticket.Color);
