[NoCoverage] Logical mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Pages/Home.xaml.cs:44:17
         }
         public void btnSearch_Click(object sender, RoutedEventArgs e)
         {
-            if (cbbDeparture.Text == "" || cbbDestination.Text == "" || cbbQuantity.Text == "" || date.Text == "")
+            if (cbbDeparture.Text == "" && cbbDestination.Text == "" || cbbQuantity.Text == "" || date.Text == "")
             {
                 MessageBox.Show("Mời bạn chọn đầy đủ thông tin");
