[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:160:32
             {
                 string ngayKH = "";
                 string gioKH = "";
-                string query = "SELECT * FROM CHUYENBAY where MaCHuyenBay = @ma";
+                string query = "";
                 SqlParameter param1 = new SqlParameter("@ma", chuyenbaytofix.maCB);
                 using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text, param1))

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:187:37
                 DateTime specificTime = new DateTime(nam, thang, ngay, int.Parse(thoigianKH[0]), int.Parse(thoigianKH[1]), second);
                 if (specificTime <= currentTime)
                 {
-                    MessageBox.Show("Chuyến bay này đã khởi hành, không thể sửa ", "Thông báo");
+                    MessageBox.Show("", "Thông báo");
                     return;
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:229:28
             if (info != null)
             {
                 q.machuyenbayTxb.Text = info.maCB;
-                string s = "SELECT * From SANBAY WHERE MaSanBay = @ma";
+                string s = "";
                 SqlParameter p = new SqlParameter("@ma", info.SBdi);
                 using (SqlDataReader reader = DataProvider.ExecuteReader(s, CommandType.Text, p))

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:239:21
                     }
                 }
                 // q.fromTxb.Text = info.SBden;
-                s = "SELECT * From SANBAY WHERE MaSanBay = @ma";
+                s = "";
                 p = new SqlParameter("@ma", info.SBden);
                 using (SqlDataReader reader = DataProvider.ExecuteReader(s, CommandType.Text, p))

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:270:33
     public class chuyenbayclass
     {
         string _STT, _maCB, _SBdi, _SBden, _datetime, _tgBay, _Gia;
-        public string STT { get { return _STT; } set { _STT = value; } }
+        public string STT { get {} set { _STT = value; } }
         public string maCB { get { return _maCB; } set { _maCB = value; } }
         public string SBdi { get { return _SBdi; } set { _SBdi = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.ChuyenBayClassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:270:54
     public class chuyenbayclass
     {
         string _STT, _maCB, _SBdi, _SBden, _datetime, _tgBay, _Gia;
-        public string STT { get { return _STT; } set { _STT = value; } }
+        public string STT { get { return _STT; } set {} }
         public string maCB { get { return _maCB; } set { _maCB = value; } }
         public string SBdi { get { return _SBdi; } set { _SBdi = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.ChuyenBayClassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:271:56
     {
         string _STT, _maCB, _SBdi, _SBden, _datetime, _tgBay, _Gia;
         public string STT { get { return _STT; } set { _STT = value; } }
-        public string maCB { get { return _maCB; } set { _maCB = value; } }
+        public string maCB { get { return _maCB; } set {} }
         public string SBdi { get { return _SBdi; } set { _SBdi = value; } }
         public string SBden { get { return _SBden; } set { _SBden = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.ChuyenBayClassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:271:34
     {
         string _STT, _maCB, _SBdi, _SBden, _datetime, _tgBay, _Gia;
         public string STT { get { return _STT; } set { _STT = value; } }
-        public string maCB { get { return _maCB; } set { _maCB = value; } }
+        public string maCB { get {} set { _maCB = value; } }
         public string SBdi { get { return _SBdi; } set { _SBdi = value; } }
         public string SBden { get { return _SBden; } set { _SBden = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.ChuyenBayClassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:272:34
         string _STT, _maCB, _SBdi, _SBden, _datetime, _tgBay, _Gia;
         public string STT { get { return _STT; } set { _STT = value; } }
         public string maCB { get { return _maCB; } set { _maCB = value; } }
-        public string SBdi { get { return _SBdi; } set { _SBdi = value; } }
+        public string SBdi { get {} set { _SBdi = value; } }
         public string SBden { get { return _SBden; } set { _SBden = value; } }
         public string datetime { get { return _datetime; } set { _datetime = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.ChuyenBayClassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:272:56
         string _STT, _maCB, _SBdi, _SBden, _datetime, _tgBay, _Gia;
         public string STT { get { return _STT; } set { _STT = value; } }
         public string maCB { get { return _maCB; } set { _maCB = value; } }
-        public string SBdi { get { return _SBdi; } set { _SBdi = value; } }
+        public string SBdi { get { return _SBdi; } set {} }
         public string SBden { get { return _SBden; } set { _SBden = value; } }
         public string datetime { get { return _datetime; } set { _datetime = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.ChuyenBayClassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:273:58
         public string STT { get { return _STT; } set { _STT = value; } }
         public string maCB { get { return _maCB; } set { _maCB = value; } }
         public string SBdi { get { return _SBdi; } set { _SBdi = value; } }
-        public string SBden { get { return _SBden; } set { _SBden = value; } }
+        public string SBden { get { return _SBden; } set {} }
         public string datetime { get { return _datetime; } set { _datetime = value; } }
         public string tgBay { get { return _tgBay; } set { _tgBay = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.ChuyenBayClassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:273:35
         public string STT { get { return _STT; } set { _STT = value; } }
         public string maCB { get { return _maCB; } set { _maCB = value; } }
         public string SBdi { get { return _SBdi; } set { _SBdi = value; } }
-        public string SBden { get { return _SBden; } set { _SBden = value; } }
+        public string SBden { get {} set { _SBden = value; } }
         public string datetime { get { return _datetime; } set { _datetime = value; } }
         public string tgBay { get { return _tgBay; } set { _tgBay = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.ChuyenBayClassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:274:64
         public string maCB { get { return _maCB; } set { _maCB = value; } }
         public string SBdi { get { return _SBdi; } set { _SBdi = value; } }
         public string SBden { get { return _SBden; } set { _SBden = value; } }
-        public string datetime { get { return _datetime; } set { _datetime = value; } }
+        public string datetime { get { return _datetime; } set {} }
         public string tgBay { get { return _tgBay; } set { _tgBay = value; } }
         public string Gia { get { return _Gia; } set { _Gia = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.ChuyenBayClassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:274:38
         public string maCB { get { return _maCB; } set { _maCB = value; } }
         public string SBdi { get { return _SBdi; } set { _SBdi = value; } }
         public string SBden { get { return _SBden; } set { _SBden = value; } }
-        public string datetime { get { return _datetime; } set { _datetime = value; } }
+        public string datetime { get {} set { _datetime = value; } }
         public string tgBay { get { return _tgBay; } set { _tgBay = value; } }
         public string Gia { get { return _Gia; } set { _Gia = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.ChuyenBayClassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:275:58
         public string SBdi { get { return _SBdi; } set { _SBdi = value; } }
         public string SBden { get { return _SBden; } set { _SBden = value; } }
         public string datetime { get { return _datetime; } set { _datetime = value; } }
-        public string tgBay { get { return _tgBay; } set { _tgBay = value; } }
+        public string tgBay { get { return _tgBay; } set {} }
         public string Gia { get { return _Gia; } set { _Gia = value; } }
     }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.ChuyenBayClassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:275:35
         public string SBdi { get { return _SBdi; } set { _SBdi = value; } }
         public string SBden { get { return _SBden; } set { _SBden = value; } }
         public string datetime { get { return _datetime; } set { _datetime = value; } }
-        public string tgBay { get { return _tgBay; } set { _tgBay = value; } }
+        public string tgBay { get {} set { _tgBay = value; } }
         public string Gia { get { return _Gia; } set { _Gia = value; } }
     }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.ChuyenBayClassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:276:33
         public string SBden { get { return _SBden; } set { _SBden = value; } }
         public string datetime { get { return _datetime; } set { _datetime = value; } }
         public string tgBay { get { return _tgBay; } set { _tgBay = value; } }
-        public string Gia { get { return _Gia; } set { _Gia = value; } }
+        public string Gia { get {} set { _Gia = value; } }
     }
     public class SanbayTG
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.ChuyenBayClassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:276:54
         public string SBden { get { return _SBden; } set { _SBden = value; } }
         public string datetime { get { return _datetime; } set { _datetime = value; } }
         public string tgBay { get { return _tgBay; } set { _tgBay = value; } }
-        public string Gia { get { return _Gia; } set { _Gia = value; } }
+        public string Gia { get { return _Gia; } set {} }
     }
     public class SanbayTG
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.ChuyenBayClassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:281:54
     public class SanbayTG
     {
         string _STT, _tenSB, _TGdung, _ghichu;
-        public string STT { get { return _STT; } set { _STT = value; } }
+        public string STT { get { return _STT; } set {} }
         public string tenSB { get { return _tenSB; } set { _tenSB = value; } }
         public string TGdung { get { return _TGdung; } set { _TGdung = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.SanbayTGTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:281:33
     public class SanbayTG
     {
         string _STT, _tenSB, _TGdung, _ghichu;
-        public string STT { get { return _STT; } set { _STT = value; } }
+        public string STT { get {} set { _STT = value; } }
         public string tenSB { get { return _tenSB; } set { _tenSB = value; } }
         public string TGdung { get { return _TGdung; } set { _TGdung = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.SanbayTGTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:282:35
     {
         string _STT, _tenSB, _TGdung, _ghichu;
         public string STT { get { return _STT; } set { _STT = value; } }
-        public string tenSB { get { return _tenSB; } set { _tenSB = value; } }
+        public string tenSB { get {} set { _tenSB = value; } }
         public string TGdung { get { return _TGdung; } set { _TGdung = value; } }
         public string ghichu { get { return _ghichu; } set { _ghichu = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.SanbayTGTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:282:58
     {
         string _STT, _tenSB, _TGdung, _ghichu;
         public string STT { get { return _STT; } set { _STT = value; } }
-        public string tenSB { get { return _tenSB; } set { _tenSB = value; } }
+        public string tenSB { get { return _tenSB; } set {} }
         public string TGdung { get { return _TGdung; } set { _TGdung = value; } }
         public string ghichu { get { return _ghichu; } set { _ghichu = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.SanbayTGTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:283:36
         string _STT, _tenSB, _TGdung, _ghichu;
         public string STT { get { return _STT; } set { _STT = value; } }
         public string tenSB { get { return _tenSB; } set { _tenSB = value; } }
-        public string TGdung { get { return _TGdung; } set { _TGdung = value; } }
+        public string TGdung { get {} set { _TGdung = value; } }
         public string ghichu { get { return _ghichu; } set { _ghichu = value; } }
     }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.SanbayTGTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:283:60
         string _STT, _tenSB, _TGdung, _ghichu;
         public string STT { get { return _STT; } set { _STT = value; } }
         public string tenSB { get { return _tenSB; } set { _tenSB = value; } }
-        public string TGdung { get { return _TGdung; } set { _TGdung = value; } }
+        public string TGdung { get { return _TGdung; } set {} }
         public string ghichu { get { return _ghichu; } set { _ghichu = value; } }
     }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.SanbayTGTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:284:60
         public string STT { get { return _STT; } set { _STT = value; } }
         public string tenSB { get { return _tenSB; } set { _tenSB = value; } }
         public string TGdung { get { return _TGdung; } set { _TGdung = value; } }
-        public string ghichu { get { return _ghichu; } set { _ghichu = value; } }
+        public string ghichu { get { return _ghichu; } set {} }
     }
 }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.SanbayTGTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Chuyenbay.xaml.cs:284:36
         public string STT { get { return _STT; } set { _STT = value; } }
         public string tenSB { get { return _tenSB; } set { _tenSB = value; } }
         public string TGdung { get { return _TGdung; } set { _TGdung = value; } }
-        public string ghichu { get { return _ghichu; } set { _ghichu = value; } }
+        public string ghichu { get {} set { _ghichu = value; } }
     }
 }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.SanbayTGTest
