[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Hangmaybay.xaml.cs:90:37
                     con.Close();
                     HangMBTable.Items.Clear();
                     loadDatatoTable();
-                    MessageBox.Show("Xóa hãng bay thành công ", "Thông báo");
+                    MessageBox.Show("", "Thông báo");
                 }
                 catch

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Hangmaybay.xaml.cs:131:54
     public class HangMBclass
     {
         string _STT, _mahang, _tenhang; 
-        public string STT { get { return _STT; } set { _STT = value; } }
+        public string STT { get { return _STT; } set {} }
         public string mahang { get { return _mahang; } set { _mahang = value; } }
         public string tenhang { get { return _tenhang; } set { _tenhang = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.HangMBclassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Hangmaybay.xaml.cs:131:33
     public class HangMBclass
     {
         string _STT, _mahang, _tenhang; 
-        public string STT { get { return _STT; } set { _STT = value; } }
+        public string STT { get {} set { _STT = value; } }
         public string mahang { get { return _mahang; } set { _mahang = value; } }
         public string tenhang { get { return _tenhang; } set { _tenhang = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.HangMBclassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Hangmaybay.xaml.cs:132:36
     {
         string _STT, _mahang, _tenhang; 
         public string STT { get { return _STT; } set { _STT = value; } }
-        public string mahang { get { return _mahang; } set { _mahang = value; } }
+        public string mahang { get {} set { _mahang = value; } }
         public string tenhang { get { return _tenhang; } set { _tenhang = value; } }
     }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.HangMBclassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Hangmaybay.xaml.cs:132:60
     {
         string _STT, _mahang, _tenhang; 
         public string STT { get { return _STT; } set { _STT = value; } }
-        public string mahang { get { return _mahang; } set { _mahang = value; } }
+        public string mahang { get { return _mahang; } set {} }
         public string tenhang { get { return _tenhang; } set { _tenhang = value; } }
     }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.HangMBclassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Hangmaybay.xaml.cs:133:37
         string _STT, _mahang, _tenhang; 
         public string STT { get { return _STT; } set { _STT = value; } }
         public string mahang { get { return _mahang; } set { _mahang = value; } }
-        public string tenhang { get { return _tenhang; } set { _tenhang = value; } }
+        public string tenhang { get {} set { _tenhang = value; } }
     }
 }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.HangMBclassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Hangmaybay.xaml.cs:133:62
         string _STT, _mahang, _tenhang; 
         public string STT { get { return _STT; } set { _STT = value; } }
         public string mahang { get { return _mahang; } set { _mahang = value; } }
-        public string tenhang { get { return _tenhang; } set { _tenhang = value; } }
+        public string tenhang { get { return _tenhang; } set {} }
     }
 }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.HangMBclassTest
