[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/MonthRevenue.xaml.cs:64:17
             MonthRevenueTable.Items.Clear();
 
             string query =
-                "SELECT C.MaChuyenBay, " +
+                "" +
                     "COUNT(DISTINCT MaVe) AS SoVe, " +
                     "COALESCE(SUM(V.GiaVe), 0) AS DoanhThu, " +
