[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:132:17
         {
             int oldvalue = ruleChangeVM.SoSanBayTrungGianToiDa;
 
-            if (!DataProvider.isPositiveInteger(SSBTGTD.Text))
+            if (DataProvider.isPositiveInteger(SSBTGTD.Text))
             {
                 MessageBox.Show("Vui lòng nhập một số nguyên dương.", "Dữ liệu không hợp lệ!");

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:159:21
             {
                 int oldvalue = ruleChangeVM.ThoiGianDungToiThieu;
                 
-                if (int.Parse(TGDTT.Text) <= 5)
+                if (int.Parse(TGDTT.Text) < 5)
                 {
                     MessageBox.Show("Vui lòng nhập thời gian dừng tối thiểu lớn hơn 5 phút.", "Dữ liệu không hợp lệ!");

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:161:95
                 
                 if (int.Parse(TGDTT.Text) <= 5)
                 {
-                    MessageBox.Show("Vui lòng nhập thời gian dừng tối thiểu lớn hơn 5 phút.", "Dữ liệu không hợp lệ!");
+                    MessageBox.Show("Vui lòng nhập thời gian dừng tối thiểu lớn hơn 5 phút.", "");
                     return;
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:176:33
             }
             catch (Exception ex)
             {
-                MessageBox.Show("Vui lòng nhập một số nguyên.", "Dữ liệu không hợp lệ!");
+                MessageBox.Show("", "Dữ liệu không hợp lệ!");
             }
         }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:192:21
             {
                 int oldvalue = ruleChangeVM.ThoiGianDungToiDa;
                 
-                if (int.Parse(TGDTD.Text) <= 5)
+                if (int.Parse(TGDTD.Text) < 5)
                 {
                     MessageBox.Show("Vui lòng nhập thời gian dừng tối đa lớn hơn 5 phút.", "Dữ liệu không hợp lệ!");

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:222:16
         {
             
             int oldvalue = ruleChangeVM.SoGioTruocKhoiHanhChoPhepDatVe;
-            if(!DataProvider.isPositiveInteger(SGTKHCPDV.Text))
+            if(DataProvider.isPositiveInteger(SGTKHCPDV.Text))
             {
                 MessageBox.Show("Vui lòng nhập một số nguyên dương.", "Dữ liệu không hợp lệ!");

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:246:17
         private void OkSGTKHCPHVBtn_Click(object sender, RoutedEventArgs e)
         { 
             int oldvalue = ruleChangeVM.SoGioTruocKhoiHanhChoPhepHuyVe;
-            if (!DataProvider.isPositiveInteger(SGTKHCPHV.Text))
+            if (DataProvider.isPositiveInteger(SGTKHCPHV.Text))
             {
                 MessageBox.Show("Vui lòng nhập một số nguyên dương.", "Dữ liệu không hợp lệ!");

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/RuleChange.xaml.cs:254:125
             ruleChangeVM.SoGioTruocKhoiHanhChoPhepHuyVe = int.Parse(SGTKHCPHV.Text);
             SqlConnection sqlCon = DataProvider.sqlConnection;
             sqlCon.Open();
-            SqlCommand cmd = new SqlCommand("Update BANGTHAMSO set GiaTri=" + ruleChangeVM.SoGioTruocKhoiHanhChoPhepHuyVe + "where CONVERT(varchar, TenThamSo)='ThoiGianChamNhatChoPhepHuyVe'", sqlCon);
+            SqlCommand cmd = new SqlCommand("Update BANGTHAMSO set GiaTri=" + ruleChangeVM.SoGioTruocKhoiHanhChoPhepHuyVe + "", sqlCon);
             cmd.CommandType = CommandType.Text;
             cmd.ExecuteNonQuery();
