[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:83:56
             {
                 int kt = 0;
                 string query = "SELECT * From CHUYENBAY where SanBayDi = @sbdi";
-                SqlParameter param1 = new SqlParameter("@sbdi", info.maSB);
+                SqlParameter param1 = new SqlParameter("", info.maSB);
                 using (SqlDataReader reader = DataProvider.ExecuteReader(query, CommandType.Text, param1))
                 {

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:109:53
                     {
                         con.Open();
                     }
-                    SqlCommand cmd = new SqlCommand("Delete from SANBAY where MaSanBay=N'" + info.maSB + "'", con);
+                    SqlCommand cmd = new SqlCommand("" + info.maSB + "'", con);
                     cmd.CommandType = CommandType.Text;
                     cmd.ExecuteReader();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:119:66
                 }
                 else
                 {
-                    MessageBox.Show("Sân bay này không thể xóa", "Thông báo");
+                    MessageBox.Show("Sân bay này không thể xóa", "");
                 }
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:124:33
             }
             else
             {
-                MessageBox.Show("Vui lòng chọn dòng bạn muốn xóa");
+                MessageBox.Show("");
             }
 

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:165:54
     public class sanbayclass
     {
         string _STT, _maSB, _tenSB, _tinh;
-        public string STT { get { return _STT; } set { _STT = value; } }
+        public string STT { get { return _STT; } set {} }
         public string maSB { get { return _maSB; } set { _maSB = value; } }
         public string tenSB { get { return _tenSB; } set { _tenSB = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.sanbayclassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:165:33
     public class sanbayclass
     {
         string _STT, _maSB, _tenSB, _tinh;
-        public string STT { get { return _STT; } set { _STT = value; } }
+        public string STT { get {} set { _STT = value; } }
         public string maSB { get { return _maSB; } set { _maSB = value; } }
         public string tenSB { get { return _tenSB; } set { _tenSB = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.sanbayclassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:166:34
     {
         string _STT, _maSB, _tenSB, _tinh;
         public string STT { get { return _STT; } set { _STT = value; } }
-        public string maSB { get { return _maSB; } set { _maSB = value; } }
+        public string maSB { get {} set { _maSB = value; } }
         public string tenSB { get { return _tenSB; } set { _tenSB = value; } }
         public string tinh { get { return _tinh; } set { _tinh = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.sanbayclassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:166:56
     {
         string _STT, _maSB, _tenSB, _tinh;
         public string STT { get { return _STT; } set { _STT = value; } }
-        public string maSB { get { return _maSB; } set { _maSB = value; } }
+        public string maSB { get { return _maSB; } set {} }
         public string tenSB { get { return _tenSB; } set { _tenSB = value; } }
         public string tinh { get { return _tinh; } set { _tinh = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.sanbayclassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:167:58
         string _STT, _maSB, _tenSB, _tinh;
         public string STT { get { return _STT; } set { _STT = value; } }
         public string maSB { get { return _maSB; } set { _maSB = value; } }
-        public string tenSB { get { return _tenSB; } set { _tenSB = value; } }
+        public string tenSB { get { return _tenSB; } set {} }
         public string tinh { get { return _tinh; } set { _tinh = value; } }
     }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.sanbayclassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:167:35
         string _STT, _maSB, _tenSB, _tinh;
         public string STT { get { return _STT; } set { _STT = value; } }
         public string maSB { get { return _maSB; } set { _maSB = value; } }
-        public string tenSB { get { return _tenSB; } set { _tenSB = value; } }
+        public string tenSB { get {} set { _tenSB = value; } }
         public string tinh { get { return _tinh; } set { _tinh = value; } }
     }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.sanbayclassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:168:34
         public string STT { get { return _STT; } set { _STT = value; } }
         public string maSB { get { return _maSB; } set { _maSB = value; } }
         public string tenSB { get { return _tenSB; } set { _tenSB = value; } }
-        public string tinh { get { return _tinh; } set { _tinh = value; } }
+        public string tinh { get {} set { _tinh = value; } }
     }
 }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.sanbayclassTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/Sanbay.xaml.cs:168:56
         public string STT { get { return _STT; } set { _STT = value; } }
         public string maSB { get { return _maSB; } set { _maSB = value; } }
         public string tenSB { get { return _tenSB; } set { _tenSB = value; } }
-        public string tinh { get { return _tinh; } set { _tinh = value; } }
+        public string tinh { get { return _tinh; } set {} }
     }
 }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.sanbayclassTest
