[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:56:17
             //    "ORDER BY SUBSTRING(C.NgayKhoiHanh, 4, 2) ASC";
 
             string query = "WITH AllMonths AS (" +
-                "SELECT '01' AS MonthNumber UNION ALL SELECT '02' UNION ALL SELECT '03' UNION ALL SELECT '04' UNION ALL " +
+                "" +
                 "SELECT '05' UNION ALL SELECT '06' UNION ALL SELECT '07' UNION ALL SELECT '08' UNION ALL " +
                 "SELECT '09' UNION ALL SELECT '10' UNION ALL SELECT '11' UNION ALL SELECT '12'" +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:61:17
                 "SELECT '09' UNION ALL SELECT '10' UNION ALL SELECT '11' UNION ALL SELECT '12'" +
                 ")" +
                 "SELECT AllMonths.MonthNumber AS Thang, " +
-                "COUNT(DISTINCT C.MaChuyenBay) AS SoChuyenBay, " +
+                "" +
                 "COALESCE(SUM(V.GiaVe), 0) AS DoanhThu, " +
                 "CASE WHEN SUM(V.GiaVe) > 0 THEN " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:68:17
                 "       (SELECT SUM(V1.GiaVe) " +
                 "       FROM VE V1 " +
                 "       JOIN CHUYENBAY C1 ON V1.MaChuyenBay = C1.MaChuyenBay " +
-                "       WHERE SUBSTRING(C1.NgayKhoiHanh, 7, 4) = @Year " +
+                "" +
                 "           AND V1.TinhTrang = 'SOLD') " +
                 "ELSE 0 END AS TyLe " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:73:17
                 "ELSE 0 END AS TyLe " +
                 "FROM AllMonths " +
                 "LEFT JOIN CHUYENBAY C ON AllMonths.MonthNumber = SUBSTRING(C.NgayKhoiHanh, 4, 2) " +
-                "AND SUBSTRING(C.NgayKhoiHanh, 7, 4) = @Year " +
+                "" +
                 "LEFT JOIN VE V ON C.MaChuyenBay = V.MaChuyenBay " +
                 "AND V.TinhTrang = 'SOLD' " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:76:17
                 "AND SUBSTRING(C.NgayKhoiHanh, 7, 4) = @Year " +
                 "LEFT JOIN VE V ON C.MaChuyenBay = V.MaChuyenBay " +
                 "AND V.TinhTrang = 'SOLD' " +
-                "GROUP BY AllMonths.MonthNumber " +
+                "" +
                 "ORDER BY AllMonths.MonthNumber ASC";
 

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:77:17
                 "LEFT JOIN VE V ON C.MaChuyenBay = V.MaChuyenBay " +
                 "AND V.TinhTrang = 'SOLD' " +
                 "GROUP BY AllMonths.MonthNumber " +
-                "ORDER BY AllMonths.MonthNumber ASC";
+                "";
 
             SqlParameter param1 = new SqlParameter("@Year", int.Parse(cBox.SelectedItem.ToString()));

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:146:63
     public class YearSale
     {
         string _soCB, _thang, _doanhthu, _tile;
-        public string sochuyenbay { get { return _soCB; } set { _soCB = value; } }
+        public string sochuyenbay { get { return _soCB; } set {} }
         public string thang { get { return _thang; } set { _thang = value; } }
         public string doanhthu { get { return _doanhthu; } set { _doanhthu = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.YearSaleTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:146:41
     public class YearSale
     {
         string _soCB, _thang, _doanhthu, _tile;
-        public string sochuyenbay { get { return _soCB; } set { _soCB = value; } }
+        public string sochuyenbay { get {} set { _soCB = value; } }
         public string thang { get { return _thang; } set { _thang = value; } }
         public string doanhthu { get { return _doanhthu; } set { _doanhthu = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.YearSaleTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:147:35
     {
         string _soCB, _thang, _doanhthu, _tile;
         public string sochuyenbay { get { return _soCB; } set { _soCB = value; } }
-        public string thang { get { return _thang; } set { _thang = value; } }
+        public string thang { get {} set { _thang = value; } }
         public string doanhthu { get { return _doanhthu; } set { _doanhthu = value; } }
         public string tile { get { return _tile; } set { _tile = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.YearSaleTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:147:58
     {
         string _soCB, _thang, _doanhthu, _tile;
         public string sochuyenbay { get { return _soCB; } set { _soCB = value; } }
-        public string thang { get { return _thang; } set { _thang = value; } }
+        public string thang { get { return _thang; } set {} }
         public string doanhthu { get { return _doanhthu; } set { _doanhthu = value; } }
         public string tile { get { return _tile; } set { _tile = value; } }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.YearSaleTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:148:64
         string _soCB, _thang, _doanhthu, _tile;
         public string sochuyenbay { get { return _soCB; } set { _soCB = value; } }
         public string thang { get { return _thang; } set { _thang = value; } }
-        public string doanhthu { get { return _doanhthu; } set { _doanhthu = value; } }
+        public string doanhthu { get { return _doanhthu; } set {} }
         public string tile { get { return _tile; } set { _tile = value; } }
     }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.YearSaleTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:148:38
         string _soCB, _thang, _doanhthu, _tile;
         public string sochuyenbay { get { return _soCB; } set { _soCB = value; } }
         public string thang { get { return _thang; } set { _thang = value; } }
-        public string doanhthu { get { return _doanhthu; } set { _doanhthu = value; } }
+        public string doanhthu { get {} set { _doanhthu = value; } }
         public string tile { get { return _tile; } set { _tile = value; } }
     }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.YearSaleTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:149:34
         public string sochuyenbay { get { return _soCB; } set { _soCB = value; } }
         public string thang { get { return _thang; } set { _thang = value; } }
         public string doanhthu { get { return _doanhthu; } set { _doanhthu = value; } }
-        public string tile { get { return _tile; } set { _tile = value; } }
+        public string tile { get {} set { _tile = value; } }
     }
 }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.YearSaleTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/UserControls/YearRevenue.xaml.cs:149:56
         public string sochuyenbay { get { return _soCB; } set { _soCB = value; } }
         public string thang { get { return _thang; } set { _thang = value; } }
         public string doanhthu { get { return _doanhthu; } set { _doanhthu = value; } }
-        public string tile { get { return _tile; } set { _tile = value; } }
+        public string tile { get { return _tile; } set {} }
     }
 }
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.UserControlTest.YearSaleTest
