[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:235:16
                 }
             }
             int rowCount = SBTGTable.Items.Count;
-            if(rowCount < SoSanBayTGtoida)
+            if(!(rowCount < SoSanBayTGtoida))
             {
                 if (isSave == true)

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:564:67
                         return;
                     }
                 }
-                bool isValid = Regex.IsMatch(machuyenbayTxb.Text, "^[A-Z]{2}[0-9]{3}$");//định dạng MaCB
+                bool isValid = Regex.IsMatch(machuyenbayTxb.Text, "");//định dạng MaCB
                 if (!isValid)
                 {

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:565:21
                     }
                 }
                 bool isValid = Regex.IsMatch(machuyenbayTxb.Text, "^[A-Z]{2}[0-9]{3}$");//định dạng MaCB
-                if (!isValid)
+                if (isValid)
                 {
                     MessageBox.Show("Mã chuyến bay phải có định dạng như sau: XX000 ", "Dữ liệu không hợp lệ!");

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:573:21
             }
             try
             {
-                if (Regex.IsMatch(Gio, "^([0-1]\\d|2[0-3]):[0-5]\\d$"))//định dạng giờ
+                if (!(Regex.IsMatch(Gio, "^([0-1]\\d|2[0-3]):[0-5]\\d$")))//định dạng giờ
                 {
                     string[] thoigianKH = Gio.Split(':');

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:573:40
             }
             try
             {
-                if (Regex.IsMatch(Gio, "^([0-1]\\d|2[0-3]):[0-5]\\d$"))//định dạng giờ
+                if (Regex.IsMatch(Gio, ""))//định dạng giờ
                 {
                     string[] thoigianKH = Gio.Split(':');

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:597:21
                 }
                 else
                 {
-                    MessageBox.Show("Định dạng giờ không hợp lệ", "Thông báo");
+                    ;
                     return;
                 }

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:598:21
                 else
                 {
                     MessageBox.Show("Định dạng giờ không hợp lệ", "Thông báo");
-                    return;
+                    ;
                 }
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:603:72
             }
             catch
             {
-                MessageBox.Show("Giờ khởi hành không đúng định dạng ", "Dữ liệu không hợp lệ!");
+                MessageBox.Show("Giờ khởi hành không đúng định dạng ", "");
                 return;
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:607:24
                 return;
             }
             int ThoiGianBayToiThieu = 0;
-            string q = "SELECT * FROM BANGTHAMSO";
+            string q = "";
             DataTable d;
             using (SqlDataReader reader = DataProvider.ExecuteReader(q, CommandType.Text))

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:632:134
             }
             if (int.Parse(TgBay) < ThoiGianBayToiThieu)
             {
-                MessageBox.Show("Vui lòng nhập thời gian bay phải lớn hơn thời gian bay tối thiểu đã định: " + ThoiGianBayToiThieu + " phút", "Dữ liệu không hợp lệ!");
+                MessageBox.Show("Vui lòng nhập thời gian bay phải lớn hơn thời gian bay tối thiểu đã định: " + ThoiGianBayToiThieu + "", "Dữ liệu không hợp lệ!");
                 return;
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:637:85
             }
             if (Sanbaydi == Sanbayden)
             {
-                MessageBox.Show("Sân bay đi và sân bay đến không được trùng nhau.", "Dữ liệu không hợp lệ!");
+                MessageBox.Show("Sân bay đi và sân bay đến không được trùng nhau.", "");
                 return;
 

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:643:20
             }
             if (thaotac == 0)
             {
-                if(DataProvider.checkListHangVe(qLHangVeClass) == 0){
+                if(DataProvider.checkListHangVe(qLHangVeClass) != 0){
                     MessageBox.Show("Vui lòng chọn hạng vé cho chuyến bay.", "Dữ liệu không hợp lệ!");
                     return;

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:644:21
             if (thaotac == 0)
             {
                 if(DataProvider.checkListHangVe(qLHangVeClass) == 0){
-                    MessageBox.Show("Vui lòng chọn hạng vé cho chuyến bay.", "Dữ liệu không hợp lệ!");
+                    ;
                     return;
                 }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:649:25
                 }
                 else
                 {
-                    if (DataProvider.checkListHangVe(qLHangVeClass) == 1)
+                    if (DataProvider.checkListHangVe(qLHangVeClass) != 1)
                     {
                         MessageBox.Show("Vui lòng nhập thông tin đầy đủ cho hạng vé.", "Dữ liệu không hợp lệ!");

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:669:21
 
             if (thaotac == 0)
             {
-                if (DataProvider.isDuplicateValue(qLHangVeClass))
+                if (!(DataProvider.isDuplicateValue(qLHangVeClass)))
                 {
                     MessageBox.Show("Xuất hiện tình trạng mã hạng vé trùng nhau. ", "Thông báo");

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:671:37
             {
                 if (DataProvider.isDuplicateValue(qLHangVeClass))
                 {
-                    MessageBox.Show("Xuất hiện tình trạng mã hạng vé trùng nhau. ", "Thông báo");
+                    MessageBox.Show("", "Thông báo");
                     return;
                 }

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:709:21
             else
             {
                 List<QLHangVeClass> mergedList = qLHangVeClass.Concat(qLHangVeClassexist).ToList();
-                if (DataProvider.isDuplicateValue(mergedList))
+                if (!(DataProvider.isDuplicateValue(mergedList)))
                 {
                     MessageBox.Show("Xuất hiện tình trạng mã hạng vé trùng nhau. ", "Thông báo");

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddChuyenbay.xaml.cs:739:67
                 chuyenbayTable.Items.Clear();
                 loadDatatoTable();
             }
-            MessageBox.Show("Bạn đã lưu chuyến bay thành công. ", "Thông báo");
+            MessageBox.Show("Bạn đã lưu chuyến bay thành công. ", "");
             isSave = true;
         }
