[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:35:21
         {
             InitializeComponent();            
             if (MainWindow.curAccount != null) {
-                if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)
+                if (MainWindow.curAccount.type != 1 || MainWindow.curAccount.type == 2)
                 {
                     tbl_MaTK.Text = "Mã nhân viên: ";

[NoCoverage] Logical mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:51:17
 
         private void btnXacNhanVe_Click(object sender, RoutedEventArgs e)
         {
-            if (tenHanhKhachTxt.Text == "" || cmndTxt.Text == "" || sdtTxt.Text == "")
+            if (tenHanhKhachTxt.Text == "" || cmndTxt.Text == "" && sdtTxt.Text == "")
             {
                 MessageBox.Show("Vui lòng nhập đầy đủ thông tin hành khách!");

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:51:47
 
         private void btnXacNhanVe_Click(object sender, RoutedEventArgs e)
         {
-            if (tenHanhKhachTxt.Text == "" || cmndTxt.Text == "" || sdtTxt.Text == "")
+            if (tenHanhKhachTxt.Text == "" || cmndTxt.Text != "" || sdtTxt.Text == "")
             {
                 MessageBox.Show("Vui lòng nhập đầy đủ thông tin hành khách!");

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:66:29
 
                     foreach (Ticket item in ve)
                     {
-                        if (item.TicketID == maVeBox.SelectedItem.ToString())
+                        if (item.TicketID != maVeBox.SelectedItem.ToString())
                         {
                             item.HkID = maHanhKhachText.Text;

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:67:25
                     foreach (Ticket item in ve)
                     {
                         if (item.TicketID == maVeBox.SelectedItem.ToString())
-                        {
-                            item.HkID = maHanhKhachText.Text;
-                            item.HkName = tenHanhKhachTxt.Text;
-                            item.CMND = cmndTxt.Text;
-                            item.PhoneNumber = sdtTxt.Text;
-                        }
+                        {}
                     }
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:83:17
             bool check = true;
             DataProvider.sqlConnection.Open();
             SqlCommand sqlCommand = new SqlCommand(
-                "select [v].CMND from [VE] [v] where [v].CMND = @cmnd ", DataProvider.sqlConnection);
+                "", DataProvider.sqlConnection);
             sqlCommand.Parameters.Add("@cmnd", SqlDbType.NVarChar).Value = cmndTxt.Text;
             SqlDataReader reader = sqlCommand.ExecuteReader();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:102:21
             {
                 DataProvider.sqlConnection.Open();
                 SqlCommand sqlCommand = new SqlCommand(
-                    "select [c].Gia, [hv].TyLe from [CHUYENBAY] [c], [HANGVE] [hv], [VE] [v] where [c].MaChuyenBay = @macb " +
+                    "" +
                     "and [v].MaChuyenBay = [c].MaChuyenBay " +
                     "and [hv].MaHangVe = [v].MaHangVe " +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:105:21
                     "select [c].Gia, [hv].TyLe from [CHUYENBAY] [c], [HANGVE] [hv], [VE] [v] where [c].MaChuyenBay = @macb " +
                     "and [v].MaChuyenBay = [c].MaChuyenBay " +
                     "and [hv].MaHangVe = [v].MaHangVe " +
-                    "and [hv].TenHangVe=@tenHangVe",
+                    "",
                     DataProvider.sqlConnection);
                 sqlCommand.Parameters.Add("@macb", SqlDbType.NVarChar).Value = maChuyenBayTxt.Text;

[NoCoverage] Arithmetic mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:117:39
                     {
                         int dongia = int.Parse(reader["Gia"].ToString());
                         double TyLe = double.Parse(reader["TyLe"].ToString());
-                        tien += (int)(dongia * TyLe / 100);
+                        tien += (int)(dongia / TyLe / 100);
                     }
                 }

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:133:17
             foreach (Ticket item in ve)
             {
                 if (item.TicketID == maVeBox.SelectedItem.ToString())
-                {
-                    tenHanhKhachTxt.Text = item.HkName;
-                    cmndTxt.Text = item.CMND;
-                    sdtTxt.Text = item.PhoneNumber;
-                    soGheTxt.Text = item.SeatNumber.ToString();
-                    hangVeTxt.Text = item.FlightClass;
-                    maHanhKhachText.Text = item.HkID;
-                }
+                {}
             }
         }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:157:37
                     maHoaDonTxt.Text = mahd.ToString();
                 }
             }
-            else maHoaDonTxt.Text = "1";
+            else maHoaDonTxt.Text = "";
             DataProvider.sqlConnection.Close();
                         

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:166:52
         {
             int newID = 1;
             DataProvider.sqlConnection.Open();
-            SqlCommand sqlCommand = new SqlCommand("select [v].* from VE [v] order by CMND desc", DataProvider.sqlConnection);
+            SqlCommand sqlCommand = new SqlCommand("", DataProvider.sqlConnection);
             SqlDataReader reader = sqlCommand.ExecuteReader();
             if (reader.HasRows)

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:172:32
             {
                 if (reader.Read())
                 {
-                    if (reader["MaHK"].ToString() != "")
+                    if (reader[""].ToString() != "")
                     {
                         newID = int.Parse(reader["MaHK"].ToString()) + 1;

[NoCoverage] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:185:13
         {
             Ticket item = veLV.SelectedItem as Ticket;
             if (item != null)
-            {
-                tenHanhKhachTxt.Text = item.HkName;
-                cmndTxt.Text = item.CMND;
-                sdtTxt.Text = item.PhoneNumber;
-                soGheTxt.Text = item.SeatNumber.ToString();
-                hangVeTxt.Text = item.FlightClass;
-                maVeBox.SelectedItem = item.TicketID;
-                maHanhKhachText.Text = item.HkID;
-            }
+            {}
         }
 

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:221:45
                     {
                         string mv = reader["MaVe"].ToString();
                         int sg = int.Parse(reader["SoGhe"].ToString());
-                        string mhv = reader["TenHangVe"].ToString();
+                        string mhv = reader[""].ToString();
                         string tt = reader["TinhTrang"].ToString();
                         string thk = reader["TenHK"].ToString();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:224:46
                         string mhv = reader["TenHangVe"].ToString();
                         string tt = reader["TinhTrang"].ToString();
                         string thk = reader["TenHK"].ToString();
-                        string cmnd = reader["CMND"].ToString();
+                        string cmnd = reader[""].ToString();
                         string sdt = reader["SDT"].ToString();
                         ticket = new Ticket(mv, mhv, sg, tt, "", thk, cmnd, sdt);

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:246:17
             DataProvider.sqlConnection.Open();
             SqlCommand sqlcommand = new SqlCommand(
                 " select [s1].TenSanBay sbDi, [s2].TenSanBay sbDen, [c].NgayKhoiHanh, [c].ThoiGianXuatPhat " +
-                "from [CHUYENBAY] [c], [SANBAY] [s1], [SANBAY] [s2] " +
+                "" +
                 "where [c].MaChuyenBay = @macb and [s1].MaSanBay = [c].SanBayDi and [s2].MaSanBay = [c].SanBayDen",
                 DataProvider.sqlConnection);

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:256:38
                 if (rd.Read())
                 {
                     tuTxt.Text = rd["sbDi"].ToString();
-                    denTxt.Text = rd["sbDen"].ToString();
+                    denTxt.Text = rd[""].ToString();
                     ngayGiotxt.Text = rd["NgayKhoiHanh"].ToString() + " " + rd["ThoiGianXuatPhat"].ToString();
                 }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:257:42
                 {
                     tuTxt.Text = rd["sbDi"].ToString();
                     denTxt.Text = rd["sbDen"].ToString();
-                    ngayGiotxt.Text = rd["NgayKhoiHanh"].ToString() + " " + rd["ThoiGianXuatPhat"].ToString();
+                    ngayGiotxt.Text = rd[""].ToString() + " " + rd["ThoiGianXuatPhat"].ToString();
                 }
             }            

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:286:17
 
         private void btnTTSau_Click(object sender, RoutedEventArgs e)
         {
-            if (!DataProvider.checkInfor(ve))
+            if (DataProvider.checkInfor(ve))
             {
                 MessageBox.Show("Vui lòng nhập đầy đủ thông tin vé!");

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:294:13
             {
                 //ko đặt vé nếu quá hạn chậm đặt vé
                 SqlCommand _sqlCommand = new SqlCommand(
-            "select GiaTri from [BANGTHAMSO] " +
+            "" +
             "where convert(varchar, TenThamSo)='ThoiGianChamNhatChoPhepDatVe'", DataProvider.sqlConnection);
                 SqlDataAdapter _adapter = new SqlDataAdapter(_sqlCommand);

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:305:21
                 string format = "dd/MM/yyyy HH:mm";
                 DateTime dateTimeDeparture = DateTime.ParseExact(ngayGiotxt.Text, format, provider);
                 DateTime dateTimeNow = DateTime.Now;
-                if (dateTimeDeparture - dateTimeNow - tgChamNhatDatVe > TimeSpan.Zero)
+                if (!(dateTimeDeparture - dateTimeNow - tgChamNhatDatVe > TimeSpan.Zero))
                 {
                     MessageBoxResult result = MessageBox.Show("Bạn có chắc chắn muốn đặt vé?", "", MessageBoxButton.YesNo);

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:321:32
                         sqlCommand.ExecuteNonQuery();
                         DataProvider.sqlConnection.Close();
 
-                        SaveVe("BOOKED");
+                        SaveVe("");
                         SaveCTHD();
                         //go to home screen in MainWindow

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:324:29
                         SaveVe("BOOKED");
                         SaveCTHD();
                         //go to home screen in MainWindow
-                        if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)
+                        if (!(MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2))
                         {
                             result = MessageBox.Show("Đặt vé thành công! \nVui lòng nhắc nhở hành khách thanh toán hóa đơn trước khi chuyến bay xuất phát! \n" +

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:326:54
                         //go to home screen in MainWindow
                         if (MainWindow.curAccount.type == 1 || MainWindow.curAccount.type == 2)
                         {
-                            result = MessageBox.Show("Đặt vé thành công! \nVui lòng nhắc nhở hành khách thanh toán hóa đơn trước khi chuyến bay xuất phát! \n" +
+                            result = MessageBox.Show("" +
                             "Phiếu đặt chỗ sẽ bị hủy nếu không được thanh toán trước giờ bay!");
                         }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:343:112
                 }
                 else
                 {
-                    MessageBox.Show("Vé phải được đặt chậm nhất trước giờ khởi hành là: " + _tgChamNhatDatVe + " giờ");
+                    MessageBox.Show("Vé phải được đặt chậm nhất trước giờ khởi hành là: " + _tgChamNhatDatVe + "");
 
                 }

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:362:21
                 string format = "dd/MM/yyyy HH:mm";
                 DateTime dateTimeDeparture = DateTime.ParseExact(ngayGiotxt.Text, format, provider);
                 DateTime dateTimeNow = DateTime.Now;
-                if (dateTimeDeparture - dateTimeNow > TimeSpan.Zero)
+                if (!(dateTimeDeparture - dateTimeNow > TimeSpan.Zero))
                 {
 

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:412:21
                 SqlDataAdapter adapter = new SqlDataAdapter();
                 SqlCommand sqlCommand = new SqlCommand(
                     "update [VE] set MaHK = @mahk, TenHK = @tenhk, CMND = @cmnd, SDT = @sdt, TinhTrang = @tinhtrang " +
-                    "where MaVe = @mave", DataProvider.sqlConnection);
+                    "", DataProvider.sqlConnection);
                 sqlCommand.Parameters.Add("@mahk", SqlDbType.NVarChar).Value = item.HkID;
                 sqlCommand.Parameters.Add("@tenhk", SqlDbType.NVarChar).Value = item.HkName;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:451:21
                 DataProvider.sqlConnection.Open();
                 SqlDataAdapter adapter = new SqlDataAdapter();
                 sqlCommand = new SqlCommand(
-                    "insert into [CTHD] values (@macthd, @mahd, @mave)", DataProvider.sqlConnection);
+                    "", DataProvider.sqlConnection);
                 Random r = new Random();
                 int ID = r.Next(100000000, 999999999);

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:454:43
                     "insert into [CTHD] values (@macthd, @mahd, @mave)", DataProvider.sqlConnection);
                 Random r = new Random();
                 int ID = r.Next(100000000, 999999999);
-                sqlCommand.Parameters.Add("@macthd", SqlDbType.NVarChar).Value = ID.ToString() + item.TicketID;
+                sqlCommand.Parameters.Add("", SqlDbType.NVarChar).Value = ID.ToString() + item.TicketID;
                 sqlCommand.Parameters.Add("@mahd", SqlDbType.NVarChar).Value = maHoaDonTxt.Text;
                 sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = item.TicketID;

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:456:43
                 int ID = r.Next(100000000, 999999999);
                 sqlCommand.Parameters.Add("@macthd", SqlDbType.NVarChar).Value = ID.ToString() + item.TicketID;
                 sqlCommand.Parameters.Add("@mahd", SqlDbType.NVarChar).Value = maHoaDonTxt.Text;
-                sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = item.TicketID;
+                sqlCommand.Parameters.Add("", SqlDbType.NVarChar).Value = item.TicketID;
                 sqlCommand.ExecuteNonQuery();
                 DataProvider.sqlConnection.Close();

[NoCoverage] Statement mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddInforHK.xaml.cs:457:17
                 sqlCommand.Parameters.Add("@macthd", SqlDbType.NVarChar).Value = ID.ToString() + item.TicketID;
                 sqlCommand.Parameters.Add("@mahd", SqlDbType.NVarChar).Value = maHoaDonTxt.Text;
                 sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = item.TicketID;
-                sqlCommand.ExecuteNonQuery();
+                ;
                 DataProvider.sqlConnection.Close();
                 i++;
