[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:158:17
                     }
                 }
             }
-            if (!DataProvider.isPositiveInteger(tgDung))
+            if (DataProvider.isPositiveInteger(tgDung))
             {
                 MessageBox.Show("Vui lòng nhập thời gian dừng là một số nguyên.", "Dữ liệu không hợp lệ!");

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:160:33
             }
             if (!DataProvider.isPositiveInteger(tgDung))
             {
-                MessageBox.Show("Vui lòng nhập thời gian dừng là một số nguyên.", "Dữ liệu không hợp lệ!");
+                MessageBox.Show("", "Dữ liệu không hợp lệ!");
                 return;
             }

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:179:17
                     TGdungtoida = dr.Field<int>(1);
                 }
             }
-            if (int.Parse(tgDung) < TGdungtoithieu || int.Parse(tgDung) > TGdungtoida)
+            if (!(int.Parse(tgDung) < TGdungtoithieu || int.Parse(tgDung) > TGdungtoida))
             {
                 string tb = TGdungtoithieu + " phút" + " - " + TGdungtoida + " phút";

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:182:132
             if (int.Parse(tgDung) < TGdungtoithieu || int.Parse(tgDung) > TGdungtoida)
             {
                 string tb = TGdungtoithieu + " phút" + " - " + TGdungtoida + " phút";
-                MessageBox.Show("Vui lòng nhập thời gian dừng phải phù hợp với thời gian dừng tối thiểu và tối đa đã định: " + tb, "Dữ liệu không hợp lệ!");
+                MessageBox.Show("Vui lòng nhập thời gian dừng phải phù hợp với thời gian dừng tối thiểu và tối đa đã định: " + tb, "");
                 return;
             }

[NoCoverage] Negate expression
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:185:17
                 MessageBox.Show("Vui lòng nhập thời gian dừng phải phù hợp với thời gian dừng tối thiểu và tối đa đã định: " + tb, "Dữ liệu không hợp lệ!");
                 return;
             }
-            if (int.Parse(tgDung) >= int.Parse(AddChuyenbay.thoigianbayDC))
+            if (!(int.Parse(tgDung) >= int.Parse(AddChuyenbay.thoigianbayDC)))
             {
                 MessageBox.Show("Vui lòng nhập thời gian dừng phải bé hơn thời gian bay của chuyến bay: " + AddChuyenbay.thoigianbayDC + " phút", "Dữ liệu không hợp lệ!");

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:187:33
             }
             if (int.Parse(tgDung) >= int.Parse(AddChuyenbay.thoigianbayDC))
             {
-                MessageBox.Show("Vui lòng nhập thời gian dừng phải bé hơn thời gian bay của chuyến bay: " + AddChuyenbay.thoigianbayDC + " phút", "Dữ liệu không hợp lệ!");
+                MessageBox.Show("" + AddChuyenbay.thoigianbayDC + " phút", "Dữ liệu không hợp lệ!");
                 return;
             }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:203:44
                 }
                 foreach(DataRow dr in dt9.Rows)
                 {
-                    tongTG += int.Parse(dr["ThoiGianDung"].ToString());
+                    tongTG += int.Parse(dr[""].ToString());
                 }
             }

[NoCoverage] Equality mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:206:88
                     tongTG += int.Parse(dr["ThoiGianDung"].ToString());
                 }
             }
-            if (int.Parse(tgDung) + tongTG >= int.Parse(AddChuyenbay.thoigianbayDC) && thaotac==0)
+            if (int.Parse(tgDung) + tongTG >= int.Parse(AddChuyenbay.thoigianbayDC) && thaotac!=0)
             {
                 MessageBox.Show("Tổng thời gian dừng không được lớn hơn hoặc bằng thời gian bay: " + AddChuyenbay.thoigianbayDC + " phút", "Dữ liệu không hợp lệ!");

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:229:38
                 SanbayTG sb = new SanbayTG();
                 sb.STT = (dt.Rows.Count + 1).ToString();
                 s = "SELECT * From SANBAY WHERE MaSanBay = @ma";
-                p = new SqlParameter("@ma", tenSB);
+                p = new SqlParameter("", tenSB);
                 using (SqlDataReader reader = DataProvider.ExecuteReader(s, CommandType.Text, p))
                 {

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:246:99
                 {
                     con.Open();
                 }
-                SqlCommand cmd = new SqlCommand("Insert into SANBAYTRUNGGIAN values(N'" + tenSB + "',N'" + maCB + "',N'" + tgDung + "',N'" + GhiChu + "')", con);
+                SqlCommand cmd = new SqlCommand("Insert into SANBAYTRUNGGIAN values(N'" + tenSB + "" + maCB + "',N'" + tgDung + "',N'" + GhiChu + "')", con);
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/AddSBTG.xaml.cs:262:74
                 {
                     if (reader.Read())
                     {
-                        MaSBTGtofix = reader.GetString(reader.GetOrdinal("MaSanBay"));
+                        MaSBTGtofix = reader.GetString(reader.GetOrdinal(""));
                     }
                 }
