[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:43:17
                 txblError.Text = "Vui lòng nhập đầy đủ thông tin!";
                 return;
             }
-            if (!DataProvider.isPositiveInteger(Percentage.Text))
+            if (DataProvider.isPositiveInteger(Percentage.Text))
             {
                 MessageBox.Show("Vui lòng nhập tỷ lệ phần trăm là một số nguyên dương.", "Dữ liệu không hợp lệ!");

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:61:42
                     int count = Convert.ToInt32(sqlCmd.ExecuteScalar());
                     if (count > 0)
                     {
-                        txblError.Text = "Hạng vé này đã tồn tại!";
+                        txblError.Text = "";
                         return;
                     }

[NoCoverage] String mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/View/FareClassForm.xaml.cs:73:142
             try
             {
                 sqlCon.Open();
-                SqlCommand cmd = new SqlCommand("Insert into [HANGVE] values('" + "HV" + ID + "',N'" + Name.Text + "','" + Percentage.Text + "')", sqlCon);
+                SqlCommand cmd = new SqlCommand("Insert into [HANGVE] values('" + "HV" + ID + "',N'" + Name.Text + "','" + Percentage.Text + "", sqlCon);
                 cmd.CommandType = CommandType.Text;
                 cmd.ExecuteNonQuery();
