[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Data/BANGTHAMSO.cs:31:13
         public static int SoSBTGToiDa
         {
             get
-            {
-                return soSBTGToiDa;
-            }
+            {}
             set
             {
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.BANGTHAMSOTEST.ThoiGianBayToiThieuTest

[Killed] Block removal mutation
SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/Data/BANGTHAMSO.cs:35:13
                 return soSBTGToiDa;
             }
             set
-            {
-                soSBTGToiDa = value;
-            }
+            {}
         }
         public static int ThoiGianDungToiThieu
killedBy: Quan_Ly_Ban_Ve_May_Bay_Test.BANGTHAMSOTEST.ThoiGianBayToiThieuTest
