[NoCoverage] String mutation
C:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:78:70
                 {
                     if (rd.Read())
                     {
-                        Timeout = TimeSpan.FromHours(double.Parse(rd["GiaTri"].ToString()));
+                        Timeout = TimeSpan.FromHours(double.Parse(rd[""].ToString()));
                     }
                 }

[NoCoverage] String mutation
C:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:86:21
                 DataProvider.sqlConnection.Open();
                 SqlCommand sqlCommand = new SqlCommand(
                     "select [c].NgayKhoiHanh, [c].ThoiGianXuatPhat, [v].MaVe " +
-                    "from [CHUYENBAY] [c], [VE] [v] " +
+                    "" +
                     "where [c].MaChuyenBay = [v].MaChuyenBay and [v].TinhTrang = 'BOOKED'"
                     , DataProvider.sqlConnection);

[NoCoverage] String mutation
C:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:96:78
                 {
                     while (reader.Read())
                     {
-                        string strtime = reader["NgayKhoiHanh"].ToString() + " " + reader["ThoiGianXuatPhat"].ToString();
+                        string strtime = reader["NgayKhoiHanh"].ToString() + "" + reader["ThoiGianXuatPhat"].ToString();
                         DateTime flighttime = DateTime.ParseExact(strtime, "dd/MM/yyyy HH:mm", CultureInfo.InvariantCulture);
                         TimeSpan time = flighttime - DateTime.Now;

[NoCoverage] String mutation
C:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:96:91
                 {
                     while (reader.Read())
                     {
-                        string strtime = reader["NgayKhoiHanh"].ToString() + " " + reader["ThoiGianXuatPhat"].ToString();
+                        string strtime = reader["NgayKhoiHanh"].ToString() + " " + reader[""].ToString();
                         DateTime flighttime = DateTime.ParseExact(strtime, "dd/MM/yyyy HH:mm", CultureInfo.InvariantCulture);
                         TimeSpan time = flighttime - DateTime.Now;

[NoCoverage] Negate expression
C:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:108:21
                 }
                 DataProvider.sqlConnection.Close();
 
-                if (ticket_des.Count > 0)
+                if (!(ticket_des.Count > 0))
                 {
                     //List<string> bookings = new List<string>();

[NoCoverage] String mutation
C:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:148:29
                     {
                         DataProvider.sqlConnection.Open();
                         sqlCommand = new SqlCommand(
-                            "update [VE] set TinhTrang = 'TRONG', TenHK = NULL, CMND = NULL, SDT = NULL, MaHK = NULL" +
+                            "" +
                             " where MaVe = @mave ", DataProvider.sqlConnection);
                         sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = ticket;

[NoCoverage] String mutation
C:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:149:29
                         DataProvider.sqlConnection.Open();
                         sqlCommand = new SqlCommand(
                             "update [VE] set TinhTrang = 'TRONG', TenHK = NULL, CMND = NULL, SDT = NULL, MaHK = NULL" +
-                            " where MaVe = @mave ", DataProvider.sqlConnection);
+                            "", DataProvider.sqlConnection);
                         sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = ticket;
                         sqlCommand.ExecuteNonQuery();

[NoCoverage] String mutation
C:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:182:31
                         allFlight.ShowDetail += AllFlight_ShowDetail;
                     }
 
-                    string id="";
+                    string id="Stryker was here!";
                     foreach (string ticket in ticket_des)
                     {

[NoCoverage] String mutation
C:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:187:29
                     {
                         DataProvider.sqlConnection.Open();
                         sqlCommand = new SqlCommand(
-                            "select [hd].MaTK from [HOADON] [hd], [CTHD] [ct] " +
+                            "" +
                             "where [ct].MaVe = @mave and [ct].MaHD = [hd].MaHD", DataProvider.sqlConnection);
                         sqlCommand.Parameters.Add("@mave", SqlDbType.NVarChar).Value = ticket;

[NoCoverage] String mutation
C:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:249:59
             }
             else
             {
-                MessageBoxResult result = MessageBox.Show("Vui lòng đăng nhập trước khi đặt vé!");
+                MessageBoxResult result = MessageBox.Show("");
                 if (result == MessageBoxResult.OK)
                 {

[NoCoverage] Statement mutation
C:/SE104-QLBVMB/Quan-Ly-Ban-Ve-May-Bay/MainWindow.cs:273:13
             flights.Return += Flights_Return;
             flights.Search += Flights_Return;
             flights.ShowDetail += Flight_ShowDetail;
-            flights.FlightSearched(home.departure, home.destination, home._date, home.quantity, home.flightClass);
+            ;
             fContainer.Content = flights;
 
